[{"name": "HSC200H5 • Imaging Technologies for Scientific Visual Communication", "description": "Introduction to image and media technologies central to modern digital communication, with emphasis on their use in science communication and education. Topics include the appropriate use of visual media, design strategies, design for legibility and scientific image conventions. Tutorial sessions will introduce vector and bitmap image creation and manipulation tools.", "prerequisites": {"and": ["BIO152H5", "BIO153H5"], "or": []}}, {"name": "HSC300H5 • Written Communication for Health Care", "description": "This course presents the principles of communicating effective audience-specific health information in both print and electronic media. Students will learn to analyze the form, content, language, and imagery of written health communication; to locate the published research behind health reports in the popular media; and to communicate clear, accurate health information to medical professionals, general audiences, and readers with low literacy skills.", "prerequisites": "BIO152H5"}, {"name": "HSC301H5 • Data and Information Visualization", "description": "This course presents the principles of information design: the clear, concise and truthful presentation of data in static and interactive graphics. Visualization is used to explore data, reveal patterns, and to communicate to different audiences. Topics range from human visual perception and cognition, to the critical interpretation of design and accuracy in information graphics. Practical application of course material will require students to develop information graphics for peer review and critique.", "prerequisites": "HSC200H5"}, {"name": "HSC302H5 • Biocommunication Visualization", "description": "This course covers analysis and development of visual media for medical or scientific topics. Lectures include: light/form; proportion/scale; scientific visual conventions; media appropriate for target audience and reproduction. Topics may include: physiology, anatomical/biological subjects, patient education or health promotion. Classes consist of lectures with computer lab explorations.", "prerequisites": "HSC200H5"}, {"name": "HSC307H5 • Visual Presentation Design for Life Sciences", "description": "This course teaches students basic graphic and multimedia design theory, and skills required to create effective scientific posters and oral-visual presentations. Topics include the communication objectives of different presentation types; human visual perception and design; and theories of multimedia learning. Students will create media using evidence-based design principles.", "prerequisites": {"and": ["BIO152H5", "BIO153H5", "HSC200H5"], "or": []}}, {"name": "HSC308H5 • Visual Methods: From Atoms to Cells", "description": "This course examines the visualization process in molecular and cellular structural biology, how it has evolved, and its relationship to advances in technology and science. You will learn how to create molecular models suitable for visual exploration, analysis, and/or communication of spatial scales ranging from the atomic to cellular.", "prerequisites": {"and": ["BIO206H5", "HSC200H5"], "or": []}}, {"name": "HSC401H5 • Health and Science Communication Design", "description": "This course presents the principles of health and science communication and examines the characteristics of effective audience-specific media design. Included are issues of learning context, target audience analysis, and effective information design in the development of tools that communicate concepts to the general public. Students will analyze existing media, conduct an information needs assessment, and design an *interactive learning tool* on a current health or science-related topic.", "prerequisites": "HSC200H5 and one of the following courses: HSC300H5 or HSC301H5 or HSC302H5 or HSC307H5"}, {"name": "HSC402H5 • Digital Learning Environments in Biology and Health Science", "description": "This course focuses on the design, development and evaluation of digital learning environments for biology and health sciences education. An overview of learning management systems, knowledge object design, collaborative knowledge building environments, simulations, tutorials, and games will be presented. Emerging communications technologies will be discussed in theory, explored through examples, and applied through prototype design.", "prerequisites": "HSC200H5 and one of the following courses: HSC300H5 or HSC301H5 or HSC302H5 or HSC307H5 "}, {"name": "HSC403H5 • Visualization of Forensic Demonstrative Evidence", "description": "This course examines the visual representation of forensic demonstrative evidence in Canadian courtrooms. A case-based approach simulates professional practice. Forensic anthropology, biology and visual communication theory are explored in new media for presentation. Visual problem solving skills are developed through collaboration. In class, presentations and practica are combined with critical analysis of visualizations.", "prerequisites": "10.0 credits, including ANT205H5 or ANT306H5 or (BIO208H5 and BIO209H5) or BIO210Y5 or FSC239Y5"}, {"name": "HSC404H5 • Visualizing the Past", "description": "This course examines the visual representation of physical evidence in paleontology and paleoanthropology. Photography, traditional illustration, and digital rendering are used to produce scientific graphics in support of published research. Through practical and analytical exercises students will gain an understanding of the media and techniques used to visually represent data.", "prerequisites": "(HSC200H5 and one of the following courses: HSC300H5 or HSC301H5 or HSC302H5 or HSC307H5) or permission of instructor "}, {"name": "HSC405H5 • Digital Forensic Facial Approximation", "description": "This course examines the technical, anatomical, and sociological considerations involved in the three-dimensional digital forensic facial approximation. Human facial anatomy, traditional reconstruction techniques, and the use of 3D animation software are the core areas of study. Using this knowledge, students reconstruct the facial identity of an individual known only from cranial skeletal remains.", "prerequisites": "(HSC200H5 and one of the following courses: HSC300H5 or HSC301H5 or HSC302H5 or HSC307H5) or permission of instructor"}, {"name": "HSC406H5 • Advanced Written Communication for Health Care", "description": "This course builds on skills developed in HSC300H. Topics include: communication of epidemiological data and of best evidence in medical and health science research. Students learn to think critically about health and science research, interpret complex or contentious evidence from the medical literature, and produce in-depth health information documents in a range of formats.", "prerequisites": "HSC300H5"}]