[{"name": "CHM110H5 • Chemical Principles 1", "description": "Matter and its transformations are studied at the macroscopic level. Topics include stoichiometry, phases of matter, equilibria, thermodynamics and electrochemistry.", "prerequisites": "Grade 12 Chemistry (SCH4U) (minimum grade of 70) and Grade 12 Advanced Functions (MHF4U0) (minimum grade of 70) and Grade 12 Calculus and Vectors (MCV4U) highly recommended"}, {"name": "CHM120H5 • Chemical Principles 2", "description": "Building on the subject matter ofCHM110H5, molecular events are studied at the microscopic level. Topics include atomic and molecular structure, intermolecular forces of attraction, reaction kinetics, and organic chemical reactions and mechanisms.", "prerequisites": "CHM110H5"}, {"name": "CHM211H5 • Fundamentals of Analytical Chemistry", "description": "A rigorous introduction to the theory and practice of analytical chemistry. Development and applications of basic statistical concepts in treatment and interpretation of analytical data; direct and indirect precipitations; volumetric methods; acid-base, complexometric, redox and precipitation titrations; introduction to instrumental methods; potentiometry and absorption spectroscopy. Applications in biomedical, forensic and environmental areas will be considered.", "prerequisites": "CHM110H5 and a minimum grade of 60% in CHM120H5 and [(MAT132H5 and MAT134H5) or (MAT135H5 and MAT136H5) or (MAT137H5 and MAT139H5) or (MAT157H5 and MAT159H5) or (MAT134Y5 or MAT135Y5 or MAT137Y5 or MAT157Y5)]"}, {"name": "CHM231H5 • Inorganic Chemistry I", "description": "Atomic structure; periodic properties of the elements; bonding theories-ionic, covalent (valence bond and molecular orbital) and metallic; structure and bonding in coordination compounds of main group elements and transition metals; descriptive chemistry of the metals. Reaction mechanisms.", "prerequisites": "CHM110H5 and a minimum grade of 60% in CHM120H5 and [(MAT132H5 and MAT134H5) or (MAT137H5 and MAT139H5) or (MAT157H5 and MAT159H5) or (MAT135H5 and MAT136H5) or (MAT134Y5 or MAT135Y5 or MAT137Y5 or MAT157Y5)]."}, {"name": "CHM242H5 • Introductory Organic Chemistry I", "description": "Fundamentals of organic chemistry emphasizing reactions of alkanes and alkenes. The first half of a two-course sequence (withCHM243H5) required in the Chemistry major and specialist programs.", "prerequisites": "CHM110H5 and a minimum grade of 60% in CHM120H5 and [(MAT132H5 and MAT134H5) or (MAT135H5 and MAT136H5) or (MAT137H5 and MAT139H5) or (MAT157H5 and MAT159H5) or (MAT134Y5 or MAT135Y5 or MAT137Y5 or MAT157Y5)]."}, {"name": "CHM243H5 • Introductory Organic Chemistry II", "description": "The chemistry of benzene, alcohols, aldehydes, ketones, carboxylic acid, esters, acid chlorides, amides and amines will be covered. As well, electrophilic aromatic substitution, protection and deprotection of alcohols, nucleophilic acyl substitution, nucleophilic addition, carbonyl alpha-substitution reaction, keto-enol tautomerism, carbonyl condensation and amines will be introduced. The emphasis will be on organic mechanisms and application of organic reactions to multistep synthesis. Continues fromCHM242H5.", "prerequisites": "CHM242H5"}, {"name": "CHM299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. This course does not count as one of the requirements in the Chemistry Minor, Chemistry Major, Chemistry Specialist or Biological Chemistry Specialist programs. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of at least 4.0 credits and no more than 10.0 credits, which must include CHM110H5 and CHM120H5 with a minimum grade of 60% and [(MAT132H5 and MAT134H5) or (MAT135H5 and MAT136H5) or (MAT137H5 and MAT139H5) or (MAT157H5 and MAT159H5) or (MAT134Y5 or MAT135Y5 or MAT137Y5 or MAT157Y5)]."}, {"name": "CHM311H5 • Instrumental Analytical Chemistry", "description": "Introduction to the basic theory and practice underlying important techniques in analytical chemistry, chosen from three major areas of instrumental analysis: spectroscopy, electrochemistry and separation science. Specific topics will include fluorescence spectroscopy, atomic spectroscopy, x-ray fluorescence, voltammetry, high resolution gas and liquid chromatography, mass spectrometry, and a brief introduction to computer applications, including Fourier transform methods. A problem-based approach will be used to explore these methods in a wide variety of practical applications, which will include individualized student assignments.", "prerequisites": "CHM211H5"}, {"name": "CHM323H5 • Introduction to Computational Chemistry", "description": "This course covers the foundations of computational chemistry with a focus on practical applications and does not require a background in programming or quantum mechanics. An array of methods for predicting the structural, electronic, thermodynamic, and spectroscopic properties of chemical species will be addressed, as well as how the calculated results can complement experimental observations. Relevant fundamental theories to computational chemistry will be covered on a need-to-know basis. Students will follow an individualized study path and select the chemical systems to which each method will be applied.", "prerequisites": "CHM243H5"}, {"name": "CHM331H5 • Inorganic Chemistry II:  Advanced Inorganic Chemistry", "description": "Chemistry of metallic elements. Organometallics. Main group and transition elements. Rings, cages and clusters. Lanthanides and Actinides. Applications of IR, UV-VIS and multinuclear NMR spectroscopy. Symmetry. Inorganic synthesis. Non-aqueous solvents. Structure and bonding. Catalysis and industrial processes.", "prerequisites": {"and": ["CHM231H5", "CHM242H5"], "or": []}}, {"name": "CHM333H5 • Bioinorganic Chemistry", "description": "Principles of inorganic chemical reactions and their application to biochemical systems: kinetics, mechanisms and thermodynamics of ligand exchange, acid-base and redox reactions involving metalloproteins and their model compounds; mechanisms of catalysis by metalloenzymes and their model compounds; metal ion related diseases; metals in chemotherapy.", "prerequisites": {"and": ["CHM231H5", "CHM242H5"], "or": []}}, {"name": "CHM341H5 • Organic Chemistry:  Mechanism and Structure", "description": "Stereochemistry and conformational analysis; mechanisms of important types of organic reaction; pericyclic reactions; reactive intermediates.", "prerequisites": "CHM243H5"}, {"name": "CHM345H5 • Organic Synthesis", "description": "Methods used for forming carbon-carbon bonds will be reviewed, including reactions of the various types of nucleophilic carbon and the use of organometallic reagents. Other topics include functional group interconversions, oxidation and reduction and the role of elements such as boron, silicon and tin in organic synthesis.", "prerequisites": "CHM243H5"}, {"name": "CHM347H5 • Organic Chemistry of Biological Compounds", "description": "The chemistry of selected classes of naturally occurring molecules such as those below, with emphasis on structure, stereochemistry, properties and synthesis. Amino acids, peptides, proteins, carbohydrates, lipids, nucleosides, nucleotides, and nucleic acids.", "prerequisites": "CHM243H5"}, {"name": "CHM361H5 • Structural Biochemistry", "description": "An introduction to the molecular anatomy and properties of the major cellular biomolecules: proteins, nucleic acids, carbohydrates and lipids. The course also covers the structural organization of membranes and other macromolecular complexes. Enzyme mechanisms and membrane transport phenomena will be examined in the context of quantitative analyses these processes and of structure/function relationships.", "prerequisites": "CHM243H5"}, {"name": "CHM362H5 • Metabolism and Bioenergetics", "description": "Basic principles of biological energetics. Metabolic pathways for carbohydrate and lipid synthesis and degradation. Survey of amino acid and nucleotide metabolism. Integration and cellular regulation of metabolism. Intracellular signal transduction mechanisms.", "prerequisites": "CHM361H5"}, {"name": "CHM372H5 • Techniques in Biological Chemistry I", "description": "The first in a sequence of two laboratory courses intended to complementCHM361H5andCHM362H5. Experiments are designed to familiarize students with techniques commonly used to study the chemical and physical properties of biological molecules. Topics covered in the first half also include a wide range of chromatographic and/or fractionation methods to separate proteins and/or subcellular organelles, enzyme kinetics, electrophoresis to study proteins and their complexes. The theoretical basis for each experiment will be covered in a 1-hour lecture each week.", "prerequisites": "CHM243H5"}, {"name": "CHM373H5 • Techniques in Biological Chemistry II", "description": "The second in a sequence of two laboratory courses intended to complementCHM361H5andCHM362H5.CHM373H5carries on fromCHM372H5with a particular emphasis on protein purification, enzyme kinetics and protein characterization (e.g.,kinetics, reactions, binding, depending on the protein studied). Techniques covered include classic biochemical techniques used in studying proteins and protein complexes, such as chromatography and fluorescence methods. The theoretical basis for each experiment will be covered in a 1-hour lecture each week.", "prerequisites": "CHM372H5"}, {"name": "CHM394H5 • Chemical Synthesis Laboratory I", "description": "The first in a sequence of two laboratory courses in synthetic chemistry. This laboratory course comprises the synthesis of inorganic and organic compounds supplemented by physical measurements (e.g., ir, uv, 1H NMR spectra, magnetic susceptibility, etc.) of the products where appropriate. Approximately six weeks each will be spent on two groups of foundational experiments, one in organic and one in inorganic synthesis to illustrate techniques of chemical synthesis. The central role of the carbonyl group in organic synthesis is elaborated, an organic unknown is identified both chemically and spectroscopically and the synthetic chemistry of the first row transition elements is explored.", "prerequisites": {"and": ["CHM231H5", "CHM243H5"], "or": []}}, {"name": "CHM395H5 • Chemical Synthesis Laboratory II", "description": "The second in a sequence of two laboratory courses in synthetic chemistry that builds on the foundations established inCHM394H5. Students choose their own experiments in this course from offerings comprising the synthesis of organic, organometallic and inorganic compounds and in computational chemistry. Techniques such as working at low temperatures and in inert atmospheres (e.g., glove box) are introduced. Depending on the experiments actually chosen, a mixed organic unknown is separated and identified, organic rearrangements and the synthetic chemistry of elements from across the Periodic Table including main group, transition elements and lanthanides are explored. A highlight is an optional four week independent synthesis project in any area of synthetic chemistry adapting procedures from the published, including recent, research literature.", "prerequisites": "CHM394H5"}, {"name": "CHM396H5 • Analytical and Physical Chemistry Instrumentation Laboratory I", "description": "This analytical and physical chemistry laboratory course represents an integration of the study of fundamental physical chemistry with wide-ranging applications to instrumental methods of analysis, such as separation science, electrochemistry and spectroscopy. The course will provide a solid hands-on grounding in many of the major topics covered in analytical and physical chemistry, and the optimization of instrumental analytical measurements by the application of physical principles. Students select from a variety of instruments to customize their program, and develop their own analytical methods to address analytical problems of interest to the student.", "prerequisites": {"and": ["CHM211H5", "JCP221H5"], "or": []}}, {"name": "CHM397H5 • Analytical and Physical Chemistry Instrumentation Laboratory II", "description": "This analytical and physical chemistry laboratory course carries on from CHM396 to introduce more advanced topics in instrumental methods of analysis and physical chemistry concepts. The course will include experimental modules focused on instrument design and computer interfacing, molecular spectroscopy (e.g. fluorescence, infrared and Raman, and NMR), plasmon resonance methods for biomolecule determinations and kinetic analysis, microfluidics and lab-on-a-chip technologies. The course will provide practical experience in the optimization of instrumental analytical measurements, experiment design, and topics of relevance to research in analytical and physical chemistry.", "prerequisites": "CHM396H5"}, {"name": "CHM399Y5 • Research Opportunity Program", "description": "This course provides third-year undergraduate students (after completion of 8.0 credits) who have developed some knowledge of Chemistry and its research methods, an opportunity to work in the research project of a professor in return for course credit. Students enrolled have the opportunity to become involved in original research, enhance their research skills and share in the excitement of acquiring new knowledge and in the discovery process of science. This course does not count as one of the requirements in the Chemistry Minor program. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "8.0 credits, including CHM110H5 and CHM120H5 with a minimum grade of 60% and [(MAT132H5 and MAT134H5) or (MAT135H5 and MAT136H5) or (MAT137H5 and MAT139H5) or (MAT157H5 and MAT159H5) or (MAT134Y5 or MAT135Y5 or MAT137Y5 or MAT157Y5)] and 2.0 credit of CHM/ JCP at the 200-level."}, {"name": "CHM412H5 • Sensors, Sequencers, and Diagnostic Technologies", "description": "An exploration of biomolecule analysis methodologies, with an emphasis on nucleic acid analysis, will be done from the perspective of the Analytical Biochemist. The course will begin with brief reviews of the structure and function of biomolecules, solid-phase synthesis, extraction, pre-concentration and amplification methods. This will be followed by an exploration of established and emerging techniques for target biomolecule determinations, including: bioprobes, microarrays, biosensors and DNA sequencing technologies (including single molecule approaches). Current examples of implementation in the fields of proteomics and genomics will be discussed throughout the course, with an emphasis on life sciences and diagnostic testing applications. Course work will include independent literature reviews and student presentations.", "prerequisites": "CHM311H5"}, {"name": "CHM414H5 • Advanced Topics in Analytical Chemistry", "description": "An overview of both recent and fundamental developments of instrumentation that are revolutionizing the field of analytical chemistry, with an emphasis on applications in biological chemistry and biotechnology. Topics will include a survey of advanced analytical techniques, including specialized mass spectrometry techniques, x-ray photoelectron spectroscopy, Auger electron spectroscopy, Electron Microscopy, Surface Enhanced Raman spectroscopy, Localized surface plasmon resonance, total internal reflection fluorescence methods; chemometrics, and other state-of-the-art analytical methods. Course work will include independent review of peer-reviewed literature, scientific writing, and student oral presentations", "prerequisites": "CHM311H5"}, {"name": "CHM416H5 • Separations, Chromatography and Microfluidics", "description": "Separation science will be explored by building on a survey of fundamental physical principles to understand processes of extraction, and technologies such as solid phase microextraction, supercritical fluid extraction, immunoaffinity extraction and molecularly imprinted polymers. Plate and rate theory will be developed to consider various forms of gas and liquid chromatographic methods, including hyphenated techniques that bridge to information detectors such as mass spectrometers. New opportunities for chromatography and separations by movement to small scale size will be considered by focusing on microfluidics, electro-osmotic flow and chip based microdevice applications. Applications examples will focus on problems in life sciences, forensics and environmental chemistry. Course work will include independent literature reviews and student presentations.", "prerequisites": "CHM311H5"}, {"name": "CHM436H5 • Metal-based Chemistry for Synthesis of Small Molecules and Functional Materials", "description": "Modern metal-mediated (inorganic) reactions useful in organic synthesis. Applications of advanced organometallic chemistry. Selected solid-state compounds: metal-organic frameworks, nanoparticles and related materials for separation, catalysis, diagnostics.", "prerequisites": {"and": ["CHM231H5", "CHM243H5"], "or": []}}, {"name": "CHM442H5 • Strategy & Control in Modern Drug Synthesis", "description": "Applications of advanced fundamentals to, and recent developments in, multi-step organic synthesis.", "prerequisites": {"and": [], "or": ["CHM341H5", "CHM345H5"]}}, {"name": "CHM444H5 • An Introduction to Medicinal Chemistry and Molecular Recognition", "description": "An introduction to drug discovery, design and development. This course will focus on the potential of proteins (enzymes, receptors, receptor structure and signal transduction) as targets for molecular therapeutic intervention. The strategies of finding a drug target, optimizing target interactions and synthetic molecular therapeutic development will all be considered and discussed. The modern technologies of targeting protein-protein interactions will also be covered.", "prerequisites": "CHM361H5"}, {"name": "CHM462H5 • Revealing the Chemistry behind Biomolecules", "description": "Discussion course based on published research in biological chemistry and applications of chemistry to study processes of biological significance.", "prerequisites": "CHM361H5"}, {"name": "CHM485H5 • Dissertation Based on Literature Research", "description": "A dissertation will be written based on literature research of a topic of current interest in the field of chemistry. The research will be conducted under the supervision of a chemistry faculty member other than the student'sCPS489Y5supervisor. The research topic must not overlap that of the student'sCPS489Y5project. The goals of this course are to achieve literature research expertise as well as in-depth knowledge of a particular chemistry topic, while perfecting scientific writing and oral presentation skills. Evaluation is based on a final written report describing the aims and results of the research, as well as an oral presentation of the work. The course is normally taken in the student's fourth year, in either the Fall or Winter terms, but may be taken in the Summer term. Enrolment inCHM485H5requires submitting an application to the department before the end of the term prior to that in which it is intended to undertake the research. Independent Studies Application Forms may be found athttp://uoft.me/cpsforms. Applications should be submitted to the CPS Undergraduate Assistant. Registration on ACORN is also required. Students are encouraged to consult with, and obtain the consent of, prospective supervisors before applying for enrolment.", "prerequisites": "2.5 CHM/JCP credits at 300 level."}, {"name": "CHM489Y5 • Introduction to Research in Chemistry", "description": "An experimental or theoretical research topic in chemistry will be investigated under the supervision of a chemistry faculty member other than the student'sCHM485H5supervisor. The research topic must not overlap that of the student'sCHM485H5research topic. In addition to learning to plan, conduct and evaluate a research program, students will receive training in written and oral presentation skills. Evaluation is based on interim and final written reports describing the aims and results of the research, as well as interim and final oral presentations of the work. The course is normally taken in the student's fourth year. Enrolment inCHM489Y5requires submitting an application to the department in the spring term, with the application due date being the final day of classes. Independent Studies Application Forms may be found athttp://uoft.me/cpsforms. Applications should be submitted to the CPS Undergraduate Assistant. Registration on ACORN is also required. Acceptance into the course is dependent on the student having achieved a satisfactory GPA, and reaching agreement with a potential supervisor. Students must consult with prospective supervisors before applying for enrolment, and must list at least two faculty members as possible supervisors. This course is restricted to students in the Chemistry Major, Biological Chemistry Specialist, and Chemistry Specialist Programs.", "prerequisites": "2.0 300 level credits in CHM/JCP and 1.0 credit from BIO206H5 and BIO314H5 and CHM372H5 and CHM373H5 and CHM394H5 and CHM395H5 and CHM396H5 and CHM397H5 and PHY324H5, with 0.5 credits from the 300-level CHM laboratory courses listed."}, {"name": "CPS398H5 • Teaching Opportunity Program in Sciences", "description": "A scholarly, active learning project in which students integrate and apply their understanding of science and pedagogy by observing, actively participating in, and reflecting on the teaching and learning process under the supervision of an experienced instructor/mentor. This course may be taken in either the Summer, Fall or Winter terms. Enrolment requires submitting an application to the department before the end of the term prior to that in which it is intended to undertake the research. Independent Studies Application Forms may be found athttp://uoft.me/cpsforms. Students should plan for the course in March of the previous academic year and register as soon as their registration period begins. Students are encouraged to consult with, and obtain the consent of, prospective supervisors before applying for enrolment. Enrolment will depend on the availability of positions.", "prerequisites": "This course is \"by Instructor Approval\". At least 10.0 courses completed and enrolment in a life, mathematical, or physical science major or specialist program; an average of B-(CGPA 2.7) or higher."}, {"name": "CPS400Y5 • Chemical and Physical Sciences Internship", "description": "This internship opportunity will allow students to apply theoretical and practical skills acquired during their undergraduate education in order to gain vital industry experience. Students will be trained in effective job searching skills (writing a CV and a Cover Letter, participating in job interviews) and will gain valuable experiences that are sought after by employers in both public and private sectors. Students will be placed with various employers in the GTA based on their interest and skill set, and on the employer needs and availability. The placement is a 200 h unpaid internship. The Course Coordinator/Instructor(s) will schedule biweekly meetings to discuss the setup and progress of the student projects. Student attendance is mandatory. At the end of the term, students must submit a written report and prepare an oral presentation about the outcomes of their work experience. In order to be considered for the internship, students must apply for the course. The Course Coordinator will approve enrolment in the course based on the number of internship opportunities available, which will vary from year-to-year, and student qualifications (e.g. GPA, experience, qualifications related to the requirements of the available placement(s), and interview performance).", "prerequisites": "For Chemistry Internships (CHM372H5 or CHM394H5 or CHM396H5) and an additional 1.0 credit from any 300/400 level CHM/JCP/JBC/BCH/FSC courses.  \nFor Earth Science/Geology Internships: (ERS301H5 and ERS303H5) and an additional 1.0 credit from any 300/400 level courses.   \nFor Physics Internships: (PHY324H5 and PHY347H5) and an additional 1.0 credit from any 300 or 400 level PHY/JCP courses."}, {"name": "CPS401Y5 • Research and Development in Science Education", "description": "This course is intended for students in a CPS or Environmental Science Major or Specialist program. It provides an experiential learning opportunity with secondary school students and teachers. Students will research the literature of science pedagogy and acquire pedagogical content knowledge, particularly that of problem-based learning and the use of case studies. Then, through the creation of original, problem-based learning materials for Grades 11 and 12 classes and the preparation of teachers’ notes for these materials, they will enhance their subject specialization knowledge. They will then assist a teacher in implementing their materials in a school or, where the materials involve experiments, in the field or in the UTM teaching laboratories. The course is normally taken in the student's fourth year. Enrollment requires submitting an application to the CPS Department in the spring term, with the application due date being the final day of classes. Independent Studies Application Forms may be found athttp://uoft.me/cpsforms. Applications should be submitted to the CPS Undergraduate Assistant. Registration on ACORN is also required.", "prerequisites": "Enrolment in a CPS or Environmental Science Major or Specialist program with a minimum CGPA of 2.7 and 9.0 credits, including at least 2.0 credits at the 200-level in CHM or ERS or ENV or GGR or PHY"}, {"name": "CPS489Y5 • Introduction to Research in the Chemical and Physical Sciences", "description": "Students will work toward the completion of an experimental or theoretical research project in an area of study within the chemical and physical sciences, namely, astronomy, chemistry, earth sciences or physics. Projects will be based on current trends in research and students will work to complete their projects with guidance provided by a team of facilitators and faculty advisors consisting of course coordinators and a researcher from the Department of Chemical and Physical Sciences. In addition to the rigorous development of research skills, the course will also provide students with training and practical experience in project management techniques and practical research, literary and communications skills development.CPS489Y5requires submitting an application to the department Application forms may be found athttp://uoft.me/cpsforms. Applications should be submitted to the CPS Undergraduate Assistant.", "prerequisites": "(2.0 credits at the 300 level from BIO or CHM or JBC or JCP or ERS or ESS or PHY) and (1.0 credit from BIO206H5 or BIO314H5 or CHM372H5 or CHM373H5 or CHM394H5 or CHM395H5 or CHM396H5 or CHM397H5 or ERS201H5 or ERS202H5 or PHY324H5 or PHY347H5 or JCP321H5 or JCP322H5 or PHY325H5 or PHY332H5 or PHY333H5 or PHY343H5 or PHY351H5)"}, {"name": "FSC311H5 • Forensic Chemistry", "description": "This course focuses on the analysis of physical evidence based on the principles of analytical chemistry. Students will gain knowledge in the theory and operation of forensically relevant chemical and instrumental techniques used for the analysis of evidentiary items, including drug/alcohol analysis, gunshot residue, explosives, paint analysis, etc. Students will also develop skills relating to the interpretation, limitation, and implications of analytical results in a forensic context.  (Priority given first to Forensic Science Specialists and Majors; then Minors.)", "prerequisites": {"and": ["CHM211H5"], "or": [{"and": ["CHM110H5", "CHM120H5"], "or": []}, "CHM140Y5"]}}, {"name": "JBC472H5 • Seminars in Biotechnology", "description": "An introduction to current research in biochemistry and biotechnology, through seminars and literature reviews, presented by invited speakers and students. Subject areas include biotechnology, biomaterials, enzyme engineering, biosensors, drug delivery, spectrometry, separations chemistry, and bioinformatics.", "prerequisites": {"and": ["BIO372H5", "CHM361H5", {"and": [], "or": ["CHM362H5", "BIO315H5"]}], "or": []}}, {"name": "JCB487Y5 • Advanced Interdisciplinary Research Laboratory", "description": "Students will work together as members of a multidisciplinary team toward the completion of an interdisciplinary experimental or theoretical research project. Teams will be comprised of at least three students, with representation from at least three areas of specialization, namely, astronomy, biology, chemistry, earth sciences or physics. The interdisciplinary projects will be based on current trends in research and student teams will work to complete their projects with guidance provided by a team of faculty advisors from the Biology Department and the Department of Chemical and Physical Sciences. In addition to the rigorous development of research skills, the course will also provide students with training and practical experience in project management techniques and teamwork skills development.JCB487Y5requires submitting an application to the department before the end of June for Fall enrolment. Application forms may be found athttp://uoft.me/cpsforms. Application should be submitted to the CPS Undergraduate Assistant. Registration on ACORN is also required.", "prerequisites": "(2.0 credits at the 300 level from BIO or CHM or JBC or JCP or ERS or ESS(G) or PHY) and (1.0 credit from BIO206H5 or BIO314H5 or CHM372H5 or CHM373H5 or CHM394H5 or CHM395H5 or CHM396H5 or CHM397H5 or ERS201H5 or ERS202H5 or PHY324H5 or PHY347H5). Normally taken in 4th year. Students must obtain approval from the faculty member(s) who will serve as the supervisor(s) in advance of the start of the course."}, {"name": "JCP221H5 • Thermodynamics", "description": "An introduction to equilibrium thermodynamics with application to ideal and non-ideal systems: covering the concepts of work and heat, the laws of thermodynamics, internal energy, enthalpy and entropy, the chemical potential, states of matter, phase rules and phase diagrams, and chemical equilibria. Kinetics topics include rate laws, both differential and integrated, rate constants, activated complex theory, and temperature effects.", "prerequisites": "[(CHM110H5 and CHM120H5 with a minimum grade of 60% in CHM120H5) or (PHY136H5 and PHY137H5) or (PHY146H5 and PHY147H5 )] and [(MAT132H5 and MAT134H5) or (MAT135H5 and MAT136H5) or (MAT137H5 and MAT139H5) or (MAT157H5 and MAT159H5) or MAT134Y5 or MAT135Y5 or MAT137Y5 or MAT157Y5]"}, {"name": "JCP265H5 • Introduction to Scientific Computing", "description": "This course is an introduction to computing in the physical sciences. Students will gain experience utilizing numerical software tools used in both academic and industrial settings. A variety of numerical techniques will be covered, with topics to include: curve fitting, numerical approximations of derivatives and integrals, root finding, solutions of differential equations, Fourier series, Monte Carlo methods, and more. Students will also acquire skills in data analysis and visualization. No prior experience in computer programming is required.", "prerequisites": "[PHY146H5 or PHY136H5 (minimum grade of 80%)] and [PHY147H5 or PHY137H5 (minimum grade of 80%)] and [(MAT135H5 and MAT136H5) or (MAT137H5 and MAT139H5) or (MAT135Y5 or MAT137Y5)]"}, {"name": "JCP321H5 • Quantum Mechanics I: Foundations", "description": "A first course covering basic concepts of quantum mechanics. Topics include: de Broglie waves and wave-particle duality, the postulates of quantum mechanics, the Schrödinger equation, Dirac notation, the square potential well and potential barriers, the harmonic oscillator, the rigid rotor, atoms, molecules and solids.", "prerequisites": "(MAT212H5 or MAT223H5 or MAT232H5 or MAT242H5 or MAT244H5) and (PHY136H5 and PHY137H5) or (PHY146H5 and PHY147H5) and (JCP221H5 or PHY245H5) "}, {"name": "JCP322H5 • Statistical Mechanics", "description": "Statistical mechanics provides a framework for understanding macroscopic properties of many-body systems (such as solids, liquids, or gases) from the underlying dynamics of the constituent particles. Topics to be introduced include microstates, entropy, partition functions, free energy and various ensemble formalisms. These tools will be used to calculate thermodynamic and equilibrium properties of both classical and quantum mechanical systems from the ideal gas, to ferromagnetism, to Bose-Einstein condensation.", "prerequisites": "JCP321H5"}, {"name": "JCP410H5 • Modelling of Biochemical Systems", "description": "An introduction to mathematical modelling of complex biological systems, with a focus on biochemical kinetic models, their numerical simulation, and methods for analytically and computationally studying their behaviour. This is a one-term independent-study project course: students will be given a set of directed readings, then assisted in selecting an existing model from the literature. After reproducing existing results, students will be tasked with extending the model in a direction of their own choosing; this can include exploring different parameter regimes, incorporating new or different aspects of the underlying biology, or applying different analytical techniques. Students will work with the instructor to select a suitable project, matching their background and interests. Formal lectures will be replaced with a series of weekly meetings with the instructor to discuss progress and plans.", "prerequisites": {"and": [{"and": [], "or": ["JCP221H5", "PHY241H5"]}, "PHY245H5", {"and": [], "or": ["MAT212H5", "MAT223H5", "MAT232H5", "MAT242H5", "MAT244H5"]}], "or": []}}, {"name": "JCP421H5 • Quantum Mechanics II: Applications", "description": "The course offers an in-depth examination of the fundamental principles of quantum theory and a guide to its applications. Topics may vary but will include: time-independent Schrodinger equation, quantum dynamics in Heisenberg and Schrodinger pictures, time-independent perturbation theory, WKB approximation, variational method, spin, addition of angular momentum, time-dependent perturbation theory, scattering.", "prerequisites": {"and": ["JCP321H5", "PHY325H5"], "or": []}}, {"name": "JCP422H5 • NMR Spectroscopy", "description": "Fundamentals of NMR spectroscopy including classical and quantum descriptions, NMR parameters and relaxation times, product operators, multi-dimensional NMR, and solid-state techniques.", "prerequisites": {"and": [{"and": [], "or": ["JCP221H5", "PHY241H5"]}, "PHY245H5", {"and": [], "or": ["MAT212H5", "MAT223H5", "MAT232H5", "MAT242H5", "MAT244H5"]}], "or": []}}, {"name": "JCP463H5 • Techniques in Structural Biology", "description": "Biochemical and biophysical approaches to studies of protein interactions, structures, and dynamics. Theory and practice of specific experimental approaches will provide a fundamental understanding on information potential and technique limitations. Specific applications from the current literature will be discussed. Student evaluations will include oral presentations describing studies using the techniques.", "prerequisites": {"and": [], "or": ["CHM361H5", {"and": [], "or": ["PHY332H5", "PHY333H5"]}]}}]