[{"name": "CHI101H5 • Introductory Chinese  for Students with Prior Background", "description": "This course is designed for students who have some prior knowledge of Chinese. Potential students for this course are able to speak and understand elementary Mandarin or any Chinese dialects but with minimal literacy skills (reading and writing), or are able to read and write with either traditional or simplified character at beginner level. This course focuses on phonetics and literacy of Modern Standard Chinese (Mandarin) and addresses integrated skills of listening, speaking, reading, writing and translation.", "prerequisites": "NOTE: All students who are enrolling in a CHI language course for the first time (do not have the prerequisite) are required to complete a language assessment questionnaire. Students who have not completed an assessment cannot be approved for course enrolment. Please visit www.utm.utoronto.ca/language-studies/chineselanguage-course-questionnai…."}, {"name": "CHI103H5 • Introductory Chinese I", "description": "Intended for students with none or minimal background in Mandarin or any Chinese dialects, this course provides a comprehensive introduction to phonetics and written form of Modern Standard Chinese (Mandarin) and covers the topics of functional Chinese at beginner level. All students are REQUIRED to complete the Chinese Language Assessment Questionnaire before enrolling in this course. Please visithttps://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnairesand complete the Chinese Language Assessment Questionnaire by no later than August 29th. Late assessment submissions will not be accepted.", "prerequisites": "All students are REQUIRED to complete the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnaires) before enrolling in this course."}, {"name": "CHI104H5 • Introductory Chinese II", "description": "As the second half of Introductory Chinese, this course continues to expand students’ knowledge and develop their language skills of Mandarin. More topics of functional Chinese are covered in this course.Students who have not completed the listed prerequisite ofCHI103H5are REQUIRED to complete the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…).", "prerequisites": "CHI103H5 or as indicated by the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}, {"name": "CHI203H5 • Intermediate Low Chinese I", "description": "As a continuation of Introductory Chinese, this course aims at developing students' language comprehension, expanding their vocabulary and grammar, and improving their skills in listening, speaking, reading, writing and translation in Modern Standard Chinese (Mandarin) at intermediate level. The course content is focused on functional topics.Students who have not completed the listed prerequisite are REQUIRED to complete the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…) by August 29th. Late assessment submissions will not be accepted.", "prerequisites": "CHI104H5 or as indicated by the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}, {"name": "CHI204H5 • Intermediate Low Chinese II", "description": "As the second half of Intermediate Chinese, this course continues to develop students' language comprehension, expand their vocabulary and grammar, and improve their skills in listening, speaking, reading, writing and translation in Modern Standard Chinese (Mandarin) at the intermediate level. The course content is focused on functional topics. Students who have not completed the listed prerequisite for this course are REQUIRED tocomplete the Chinese Language Assessment Questionnaire before enrolling in this course. Please visithttps://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnairesand complete the assessment questionnaire by no later than August 29th. Late assessment submissions will not be accepted.", "prerequisites": "CHI203H5 or as indicated by the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}, {"name": "CHI211H5 • Chinese for Academic Purposes I", "description": "This course, designed for native or near-native speakers of Mandarin Chinese, develops rhetorical knowledge and critical thinking skills for effective academic reading and writing. Students will also receive training in conducting effective formal presentations with supporting media and public speaking skills.", "prerequisites": "Appropriate language level as indicated in the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnaires) or interview."}, {"name": "CHI212H5 • Chinese for Academic Purposes II", "description": "This course, designed for native or near-native speakers of Mandarin Chinese, continues the study of rhetorical knowledge and critical thinking skills for effective academic reading and writing. It also prepares students for upper level courses which demand in-depth reading, writing, as well as professional presentation skills.", "prerequisites": "CHI211H5 or appropriate language level as indicated by the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnaires) or interview."}, {"name": "CHI303H5 • Intermediate High Chinese I", "description": "This course, designed for second-language learners of Mandarin Chinese, aims to: 1) develop listening and speaking skills in handling daily routines and social situations related to personal lives; 2) improve reading and writing skills in narration and description on everyday topics; and 3) cultivate cultural knowledge that facilitates effective intercultural communication.Students who have not completed the listed prerequisite are REQUIRED to complete the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…) by August 29th. Late assessment submissions will not be accepted.", "prerequisites": "CHI204H5 or as indicated by the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}, {"name": "CHI304H5 • Intermediate High Chinese II", "description": "This course, designed for second-language learners of Mandarin Chinese, is the second half of Intermediate High Chinese. It continues to: 1) develop listening and speaking skills in handling daily routines and social situations related to personal lives; 2) improve reading and writing skills in narration and description on everyday topics; and 3) cultivate cultural knowledge that facilitates effective intercultural communication.Students who have not completed the listed prerequisite are REQUIRED to complete the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…) by August 29th. Late assessment submissions will not be accepted.", "prerequisites": "CHI303H5 or as indicated by the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}, {"name": "CHI308H5 • Chinese Cultural Studies Seminar", "description": "This seminar course provides a platform for critical discussion of what we call \"Chinese culture\". Students will consider ideas of invented traditions, the essentialization of culture, and questions about modern states and regions. Topics may include Chinese civilization, customs, rituals, religion, philosophy, ideology, morals, literature, folk art and craft, performance arts, martial arts, cuisine, medicine, etc. The discussions will draw from historical and contemporary topics.", "prerequisites": {"and": ["CHI211H5", "CHI212H5"], "or": []}}, {"name": "CHI310H5 • Chinese for Career Development", "description": "This course is designed for near-native or native speakers of Mandarin Chinese who are interested in advancing their careers in Chinese-speaking regions and in North America. Students will develop knowledge in career planning from cross-cultural perspectives, from job search, to applications and interview processes in Chinese-speaking regions of Asia and in North America. They will build a solid foundation for reading, writing, and speaking Chinese in a business setting.", "prerequisites": "CHI211H5"}, {"name": "CHI311H5 • Classical Chinese Literature", "description": "This course will examine representative genres of traditional Chinese literature—poetry, prose, fiction, and drama—with an emphasis on language structure, style,and the influence on modern Chinese society and culture. We will also analyze the aesthetic features of classics and discuss the influences of traditional Chinese society on literaturein terms of religion, philosophy, the imperial system,gender, family, and ethnicity.", "prerequisites": {"and": ["CHI211H5", "CHI212H5"], "or": []}}, {"name": "CHI312H5 • Chinese Diaspora Literature and Culture", "description": "This course examines literary and cinematic works as well as visual art by authors of the Chinese diaspora. The course covers topics such as multiculturalism, racism, cultural preservation, invented traditions, and agency through the lens of overseas Chinese writers and creators.", "prerequisites": {"and": ["CHI211H5", "CHI212H5"], "or": []}}, {"name": "CHI313H5 • The Wisdom of Life in Traditional Chinese Culture", "description": "This course explores different thought systems, ideas and the wisdom of human life rooted in traditional Chinese culture from the following two approaches: a theoretical discussion of the purpose, meaning, and value of human life, ideals and ways of life, existential questions and multiple solutions; and a historical as well as critical examination of the conventional wisdom originated by Chinese cultural figures like Laozi, Confucius, Mencius, Sima Qian, Zhu Xi, Qian Mu, Qian Zhongshu and more. The goal of the course is to facilitate student consideration of the essence of human life and the understanding of contemporary Chinese views by ascertaining traditional Chinese erudition. Through the examination of traditional Chinese scholarship, students will develop an understanding of the connection between such teachings and contemporary Chinese views.", "prerequisites": {"and": ["CHI211H5", "CHI212H5"], "or": []}}, {"name": "CHI314H5 • Chinese Culture through Media", "description": "This course examines Chinese cultural traditions and values through contemporary media produced in China, Taiwan and Hong Kong. Background readings and literary works will provide students with the necessary historical and cultural context for each work. Class discussions will focus on the political, social and cultural transformations presented in the media. Special attention will be paid to topics such as family, class issues, gender and identity.", "prerequisites": {"and": ["CHI211H5", "CHI212H5"], "or": []}}, {"name": "CHI403H5 • Advanced Chinese I", "description": "This course, designed for second-language learners of Mandarin Chinese, aims to: 1) develop listening and speaking skills in handling most informal and some formal communicative tasks; 2) strengthen reading and writing skills in expository and persuasive essays on familiar cultural and social topics; 3) cultivate cultural knowledge that facilitates effective intercultural communication.Students who have not completed the listed prerequisite are REQUIRED to complete the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…) by August 29th. Late assessment submissions will not be accepted.", "prerequisites": "CHI304H5 or as indicated by the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}, {"name": "CHI404H5 • Advanced Chinese II", "description": "This course, designed for second-language learners of Mandarin Chinese, is the second half of Advanced Chinese. It continues to: 1) develop listening and speaking skills in handling most informal and some formal communicative tasks; 2) strengthen reading and writing skills in expository and persuasive essays on familiar cultural and social topics; and 3) cultivate cultural knowledge that facilitates effective intercultural communication.Students who have not completed the listed prerequisite are REQUIRED to complete the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…) by August 29th. Late assessment submissions will not be accepted.", "prerequisites": "CHI403H5 or as indicated by the Chinese Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}, {"name": "CHI408H5 • Reading Confucianism  in Modern Chinese", "description": "This advanced level course covers seminal readings on Confucianism written in modern Chinese language. The course examines Confucian doctrines and the development of Confucianism from ancient time to the contemporary era. Critical reading and essay writing skills will be emphasized.", "prerequisites": {"and": ["CHI211H5", "CHI212H5"], "or": []}}, {"name": "CHI409H5 • Influence of Confucianism on Chinese Culture", "description": "This advanced level course discusses the cultural influence of Confucianism on Chinese writing, philosophy, religion, education, literature, customs, ethics, society and so forth. The readings covered in this course are mainly in modern Chinese language. Critical reading and essay writing skills will be stressed.", "prerequisites": {"and": ["CHI211H5", "CHI212H5"], "or": []}}, {"name": "CHI410H5 • Modern Chinese Literature Studies", "description": "This seminar course offers a critical examination of modern Chinese literature. modern Chinese literature. The primary focus will be on representative works of poetry, prose, drama, and fiction. Discussions will emphasize historical, cultural, and social-political contexts. Emphasis will be placed on building writing skills in literary criticism and analyzing literary devices and themes.", "prerequisites": {"and": ["CHI211H5", "CHI212H5"], "or": []}}, {"name": "CHI411H5 • Theory and Practice in English/Chinese Translation", "description": "This course is an introduction to the major theories, methods and techniques involved in translating from English into Chinese. The course focuses on practical training for novice translators. Through practice, students will familiarize themselves with the translation process and develop a variety of translation skills and strategies. Students will discuss and reflect upon issues encountered during translation and develop decision-making ability to deal with translation challenges. This course provides a solid foundation for students to continue their studies in translation at the advanced level.", "prerequisites": "CHI211H5"}]