[{"name": "CIN102H5 • Modernity and the Moving Image", "description": "Looking at a few periods of intense technological change—for example, with the invention of photography, and the introduction of sound, of colour, of television—we will consider the ways in which artists, filmmakers, studios, and media conglomerates have responded to such changes and to accompanying ideas about the role that moving technology plays in our conception of history and the future.", "prerequisites": "CIN101H5"}, {"name": "CIN203H5 • The Films of Alfred Hitchcock", "description": "The establishment of film as a serious art form is coincident with the earliest critical writing on Alfred Hitchcock that emerged in the 1950s. Since then, Hitchcock has remained one of the most important filmmakers of all time, spawning not only a massive body of critical scholarship but also legions of imitators. This course will serve as an introduction to both the films (such as Psycho and North by Northwest) and related issues: questions of suspense, authorship, morality, and spectatorship.", "prerequisites": "CIN101H5"}, {"name": "CIN204H5 • The Films of Martin Scorsese", "description": "This course will examine the films of Martin Scorsese, one of the most influential figures in the history of cinema. Scorsese's films will be understood in relation to questions about imitation and originality, genre, violence, male hysteria, and also as meditations on the history of film itself.", "prerequisites": "CIN101H5"}, {"name": "CIN205H5 • Canadian Auteurs", "description": "This course will offer a comparative study of a selection of major contemporary Canadian filmmakers, including Denys Arcand, Atom Egoyan, David Cronenberg, Sara Polley, Denis Villeneuve, Ruba Nadda, Denis Côté, Guy Maddin, Michael Snow, and Joyce Wieland.", "prerequisites": "CIN101H5"}, {"name": "CIN206H5 • Auteurs", "description": "This course will look closely at the work of a single director. Emphasis will be given to the aesthetic, historical, cultural, and philosophical contexts that inform the director's work. We will also tend closely to the style and central preoccupations of the director under examination.", "prerequisites": "CIN101H5"}, {"name": "CIN207H5 • East Asian Cinema", "description": "This course is an introduction to East Asian cinema from the 1960s to the present, including films from Hong Kong, Taiwan, China, Japan, and Korea. With an emphasis on formal aesthetic analysis of short and feature-length films, we will examine film waves, genres, film festivals, and interconnected film industries. Throughout the course, we will consider not only the production, exhibition, and reception spaces of East Asian cinema but also critically examine its definitions and borders.", "prerequisites": "CIN101H5"}, {"name": "CIN208H5 • The Films of Abbas Kiarostami: Being and Movement", "description": "This course will survey the work of the Iranian filmmaker, Abbas Kiarostami, and will do so with an especial interest in the way that Kiarostami’s films raise important questions about tradition, judgment, and the fluidity of self and world.", "prerequisites": "CIN101H5"}, {"name": "CIN210H5 • Contemporary Southeast Asian Cinemas", "description": "This course is an introduction to contemporary Southeast Asian cinemas from the 2000s to the present. Since the turn of the millennium, the cinematic innovation of Southeast Asia has been aided by an increase in productive interaction and transnational modes of collaborations and co-productions. These waves of cinema augur new possibilities for considering cross-cultural, cross-boundary ways of being, seeing and knowing that can challenge formulaic and essentialist understandings of the region. Through formal aesthetic analysis of short and feature-length films, and the study of Asia-based and international institutions of cinema, we will examine the multifarious potential of contemporary Southeast Asian in spurring the rethinking of the histories, concepts, and borders of the region.", "prerequisites": "CIN101H5"}, {"name": "CIN215H5 • Bollywood in Context", "description": "India has arguably the most popular and prolific film industry in the world. This course contextualizes the relatively recent 'Bollywood' phenomenon within the history of Indian commercial cinema and key aspects of modern Indian culture, emphasizing the popular cinema's role in constructing historically changing ideas of national and gendered identity. It also challenges the assumptions of film theories developed in relation to Hollywood or European cinema by introducing film theory concepts that address South Asian image-cultures (such as darshan, frontality, melodrama, and interruption).", "prerequisites": "CIN101H5"}, {"name": "CIN250H5 • Introduction to the Fundamentals of Cinematic Language", "description": "This hands-on studio-based course will examine fundamentals of cinematic language and production. Students will work individually and in teams to create a series of works that focus on aesthetics and skill development. 24L, 12T, 24P", "prerequisites": "CIN101H5"}, {"name": "CIN290H5 • Topics in Cinema Studies", "description": "The course may have a historical, genre, theoretical, auteur, or other focus. See the Department of Visual Studies website atwww.utm.utoronto.ca/dvsfor the current topic.", "prerequisites": "CIN101H5"}, {"name": "CIN301H5 • Topics in Cinema Studies", "description": "The course may have a historical, genre, theoretical, auteur, or other focus. Students should contact the program director for the current topic.", "prerequisites": "CIN101H5"}, {"name": "CIN302H5 • Topics in Cinema Studies", "description": "The course may have a historical, genre, theoretical, auteur, or other focus. Students should contact the program director for the current topic.", "prerequisites": "CIN101H5"}, {"name": "CIN303H5 • Global Auteurs", "description": "This course is devoted to three major international filmmakers: Michael Haneke (Austria), Olivier Assayas (France), and Hou Hsiao-Hsien (Taiwan). While different in many important respects, these filmmakers are nevertheless linked by their tendency to make international films that are themselves meditations on national identity in an increasingly globalized world. Screenings will include Caché, Code Unknown, Carlos, Demonlover, The Flight of the Red Balloon, and Goodbye South, Goodbye, to name just a few.", "prerequisites": "CIN101H5"}, {"name": "CIN304H5 • The Violent Image", "description": "It is commonly believed that violent images produce violent, or desensitized people. In this class, we will examine the multiple forms of violence in film, television, and videogames as well as the variety of discourses about violence and images. Rather than confirming the moral logic of condemnation of the violent image, we will ask instead what good a violent image might do.", "prerequisites": "CIN101H5"}, {"name": "CIN305H5 • Taiwan New Wave in Our Time", "description": "The film In Our Time (1982), which combined short works by four directors (Edward Yang, Jim Tao, Ke Yizheng, and Zhang Yi), is regarded as the beginning of Taiwan New Cinema, generally considered to have ended in the late 1980s. Figures such as Hou Hsiao Hsien, Wang Tung, Chu Tien-wen, Wu Nien-Jen, Hung Hung, Hsiao Yeh, Tsai Chin, and Sylvia Chang played key roles, as directors, screenwriters, producers, and/or actors. From examining films within the era to their impact on contemporary global cinema, this course asks: how may a film be transnationally and transgenerationally re-animated for shifting eras and constellations of viewers? This course speculates that the time of the Taiwan New Wave is still beckoning, even from beyond the contested shores of Taiwan.", "prerequisites": "CIN101H5"}, {"name": "CIN306H5 • The Comedic Image", "description": "Comedies routinely depend on the performance of the unthinkable in the ordinary. Our laughter follows from the saying or doing of the unsayable and the undoable. Comedy is in this way both a form of bad manners and also a uniquely philosophical genre, insofar as saying the unsayable means that we are able to recognize more than what we see or typically say. This course will survey the history of comedy and its relation to thought, perception, and social values.", "prerequisites": "CIN101H5"}, {"name": "CIN307H5 • Movement", "description": "Since the advent of cinema, filmmakers and film theorists have repeatedly attempted to define film as a unique art form on the basis of its most defining characteristic: movement. Painters can represent movement, but film is movement itself. Not surprisingly, many filmmakers who are recognized as significant artists are most easily identified by the distinctive style of their camera movement. This class will be devoted to a consideration of the nature, meaning, and styles of movement in film.", "prerequisites": "CIN101H5"}, {"name": "CIN308H5 • East and Southeast Asian Cinemas of Migration", "description": "Migration, voluntary and involuntary, has intensified in an unprecedented manner in recent history. More than ever, it is critical to examine forms of proximity, hospitality, and regionality. Including films by migrants, films about the migrant experience, and the migratory routes of cinema itself, this course addresses the ethics, politics, and praxis of mobility and displacement. How, through East and Southeast Asian cinemas, could we envision counter-bodies and counter-strategies with which we may collectively imagine and inhabit the world?", "prerequisites": "CIN101H5"}, {"name": "CIN309H5 • Colour and the Moving image", "description": "Considering philosophical, scientific, and historical discourses about colour, this course explores a variety of ways of analyzing colour style in film and video art. As we begin to come to terms with the perceptual instability of colour as a positive phenomenon, we will consider how and why dominant histories of film style have been written, especially as the taming of colour has been central to an ongoing categorical distinction between narrative cinema and the avant-garde, morality and hedonism.", "prerequisites": "CIN101H5"}, {"name": "CIN310H5 • Melodrama", "description": "Film and Televisual melodramas regularly enact a conflict between personal desire and social expectation. This course will cover a range of films and television melodramas and consider the social contexts in which these works emerge, and often as critiques of the very cultures to which they belong or reject. 24L, 36P", "prerequisites": "CIN101H5"}, {"name": "CIN315H5 • From Script to Screen", "description": "This is a screenwriting course where students will be introduced to key narrative tools, scriptwriting conventions and components so they can develop an understanding and appreciation of the process from script to screen. From a comparative analysis of screenplays and completed short and feature films with varying budgets in the global cinema landscape, students will learn to use freely available specialized software to craft their own short film materials, including logline, synopsis, treatment, and screenplay.", "prerequisites": "CIN101H5"}, {"name": "CIN317H5 • Production: Independent Cinema", "description": "What can the title cards and credits of a film tell us about its journey to the screen?Outside of the studio system model adopted in various countries, there are established pathways and structures for the development, financing, production, sales, distribution and exhibition of independent cinema. This class asks how, from idea to completion, an independent film is able to find funding and reach an international audience. Focusing on the transnational ecosystems that sustain the passage of independent cinema around the world, we will examine case studies of films from Asia, Europe and North America.", "prerequisites": "CIN101H5"}, {"name": "CIN399Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third year or beyond to work on the research project of a professor in Cinema Studies in return for 399Y course credit. Students enrolled have an opportunity to become involved in original research, enhance their research skills, and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter session on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "CIN101H5"}, {"name": "CIN400H5 • Topics in Cinema Studies", "description": "The course may have a historical, genre, theoretical, auteur, or other focus. Students should contact the Department for the current topic.  Topic-specific pre-requisites, co-requisites, and exclusions may apply to this course, depending on the topic. Please see the UTM Timetable prior to course registration.", "prerequisites": "CIN101H5 or at least 2.0 credits in courses that count towards Cinema Studies programs."}, {"name": "CIN401H5 • Topics in Cinema Studies", "description": "The course may have a historical, genre, theoretical, auteur, or other focus. Students should contact the Department for the current topic.", "prerequisites": "CIN101H5 or at least 2.0 credits in courses that count towards Cinema Studies programs."}, {"name": "CIN402H5 • Avant-Garde Film and Video", "description": "This course will look at alternative forms of filmmaking and television production. If there is a defining feature of avant-garde film and video, it is a general resistance to the thematic and stylistic norms of mainstream production and popular culture as way of seeing for all. Thus, in this course, we will be looking at both highly personal and sometimes autobiographical works of art.", "prerequisites": "(CIN101H5 or CIN202H5) and 1.0 credits at the 300 level in CIN or permission of instructor"}, {"name": "CIN403H5 • Queerscapes, Screenscapes, Escapes: Gender and Sexuality Across East and Southeast Asian Cinemas", "description": "\"Queerness is not yet here.\" José Esteban Muñoz begins Cruising Utopia with the provocation that queerness is a mode of desire that allows for an escape from the conditions of the present. How does queer studies contribute to the building of and the continued hope for a more just world? Through cinema, theory, and philosophy, this course makes the claim that investigating queerness in the world marks a critical move away from restrictive modes of identification and holds open life's horizons of possibility. Course texts emphasize queer cinemas of Asia and their transnational connections.", "prerequisites": "CIN101H5 or at least 2.0 credits in courses that count towards Cinema Studies programs."}, {"name": "CIN404H5 • Film Noir and the Problem of Style", "description": "By way of an introduction to some of the key instances of film noir, this course is concerned with what we will call the paradox of style; namely, that style can indicate both what is specific and also what is general, what is unique and what is repeatable. We will look at the way in which this paradox is amplified by issues of gender, genre, fashion, and power that seem to concern so many films in this tradition.", "prerequisites": "CIN101H5 or at least 2.0 credits in courses that count towards Cinema Studies programs."}, {"name": "CIN405H5 • Cinema and Emotion", "description": "This interdisciplinary course looks at such difficult emotions as shame, jealousy, forgiveness, and love, and how film complicates our understanding of them.", "prerequisites": "CIN101H5 or at least 2.0 credits in courses that count towards Cinema Studies programs."}, {"name": "CIN408H5 • Potential Cinema: Theories, Visions, and Practices of Decoloniality from East and Southeast Asia", "description": "Inspired by Ariella Aïsha Azoulay'sPotential History: Unlearning Imperialism, this course investigates films from East and Southeast Asia and considers the ways in which we might recognize theories, visions, and practices that might constitute \"cinemas of decoloniality.\" In this course, we will look to filmmakers' aesthetic engagement with archival and imagined time and the collision of pasts, presents, and futures in order to consider how contentious histories of memory and forgetting can have effects on the politics of the present. How, through and with cinema, could there be space not only to retell and reframe histories of coloniality and decolonization but also to experience and practice the potential decolonization of ways of being, seeing, and thinking?", "prerequisites": "CIN101H5 or a minimum 2.0 credits in courses that count towards Cinema Studies programs."}, {"name": "CIN410H5 • Creating Mobile Cinemas", "description": "This class will introduce students to low-budget aesthetic approaches to cinema across fiction and documentary genres. The class will involve a hybrid of cinema research and creation. During the first half of the semester, we will study a selection of feature-length works and shorts. The second half of the semester will be dedicated towards students creating 10-15 minute pieces of their own inspired by what they have studied.", "prerequisites": "CIN101H5 and 1.0 at the 300/400-level in CIN"}, {"name": "CIN430H5 • Making a Short Film", "description": "This is a production course that introduces students to the four stages of filmmaking: development, production, post production, and release. Through learning the practical aspects of filmmaking such as scriptwriting, budgeting, key crew positions, basic technical proficiency of equipment, and understanding the film festival circuit and online platform, students will make a 5-10 minute fiction short film. Equipment and funds will not be provided but students will be able to complete the assignments on a smartphone with recommendation of free video editing software.", "prerequisites": "CIN101H5 and 1.0 credit at the 300/400-level in CIN"}, {"name": "VST410H5 • Internship in Visual Studies", "description": "This internship course provides an opportunity for students to gain practical experience at an institution or business closely related to the arts and to visual studies. This is especially tailored for mature and self-disciplined students in their final year of study, who are ready to apply knowledge acquired in previous courses and are planning a career in the arts and cultural sector. Students registered in any DVS program are eligible to apply. Students work closely with the DVS internship coordinator to establish suitability. Regular updates and a final report and presentation will be required. The final grade for the course will be based on these, along with the assessment of the employer.", "prerequisites": "Minimum completion of 5.5 credits in DVS Programs and 8.0 additional credits and minimum CGPA 2.5 and and permission of internship coordinator."}, {"name": "VST410Y5 • Internship in Visual Studies", "description": "This internship course provides an opportunity for students to gain practical experience at an institution or business closely related to the arts and to visual studies. This is especially tailored for mature and self-disciplined students in their final year of study, who are ready to apply knowledge acquired in previous courses and are planning a career in the arts and cultural sector. Students registered in any DVS program are eligible to apply. Students work closely with the DVS internship coordinator to establish suitability. Regular updates and a final report and presentation will be required. The final grade for the course will be based on these, along with the assessment of the employer.", "prerequisites": "Minimum of 5.5 credits in DVS program courses and 8.0 additional credits and minimum CGPA 2.5 and permission of internship coordinator"}]