[{"name": "CPS489Y5 • Introduction to Research in the Chemical and Physical Sciences", "description": "Students will work toward the completion of an experimental or theoretical research project in an area of study within the chemical and physical sciences, namely, astronomy, chemistry, earth sciences or physics. Projects will be based on current trends in research and students will work to complete their projects with guidance provided by a team of facilitators and faculty advisors consisting of course coordinators and a researcher from the Department of Chemical and Physical Sciences. In addition to the rigorous development of research skills, the course will also provide students with training and practical experience in project management techniques and practical research, literary and communications skills development.CPS489Y5requires submitting an application to the department Application forms may be found athttp://uoft.me/cpsforms. Applications should be submitted to the CPS Undergraduate Assistant.", "prerequisites": "(2.0 credits at the 300 level from BIO or CHM or JBC or JCP or ERS or ESS or PHY) and (1.0 credit from BIO206H5 or BIO314H5 or CHM372H5 or CHM373H5 or CHM394H5 or CHM395H5 or CHM396H5 or CHM397H5 or ERS201H5 or ERS202H5 or PHY324H5 or PHY347H5 or JCP321H5 or JCP322H5 or PHY325H5 or PHY332H5 or PHY333H5 or PHY343H5 or PHY351H5)"}, {"name": "ERS101H5 • Planet Earth", "description": "We discuss the age and origin of the Earth, the nature of its deep interior, the origin of mountains, oceans, earthquakes and volcanoes, and show how these features are related in a unifying theory known as Plate Tectonics, that explains how the evolution of the Earth's surface is driven by internal processes. Practicals will include laboratory exercises devoted to the understanding and recognition of minerals, rocks and geological structures.", "prerequisites": "(2.0 credits at the 300 level from BIO or CHM or JBC or JCP or ERS or ESS or PHY) and (1.0 credit from BIO206H5 or BIO314H5 or CHM372H5 or CHM373H5 or CHM394H5 or CHM395H5 or CHM396H5 or CHM397H5 or ERS201H5 or ERS202H5 or PHY324H5 or PHY347H5 or JCP321H5 or JCP322H5 or PHY325H5 or PHY332H5 or PHY333H5 or PHY343H5 or PHY351H5)"}, {"name": "ERS111H5 • Earth, Climate & Life", "description": "Life as we know it is completely dependent on our planet. The Earth is an integrated system, where the ocean, atmosphere, life and planet interact with and affect one another. The evolution of the smallest organisms has drastically changed Earth’s climate, and small changes in Earth’s climate have a profound effect on the distribution of life. Understanding how organisms feed, breath, grow, and reproduce are integral to mitigating large-scale climate changes and organic cycles, and how this will affect the Earth as a system. Processes such as plate tectonics produces an ever changing surface, and has been a major control on how and when life evolved and flourished. After introducing how the Earth works, topics discussed will include how life on Earth has evolved, how large-scale geological processes affect climate and life and how ecosystems have changed in response to weather and climate change. We will also discuss the effect that our species has had on this planet; from the sudden shifts in stability of Earth’s systems, to feedback cycles, to use of resources and sustainability.", "prerequisites": "(2.0 credits at the 300 level from BIO or CHM or JBC or JCP or ERS or ESS or PHY) and (1.0 credit from BIO206H5 or BIO314H5 or CHM372H5 or CHM373H5 or CHM394H5 or CHM395H5 or CHM396H5 or CHM397H5 or ERS201H5 or ERS202H5 or PHY324H5 or PHY347H5 or JCP321H5 or JCP322H5 or PHY325H5 or PHY332H5 or PHY333H5 or PHY343H5 or PHY351H5)"}, {"name": "ERS201H5 • Earth Materials", "description": "To truly understand the Earth, and the rocks that form it, we must study their basic building blocks – minerals. Minerals are all around us; in rocks and sediments, in soils, in our bones and teeth, and in building materials. This course will examine the complex nature of minerals and crystals from a geological, physical and chemical perspective and will introduce the petrology of volcanic rocks, intrusive plutonic rocks, metamorphic rocks formed in the depths of mountain ranges and sedimentary rocks deposited through time. The course will train students in the use of optical mineralogy (rock slices under a microscope); a key analytical method in petrology and by doing so aims to provide students with detailed knowledge and skills inherent to all geologists, and to give a unique perspective of the Earth from the study of the small scale minerals and rocks.", "prerequisites": {"and": [], "or": ["ERS101H5", "ERS111H5", "ERS103H5", "ERS120H5", "ENV100Y5"]}}, {"name": "ERS202H5 • Dynamic Earth", "description": "An introduction to geological time and the dynamic evolution of the surface of the Earth. Lectures discuss the processes involved in the deformation of Earth's crust including mechanical principals, stress, and strain. Particular focus on the structure of rocks. Practical exercises focus on the geometry of rock units and determining the geological history of an area from information presented in geological maps, cross sections, and stereographic projections.", "prerequisites": "ERS201H5 or permission of instructor"}, {"name": "ERS203H5 • Magmatic Systems and Igneous Petrology", "description": "Deep beneath volcanoes lie magmatic systems where magma is formed and evolves. These systems are directly related to plate tectonics and the structure and chemistry of the Earth. This course will study these systems – how they are formed, and why they evolve, as well as what they lead to; volcanic eruptions. This course will use rock specimens, thin sections and geochemistry to study igneous rocks and processes, and will link these processes to the wider tectonic controls on magmatic systems, as well as to metamorphic rocks that are often seen in conjunction with magmatic systems.", "prerequisites": "ERS201H5"}, {"name": "ERS211H5 • Sedimentology and Stratigraphy", "description": "Sedimentology and stratigraphy concerns the origin, formation, accumulation, alteration, and preservation of sediments in the geological record. This course will focus on the reconstruction, correlation, and interpretation of ancient carbonate and siliciclastic paleoenvironments and facies based on the analysis of sedimentary structures, depositional environments, stratigraphic successions, and fossils. The interplay between biological and geological factors responsible for sedimentary deposits will form the core of the course, including the physical transport and biological accumulation of sediments, the effects of climate-driven sea-level change on sediment deposition, the importance of resource management and sustainability. This course will include a laboratory component with hand samples, thin sections, and physical models, in addition to a field trip, allowing for first-hand experience with describing and interpreting sedimentological units.", "prerequisites": {"and": [], "or": ["ERS101H5", "ERS120H5", "ERS111H5", "ERS103H5", "ENV100H5"]}}, {"name": "ERS225H5 • Field Methods", "description": "Fieldwork is at the heart of being a geologist. Skills gained during fieldwork are key as part of a Geologist’s toolbox, and are highly regarded in a career. This course introduces fieldwork to students during a week-long fieldtrip in late August looking at outcrops of igneous, metamorphic and sedimentary rocks around Ontario. Skills taught will include basic geological observation, description and interpretation, the collection of field notes, geological measurements and presentation of the data. Enrolment approval into the course is by application only; Registration in ACORN is required; priority will be given to Earth Science Specialists, or Environmental Geoscience Specialists. Please see the UTM CPS Earth Science Fieldtrip page for more information.", "prerequisites": {"and": [], "or": ["ERS101H5", "ERS120H5", "ERS111H5", "ERS103H5", "ENV100H5"]}}, {"name": "ERS299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "ERS101H5 or ERS120H5 or ERS111H5 or ERS103H5 or ENV100H5"}, {"name": "ERS301H5 • Geochemistry", "description": "Since the creation of the Solar System and Earth 4.5 billion years ago, Earth’s natural processes have differentiated the chemical elements, generating distinct differences in composition between the oceans and the atmosphere, and Earth’s crust, mantle and core. These differences allow Earth Scientists to understand and quantify these processes, as well as track the rocks and deposits formed out of these processes. This course will focus on the application of geochemistry to understand Earth processes, such as the generation of magma and volcanic eruptions, the formation of ore bodies and Earth surface processes. We will utilize the state-of-the-art equipment available at UTM, including Scanning Electron Microscopy and ICP-OES, to analyze rock samples to determine their origin based on their chemistry, giving students valuable skills in sample preparation and experimental practices.", "prerequisites": "1.5 credits from (ERS201H5 or ERS202H5 or ERS203H5 or ERS211H5 or ERS225H5) or permission of instructor."}, {"name": "ERS302H5 • Tectonics", "description": "This course will focus on how the plate tectonic system works, from the composition and structure of the earth, to the evolution of plate tectonics through Earth history, to modern tectonic hazards including earthquakes and volcanoes. A major portion of the course will focus on the analysis and interpretation of major structural provinces as they relate to Earth's plate boundary interactions including convergent, divergent, and transform settings.", "prerequisites": "ERS202H5 and 1.0 credits from (ERS201H5 or ERS203H5 or ERS211H5 or ERS225H5)"}, {"name": "ERS303H5 • Geophysics", "description": "This course will focus on important geophysical concepts and methods that are used to understand the interior of the Earth and the theory of Plate Tectonics. Major topics include gravity, isostasy, magnetism, heat flow, and seismology. Students will learn to apply basic geophysical equations to address real-life geoscience problems. They will also be introduced to common applied-geophysical techniques used for subsurface sensing, with applications to resource exploration and engineering and environmental studies.", "prerequisites": {"and": ["ERS202H5", {"and": [], "or": ["MAT132H5", "MAT135H5", "MAT137H5", "MAT137Y5", "PHY136H5", "PHY146H5"]}], "or": []}}, {"name": "ERS304H5 • Geological Remote Sensing", "description": "This course is an introduction to remote sensing technologies and geological applications. Students will learn about imaging of the Earth by electromagnetic waves and the state-of-the-art remote sensing systems and technologies for geological mapping and exploration. Topics may include remote sensing fundamentals and physical principles, remote sensing systems for geological applications, geological mapping and resource exploration. Students will also acquire skills in image processing, data integration, information extraction, and validation for geological applications.", "prerequisites": "1.5 credits of ENV or ERS or GGR at the 200-level or higher"}, {"name": "ERS311H5 • Sedimentology and Basin Analysis", "description": "This course will focus on principles of correlation, facies concepts, dynamic processes, and their geologic records in modern and ancient sedimentary environments, with focus on basins. Factors that influence sedimentary formation and evolution will be investigated, including sea level and sediment supply. Emphasis will be placed on sequence stratigraphic approaches to the evaluation of sedimentary systems. Sustainable management of oil, water, and gas resources within sedimentary basins will be covered.", "prerequisites": "ERS211H5 and 1.0 credits from (ERS201H5 or ERS202H5 or ERS203H5 or ERS225H5)"}, {"name": "ERS312H5 • Oceanography", "description": "The world’s oceans cover approximately 70% of the Earth Surface and Canada has extensive coastlines along three major ocean basins. This course will provide a broad understanding of chemical, biological, physical and geologic aspects of the oceans. In addition, this course will offer an insight into the paleoceanographic evolution of our planet and present-day environmental threats such as pollution, habitat destruction, acidification and ocean warming. Even though this course does not include specific lab or tutorial sessions, relevant exercises will be included.", "prerequisites": "Completion of a minimum of 8.0 credits or permission of the instructor"}, {"name": "ERS315H5 • Environmental Geology", "description": "This course will focus on Earth processes as they relate to human activities. Topics include sustainability global climate change on short and long timescales; groundwater flow and contamination/human engineering of Earth processes; geological aspects of pollution and waste disposal; and environmental impact of extracting/using minerals, energy, soil, and other Earth resources. A field trip will give students a first-hand experience in aspects of human/planet interaction.", "prerequisites": "1.0 credits of ENV or ERS or GGR at the 200-level or higher"}, {"name": "ERS325H5 • Field Camp I", "description": "This course, held on the north shore of Lake Huron in the summer, covers geological mapping skills, stratigraphic section measurements, and the recognition of rock types, fossils and geological structures in an authentic field-based learning environment in order to interpret ancient geological environments (approx. 12 days of field instruction). Students in this course receive an instructor lead introduction to the regional geology at whitefish falls, Ontario, before engaging in individual or small group projects in which geologic maps of a defined region will be assembled over 5-6 days of student-led field work. Students will complete an oral field examinations at the end of the field days. Students must pay a course fee, which includes transportation and accommodation at the camp, but does not include the cost of food nor does it cover any course fees charged by the Office of the Registrar.Note: U of T Mississauga students must register in the Summer Session, and provide consent waivers and the course fee to the Undergraduate Assistant for Earth Sciences in the Department of Chemical and Physical Sciences. This field camp is usually held in early May. Registration and fee payment deadline: mid-March. For specific yearly course information, please see the UTM CPS Earth Science Fieldtrip page for more information on dates, required field gear and other information.", "prerequisites": {"and": ["ERS201H5", "ERS202H5"], "or": []}}, {"name": "ERS381H5 • Special Topics in Earth Sciences", "description": "A survey of current thinking in Earth science. Topics may include obtaining data in the field or lab and analyzing it, an interdisciplinary research project, and supervised readings. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Enrolment in ERS Major or ERS Specialist or Environmental Geosciences Specialist or Geology Specialist Program and 1.0 ERS or ESS 300-level credits"}, {"name": "ERS399Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for third or higher year students to work on the research project of a professor in earth sciences in return for 399Y course credit. Students enrolled have an opportunity to become involved in original research, enhance their research skills and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project description for the following summer and fall/winter session on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Enrolment in ERS Major or ERS Specialist or Environmental Geosciences Specialist or Geology Specialist Program and 1.0 ERS or ESS 300-level credits"}, {"name": "ERS401H5 • Earth Resources", "description": "The formation and global distribution of precious and industrial mineral deposits are introduced. Exploration methods and mining practices are discussed in terms of environmental effects and issues. Basic aspects of the economics and strategic importance of mineral reserves are also covered. Weekly field trips are included.", "prerequisites": {"and": ["ERS201H5", "ERS202H5", "ERS203H5"], "or": []}}, {"name": "ERS402H5 • Advanced Structural Geology", "description": "This course will cover stress, strain and rheology, the analysis and interpretation of structural features in complexly folded and faulted strata and in plutonic and metamorphic rocks, and basic rock mechanics. Methods include strain analysis, stereographic projection, construction of balanced cross-sections, and geomorphometry.", "prerequisites": "ERS202H5 and 1.0 credits from (ERS201H5 or ERS203H5 or ERS211H5 or ERS225H5)"}, {"name": "ERS403H5 • Earthquake Seismology", "description": "Why do earthquakes occur and how do they cause damage? What is a seismogram and what can it tell us about earthquakes and the Earth’s structure? Earthquakes tend to strike suddenly and without warning. Because of their destructive power, tremendous efforts and monetary resources are dedicated to advancing earthquake science and designing effective hazard mitigation controls. This course will provide an overview of the physics of earthquakes and seismic wave propagation, and current seismic hazard mitigation plans and policies. Concepts covered in this course include stress and strain relations, elastic wave equation, body and surface waves, seismic instrumentation and data, global earth structure, earthquake location, seismic source theory, earthquake mechanics, ground motion, the seismic cycle and earthquake recurrence models, seismic hazard analysis, and human-induced earthquakes.", "prerequisites": {"and": ["ERS202H5", {"and": [], "or": ["MAT132H5", "MAT135H5", "MAT137H5", "MAT137Y5", "PHY136H5", "PHY146H5"]}], "or": []}}, {"name": "ERS404H5 • Volcanology and Geothermal Systems", "description": "Volcanic eruptions are one of the most dangerous and volatile geological hazard. In the 20th Century, almost 100,000 people are believed to have been killed in volcanic eruptions, with another 4.7 million directly affected by them, but, at the end of the 20th century, over 500 million people lived within the hazard zone of a volcano worldwide; cities such as Tokyo, Mexico City, Naples and Seattle are besieged by the threat of nearby volcanoes. Volcanoes also provide fertile soils, near-unlimited geothermal power generation potential and are an intricate part of the Earth system. This course aims to study the mechanism through which volcanoes form, erupt and evolve, their impact on our society and the benefits they provide in the form of geothermal energy. This will be accomplished through discussion, lab and scenario based learning exercises that will take place over one weekend (approx. 16 hours).", "prerequisites": "ERS201H5 and ERS203H5 and 0.5 credits from any other ERS course at the 200- or 300-level"}, {"name": "ERS411H5 • Paleobiology", "description": "This course will focus on the evolving history of organisms and their ecosystems on Earth, including aspects of geochemistry and taphonomy. This course will investigate the interactions between Earth and Life over the past 3.5 billion years, emphasizing how the paleontological record is used to understand the complex nature of our evolving Earth.", "prerequisites": "1.5 credits from (ERS201H5 or ERS202H5 or ERS203H5 or ERS211H5 or ERS225H5)"}, {"name": "ERS412H5 • Climate Through Time", "description": "The goals of this course are to discuss the geologic record of climate change and present an overview of the methods used to reconstruct the earth's climate history and the techniques used to determine the timing of environmental changes. Topics to be addressed will include paleoclimatic reconstruction, climate and climatic variation, dating methods, and climate proxies. In addition, periods of past climate change will be highlighted with particular emphasis on climate change during the recent past. This will be put into perspective with modern day and future global change.", "prerequisites": "1.0 credits from ENV or ERS or GGR at the 200-level or higher"}, {"name": "ERS425H5 • Geology of North America", "description": "This course will provide students with a first-hand field exposure to geologic outcrops in North America, where knowledge gained during classroom instruction throughout their studies can be applied to textbook examples of a variety of real-world geologic features. The course is structured around one major field trip during the fall break where student-led group work on rock outcrops is done, followed by the provision of individual presentations and the preparation of field reports. There is a nonrefundable fee associated with this course beyond tuition. Students must register on ROSI, on a first-come first-serve and non-refundable deposit basis. The deposit must be received by the Department within one week from the first day of enrollment or the student will be dropped automatically from the course. Students should contact the Department by March of the academic year preceding the course to find out more details about the specific field trip plans.", "prerequisites": "Enrolment in ERS Major or ERS Specialist or Geology Specialist Program and 1.5 credits at ERS or ESS 300 level"}, {"name": "ERS471H5 • Research Project", "description": "Arrangements for these independent research projects must be made with an Earth Science Faculty member prior to registration. This course requires the student to submit a completed application to the CPS Undergraduate Assistant. Registration in the course is required. The application form can be downloaded fromwww.utm.utoronto.ca/cps/undergraduate/resources/independent-studies-application-form. Copies of the completed report must be submitted one week prior to the end of term classes. Students may take bothERS471H5andERS472H5in the same term. A component of the mark will be based on an oral presentation made at the end of the course.", "prerequisites": "Any 2.0 credits from ERS or ESS(St. George Campus) at the 300-level and a minimum grade average of 75% in the last 5 courses"}, {"name": "ERS472H5 • Research Project", "description": "Arrangements for these independent research projects must be made with an Earth Science Faculty member prior to registration. This course requires the student to submit a completed application to the CPS Undergraduate Assistant. Registration in the course is required. The application form can be downloaded fromwww.utm.utoronto.ca/cps/undergraduate/resources/independent-studies-application-form. Copies of the completed report must be submitted one week prior to the end of term classes. Students may take bothERS471H5andERS472H5in the same term. A component of the mark will be based on an oral presentation made at the end of the course.", "prerequisites": "Any 2.0 credits from ERS or ESS(St. George Campus) at the 300-level and a minimum grade average of 75% in the last 5 courses"}, {"name": "ERS499Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for a fourth or higher year students to work on the research project of a professor in Earth Science in return for 499Y5 course credit. Students enrolled have an opportunity to become involved in original research, enhance their research skills and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project description for the following summer and fall/winter session on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Any 2.0 credits from the ERS300 level or ESS300(G) level and a 75% average in the last five courses taken."}, {"name": "JCB487Y5 • Advanced Interdisciplinary Research Laboratory", "description": "Students will work together as members of a multidisciplinary team toward the completion of an interdisciplinary experimental or theoretical research project. Teams will be comprised of at least three students, with representation from at least three areas of specialization, namely, astronomy, biology, chemistry, earth sciences or physics. The interdisciplinary projects will be based on current trends in research and student teams will work to complete their projects with guidance provided by a team of faculty advisors from the Biology Department and the Department of Chemical and Physical Sciences. In addition to the rigorous development of research skills, the course will also provide students with training and practical experience in project management techniques and teamwork skills development.JCB487Y5requires submitting an application to the department before the end of June for Fall enrolment. Application forms may be found athttp://uoft.me/cpsforms. Application should be submitted to the CPS Undergraduate Assistant. Registration on ACORN is also required.", "prerequisites": "(2.0 credits at the 300 level from BIO or CHM or JBC or JCP or ERS or ESS(G) or PHY) and (1.0 credit from BIO206H5 or BIO314H5 or CHM372H5 or CHM373H5 or CHM394H5 or CHM395H5 or CHM396H5 or CHM397H5 or ERS201H5 or ERS202H5 or PHY324H5 or PHY347H5). Normally taken in 4th year. Students must obtain approval from the faculty member(s) who will serve as the supervisor(s) in advance of the start of the course."}, {"name": "JGE378H5 • Natural Hazards", "description": "Earth is a dangerous place and risk is an inherent feature of life on this planet. Some of the events and processes that we call \"hazardous,\" such as earthquakes, volcanic eruptions, floods, tsunamis, cyclones, and forest fires are natural environmental processes. We define them as hazards only when they pose a threat to human interests. In this course we will examine natural hazards as well as some technological hazards, their causes, their potential impacts on people, and their management and mitigation.", "prerequisites": "9.0 credits"}]