[{"name": "ECO102H5 • Principles of Macroeconomics", "description": "An introduction to the basic concepts and techniques of macroeconomic theory, including: the determination and measurement of national income, money and banking, monetary and fiscal policy in closed and open economies.", "prerequisites": {"and": [], "or": ["ECO101H5", "ECO101H1"]}}, {"name": "ECO200Y5 • Microeconomic Theory", "description": "An intermediate treatment of the basic tools of economic analysis. Applications may include: choice under uncertainty, oligopoly, industrial organization, pricing, resource allocation, externalities, public goods, income distribution and welfare economics.*ECO200Y5is not open to Commerce or Management Specialist/Major students during Fall/Winter.", "prerequisites": "(ECO101H5(63%) and ECO102H5(63%)) or ECO100Y5(63%)"}, {"name": "ECO202Y5 • Macroeconomic Theory and Policy", "description": "Macroeconomics studies the economy as a whole. The issues it covers include: Why are some countries much richer than others? Why do most Canadians live much better than their ancestors? Why are there recessions in economic activity? What are the causes of inflation and unemployment? What are the consequences of opening up trade and investment with the rest of the world? This course develops a series of models to answer these and similar questions.*ECO202Y5is not open to Commerce students in Fall/Winter", "prerequisites": "(ECO101H5 (63%) and ECO102H5 (63%)) or ECO100Y5(63%)"}, {"name": "ECO204Y5 • Microeconomic Theory and Applications (for Commerce and Management)", "description": "The course uses microeconomics to analyze a variety of issues from marketing and finance to organizational structure. Topics include consumer preferences and behaviour; demand, cost analysis and estimation; allocation of inputs, pricing and firm behaviour under perfect and imperfect competition; game theory and public policy, including competition policy. Business cases are used to connect theory and practice and to highlight differences and similarities between economics and accounting, marketing and finance.This course is restricted to students in a Commerce or Management program.", "prerequisites": "(ECO101H5 (63%) and ECO102H5 (63%)) or ECO100Y5(63%)"}, {"name": "ECO206Y5 • Microeconomic Theory", "description": "A rigorous mathematical treatment of the basic tools of economic analysis regarding consumer and producer theory. Applications may include but are not limited to: choice under uncertainty, oligopoly, industrial organization, pricing, resource allocation, intertemporal consumption, labour supply, externalities, public goods, income distribution and welfare economics. This course is a requirement for certain Specialist Programs and is strongly recommended for students contemplating graduate school.", "prerequisites": "[(ECO101H5 (70%) and ECO102H5 (70%)) or ECO100Y5(70%)] and [MAT133Y5 (80%) or MAT135Y5 (63%) or (MAT135H5 (63%) and MAT136H5 (63%)) or MAT137Y5 (60%) or (MAT137H5 (60%) and MAT139H5 (60%))]"}, {"name": "ECO208Y5 • Macroeconomic Theory", "description": "This course provides a rigorous discussion of models used in the study of macroeconomic phenomena, including business cycles, economic growth, unemployment, inflation, exchange rates, and international trade. This course is a requirement for certain Specialist Programs, and strongly recommended for students contemplating graduate school.", "prerequisites": "[(ECO101H5 (70%) and ECO102H5 (70%)) or ECO100Y5 (70%)] and [MAT133Y5 (80%) or (MAT135H5 (63%) and MAT136H5 (63%)) or MAT135Y5 (63%) or MAT137Y5 (60%) or (MAT137H5 (60%) and MAT139H5 (60%))]"}, {"name": "ECO209Y5 • Macroeconomic Theory and Policy (for Commerce)", "description": "This course covers macroeconomic topics relevant for commerce students. Analytical tools are used to examine various policy questions, including fiscal policy, monetary policy, exchange rate policy, foreign trade policy, labour market policy, and government regulation of financial intermediaries.", "prerequisites": "[ECO101H5(63%) and ECO102H5(63%)] or ECO100Y5(63%)"}, {"name": "ECO220Y5 • Introduction to Data Analysis and Applied Econometrics", "description": "An introduction to the use of statistical analysis, including such topics as elementary probability theory, sampling distributions, tests of hypotheses, estimation; analysis of variance and regression analysis. Emphasis is placed on applications in economics and business problems.", "prerequisites": "[(ECO101H5 (63%) and ECO102H5 (63%)) or ECO100Y5 (63%)] and [MAT133Y5 (63%) or (MAT135H5 and MAT136H5) or MAT135Y5 or (MAT137H5 and MAT139H5) or MAT137Y5]"}, {"name": "ECO227Y5 • Foundations of Econometrics", "description": "This course provides students with a rigorous introduction to statistical analysis such as probability models, random variables, point and interval estimation, hypothesis testing, probability theory, estimation theory, sampling distributions, hypothesis testing, and simple regression analysis. By the end of the course, students should be familiar with the basic tools used to model uncertainty in economics and finance, to test hypotheses, and to estimate model parameters. This course focuses on both the theory and application of these statistical methods. It provides a solid foundation for subsequent courses in econometrics. This course is recommended for students planning graduate studies in Economics.", "prerequisites": "[(ECO101H5(70%) and ECO102H5(70%)) or ECO100Y5(70%)] and [MAT133Y5(80%) or (MAT135H5(63%) and MAT136H5(63%)) or MAT135Y5(63%) or (MAT137H5(60%) and MAT139H5(60%))  or MAT137Y5(60%)]"}, {"name": "ECO251H5 • Special Topics in Economics", "description": "This course covers a special topic in Economics. Content relates to instructor's area of interest, thus the course varies in focus from year to year. Additional details are available from the academic advisor or departmental website. Limited Enrolment. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "[(ECO101H5(70%) and ECO102H5(70%)) or ECO100Y5(70%)] and [MAT133Y5(80%) or (MAT135H5(63%) and MAT136H5(63%)) or MAT135Y5(63%) or (MAT137H5(60%) and MAT139H5(60%))  or MAT137Y5(60%)]"}, {"name": "ECO252H5 • Special Topics in Economics", "description": "This course covers a special topic in Economics. Content relates to instructor's area of interest, thus the course varies in focus from year to year. Additional details are available from the academic advisor or departmental website. Limited Enrolment. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "[(ECO101H5(70%) and ECO102H5(70%)) or ECO100Y5(70%)] and [MAT133Y5(80%) or (MAT135H5(63%) and MAT136H5(63%)) or MAT135Y5(63%) or (MAT137H5(60%) and MAT139H5(60%))  or MAT137Y5(60%)]"}, {"name": "ECO299H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer and fall/winter sessions are posted on the ROP website (www.utm.utoronto.ca/rop/research-opportunity-program) in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "4.0 credits, including 1.0 ECO credit"}, {"name": "ECO299Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer and fall/winter sessions are posted on the ROP website (www.utm.utoronto.ca/rop/research-opportunity-program) in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "4.0 credits, including 1.0 ECO credit"}, {"name": "ECO302H5 • World Economic History Prior to 1870", "description": "This course will focus on the economic success and failure of several key countries and regions from the start of the second millennium up to the early twentieth century. Topics include: pre-modern growth in China & India vs. Europe, the first industrial revolution, exploitation and international trade in the British Empire, the standards-of-living debate, the second industrial revolution.  This course is part of the Certificate in Global Perspectives.", "prerequisites": {"and": [{"and": [], "or": ["ECO200Y5", "ECO204Y5", "ECO206Y5"]}, {"and": [], "or": ["ECO202Y5", "ECO208Y5", "ECO209Y5"]}], "or": []}}, {"name": "ECO303H5 • World Economic History After 1870", "description": "This course will focus on the economic success and failure of several key countries and regions during the twentieth century. Topics include: globalization, causes and consequences of interwar instability, a history of modern development (Japan, the Asian Tigers, India & China vs. Latin America), new institutional economics & new economic geography: African atrophy.  This course is part of the Certificate in Global Perspectives.", "prerequisites": {"and": [{"and": [], "or": ["ECO200Y5", "ECO204Y5", "ECO206Y5"]}, {"and": [], "or": ["ECO202Y5", "ECO208Y5", "ECO209Y5"]}], "or": []}}, {"name": "ECO311H5 • Pricing Strategies", "description": "The course studies firms’ pricing decisions drawing on tools from economic theory. Some examples of the questions that are addressed are: How does a firm determine the price for a new product? How should it optimally price to different market segments? What form do these prices take? When and how should a firm change prices overtime? When should an auction be used to sell a product? What type of auction yields greater profits? The analysis is supplemented by real world examples and case studies from the business world.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and [(ECO220Y5 or ECO227Y5) or (1.0 credit from STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO312H5 • Firms and Markets", "description": "This course studies firms’ strategies and the role of government regulators in different markets. Specifically, it studies strategic decisions that firms make when they interact with other firms. These include how to price in the face of competition, how much to invest in R&D or advertising, and whether to buy a rival (by merging, integrating). The course also analyzes the conditions under which firm’s choices require intervention by market regulators due to a tension between firms’ profits and consumer welfare. The course draws on tools from microeconomics and game theory, and the analysis is supplemented by real world examples and case studies from the business world.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and [(ECO220Y5 or ECO227Y5) or (1.0 credit from STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO313H5 • Environmental Economics", "description": "Application of economics to the field of environmental and natural resource economics. This course uses economic theory and empirical evidence to address important environmental issues, such as management of renewable and non-renewable resources, and different forms of environmental regulation and pollution control. The course will focus on market based instruments, such as tradeable pollution rights, and climate change problems.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO220Y5 or ECO227Y5 or 1.0 credit from STA256H5 or STA258H5 or STA260H5)"}, {"name": "ECO315H5 • Economics of Poverty", "description": "This course will focus on the microeconomic analysis of the causes and consequences of poverty. The emphasis will be on developing countries but we will also draw parallels to poverty in industrialized countries such as Canada. Psychological, cultural, social, and institutional factors will be considered along with an exploration of policy solutions. Some of the topics we will cover include inequality, nutrition, health, education, fertility, credit, savings, and entrepreneurship.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO208Y5 or ECO209Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO320H5 • Economic Analysis of Law: Part 1", "description": "This course examines the economic basis for law and legal institutions. The topics covered include the microeconomic analysis of property rights, contract law, tort law, crime, and the limitations of economic analysis. The appropriate economic measures of damages in tort and contract cases will be discussed. No previous familiarity with the law is assumed. (This is an economic analysis of legal issues, not a course in law.)", "prerequisites": {"and": [], "or": ["ECO200Y5", "ECO204Y5", "ECO206Y5"]}}, {"name": "ECO321H5 • Economic Analysis of Law: Part 2", "description": "This course is a continuation ofECO320H5An Economic Analysis of Law: Part 1. The topics covered include the microeconomic analysis of corporate law, law and financial markets, bankruptcy law, intellectual property law, marriage and divorce law and the choice between regulation and the common law.", "prerequisites": "ECO320H5"}, {"name": "ECO324H5 • Economic Development", "description": "Economic development and transformation of the low-income countries of Latin America, Africa and Asia. Theory and policy analysis relating to the following economic issues in these countries: higher rates of economic growth, the role of the government in resource allocation, the industrial-agricultural sector interface, inward versus outward looking trade strategies, and the international debt problem. The following problems will also be addressed: food supply, domestic savings, tax revenue, foreign exchange, foreign direct investment, high rates of inflation, benefit-cost analysis and economic planning.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO208Y5 or ECO209Y5) and [ECO220Y5 or ECO227Y5 or 1.0 credit from (STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO325H5 • Advanced Economic Theory - Macro", "description": "This course studies the economic foundations of macroeconomic theory and develops analytical skills in constructing and solving macroeconomic models. This course is recommended for students contemplating graduate studies.  This course is part of the Certificate in Advanced Economics.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and [ECO202Y5(70%) or ECO208Y5 or ECO209Y5(70%)] and [ECO220Y5 or ECO227Y5 or 1.0 credit from (STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO326H5 • Advanced Economic Theory - Micro", "description": "This course is an advanced analysis of microeconomic theory, including the behaviour of consumers under uncertainty; issues in poverty, inequality and social welfare; game theory and its applications to economics and political economy. This course is recommended for students contemplating graduate studies.This course is part of the Certificate in Advanced Economics.", "prerequisites": "[ECO200Y5(70%) or ECO204Y5(70%) or ECO206Y5] and [ECO220Y5 or ECO227Y5 or 1.0 credit from (STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO333H5 • Urban Economics", "description": "This is a course on the application of economic analysis to four major areas of urban activity. The areas are land markets, housing and buildings, transportation, and public finance. In each area, we will consider the role of the government and attempt to understand the source of many current urban economic problems.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and [ECO220Y5 or ECO227Y5 or 1.0 credit from (STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO335H5 • Public Economics I: Global Warming, Biodiversity Loss and Inequality", "description": "Public Economics I focuses on contemporary public policy questions. The goal of the course is to help students develop and apply analytical tools, such as cost-benefit analysis, to examine pressing policy issues of our time. Issues include responses to global warming, preserving biodiversity, combating growing inequality, and the regulation of addictive substances. Students will learn how to use empirical evidence to examine these issues. The course places a strong emphasis on discussion, debate, and effective writing about policy issues from an economics perspective.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5)  and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5 or STA258H5 or STA260H5))."}, {"name": "ECO336H5 • Public Economics II: Advanced Policy Analysis", "description": "Public Economics II builds on Public Economics I (although the latter is not a prerequisite). The course focuses on externalities and market failure, and the appropriate role of government in response. Students will study the actual role of government in a variety of settings, with a view to identifying ways of improving economic efficiency and the quality of the environment (among other desirable ends) through different types of policy reform. The course should appeal to students who would like to learn more about applied microeconomic analysis and/or who are interested in public policy issues. The course will provide students with a useful set of microeconomic tools for analyzing public policy questions. Students will also learn basic empirical methods, develop effective writing skills, and apply the techniques learned to examine a variety of interesting current policy issues.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5)  and [(ECO220Y5 or ECO227Y5) or (1.0 credit from STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO343H5 • Labour Economics and Public Policy", "description": "This course uses both applied microeconomic theory and empirical analysis to examine labour markets in Canada. The course is especially focused on the link between research and public policy. Topics to be covered include: labour supply and demand, minimum wages, immigration, human capital, education production, inter- and intra-generational equality, and peer effects. At the end of the course, students should have a firm grasp of key policy issues involving Canada's labour market and be able to critique the quality of other empirical studies.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO344H5 • Labour Economics and Market Frictions", "description": "This course studies the economic behaviour of employers and employees as they interact in the labour market. The class extends beyond basics of labour supply and demand to consider cases when markets are not always perfectly competitive. The course will cover such topics as segmented labour markets, unionization and collective bargaining, unemployment, monopsony, and discrimination.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO345H5 • Macroeconomics and the Labour Market", "description": "This course aims to provide students with an overview of recent macroeconomic research on the labour market. Discussion includes theoretical models as well as empirical evidence. Topics include: search frictions, labour market flows, sorting, inequality, occupational mobility, human capital accumulation, and intergenerational mobility.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO208Y5 or ECO209Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO348H5 • Foundations of Money and Banking", "description": "The strategy of the course is to develop a series of models to examine the importance of money and banks. The topics examined in this framework include: the role of money and the financial system, effects of inflation, public pensions and national debt, and the role and importance of banks.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO208Y5 or ECO209Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO349H5 • Money, Banking & Financial Markets", "description": "This course explores a wide range of topics on the theories of money and banking. The strategy of the course is to develop a series of models to examine the importance of money, banks, and other financial institutions in the way economies work. The topics examined in this framework include: the role of money and the financial system, effects of inflation, bond and stock markets, banks, control of the money supply, and international monetary systems.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO208Y5 or ECO209Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5 or STA258H5 or STA260H5))."}, {"name": "ECO351H5 • Special Topics in Economics", "description": "This course covers a special topic in Economics. Content relates to instructor's area of interest, thus the course varies in focus from year to year. Students require specific prerequisites for each course. Details are available from the academic advisor or departmental website. Limited Enrolment. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Prerequisites will be posted on the departmental website, along with the title and description prior to course registration."}, {"name": "ECO352H5 • Special Topics in Economics", "description": "This course covers a special topic in Economics. Content relates to instructor's area of interest, thus the course varies in focus from year to year. Students require specific prerequisites for each course. Details are available from the student advisor or departmental web site.", "prerequisites": "Prerequisites will be posted on the departmental website, along with the title and description, prior to course registration."}, {"name": "ECO353H5 • Special Topics in Economics", "description": "This course covers a special topic in Economics. Content relates to instructor's area of interest, thus the course varies in focus from year to year. Students require specific prerequisites for each course. Details are available from the student advisor or departmental website. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Prerequisites will be posted on the departmental website, along with the title and description, prior to course registration."}, {"name": "ECO358H5 • Financial Economics I", "description": "This course provides an introduction to capital markets and asset pricing. We will cover the role of financial markets, project valuation, expected utility and risk aversion, financial risk, general equilibrium pricing, the Capital Asset Pricing Model, Arbitrage Pricing Theory, derivatives, option pricing, term structure of interest rates, foreign exchange markets, and market efficiency.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and [(ECO220Y5 or ECO227Y5) or (1.0 credit from STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO359H5 • Financial Economics II", "description": "This course provides an introduction to Corporate Finance. Topics covered include: project valuation, firm's capital structure, dividend policy, management control and agency problems, public share offerings, debt offerings and auctions, mergers and acquisition, bankruptcy costs, tax-influences and bank runs. This course is the sequel toECO358H5.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and [(ECO220Y5 or ECO227Y5) or (1.0 credit from STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO362H5 • Economic Growth: Theory and Evidence", "description": "Differences in income per capita levels and growth rates across countries are large. Understanding the causes behind these differences is a fundamental question in economics. The main objective of this course is to apply economic theory to understand and interpret empirical observations on economic development and growth. By the end of this course students will have a basic knowledge of the main facts characterizing economic development and growth over time and across countries, as well as the ability of theoretical models to account for these facts. The topics that will be covered in the course include the role of physical and human capital accumulation in growth and income differences, the reallocation of factors across sectors (structural transformation) and aggregate productivity, the importance of the misallocation of resources across heterogeneous firms in aggregate productivity. Key empirical applications include the growth performance of industrialized countries since World War II and the productivity slowdown observed in recent decades, the stagnation of living standards in many developing countries, and the role of automation and artificial intelligence in growth and development.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO208Y5 or ECO209Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5)) and (MAT133Y5 or MAT134Y5 or (MAT132H5 and MAT134H5) or MAT135Y5 or (MAT135H5 and MAT136H5) or MAT137Y5 or (MAT137H5 and MAT139H5))"}, {"name": "ECO364H5 • International Trade", "description": "An analysis of the nature, effects and policy implications of international trade theory; the theories of comparative costs and reciprocal demands, factor reward equalization, international tariffs and customs unions.", "prerequisites": {"and": [{"and": [], "or": ["ECO200Y5", "ECO204Y5", "ECO206Y5"]}, {"and": [], "or": ["ECO202Y5", "ECO208Y5", "ECO209Y5"]}], "or": []}}, {"name": "ECO365H5 • International Monetary Economics", "description": "An analysis of the nature, effects and policy implications of international finance; balance-of-payments and foreign exchange analysis; liquidity problems and topics related to current problems in international finance.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO208Y5 or ECO209Y5) and [ECO220Y5 or ECO227Y5 or 1.0 credit from (STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO370Y5 • The Economics of Organizations", "description": "The determinants of the boundary between organizations and markets. Problems of centralization vs. decentralization, authority, coordination and motivation within organizations. Incentives, ownership and property rights. The nature of the employment relationship: explicit and implicit contracts, compensation, relative performance evaluation, career paths, job assignments and promotion.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and [ECO220Y5 or ECO227Y5 or 1.0 credit from (STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO373Y5 • The Environment:  Perspectives from Economics and Ecology", "description": "(FormerlyECO373H5) The course examines the basic principles of environmental economics and ecology and the interaction between ecological and economic factors. It assesses alternative criteria and objectives for environmental policy. Problems associated with the implementation of environmental policy are analyzed and examined through case studies.", "prerequisites": "ECO100Y5(63%) and (ECO200Y5 or ECO204Y5 or ECO206Y5) or by permission of instructor"}, {"name": "ECO375H5 • Applied Econometrics I", "description": "(FormerlyECO327Y5) This course is an introduction to econometrics. Statistical foundations and the interpretation of multiple regression models, with an emphasis on cross-sectional data. Application of regressions to a wide variety of economic questions and data sources, including the use of statistical software. Problems in the identification of causality, and an introduction to methods of addressing common statistical issues. This course is recommended for students contemplating graduate studies.  This course is part of the Certificate in Advanced Economics.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO208Y5 or ECO209Y5) and (ECO220Y5(70%) or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO380H5 • Managerial Economics: Competitive Strategy", "description": "This is a course in applied microeconomics. This course will use a series of real world examples, together with theoretical insights from game theory, to answer questions like, why are some industries more profitable than others? Why are some firms profitable while others are not? How can firms create, capture and maintain their profits in the face of competition? The first part of the course will be devoted to the building blocks of strategy, including industry analysis, positioning, and sustainability of competitive advantage. Next we will use game theoretical tools to analyze strategic interaction among firms, such as strategic pricing, entry and competitive bidding. Lastly, the course will cover the scope of the firm and technologic competition. Students shall learn from the course, the ability to identify and categorize major strategic problems, and suggest and evaluate candidate strategies.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and [ECO220Y5 or ECO227Y5 or 1.0 credit from (STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO381H5 • Managerial Economics: Personnel Economics", "description": "This course examines selected material on compensation and incentives in hierarchical organizations. Topics include recruitment and hiring, training, turnover, downsizing, motivating workers, teams, allocating authority and task assignment.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and [ECO220Y5 or ECO227Y5 or 1.0 credit from (STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO383H5 • Introduction to Empirical Methods of Microeconomics", "description": "(Formerly: Economics of Education) For students who would like to learn more about economics data analysis - this course provides an intuitive introduction to empirical methods in microeconomics. The class begins with a self-contained and intuitive treatment of modern methods used in microeconomic data analysis. We then go on to study some interesting current empirical research, focusing on the education field, to see how those methods are applied. The course should prepare you to read current empirical research in microeconomics -- without any preparation, empirical papers can seem rather impenetrable. This course serves as a complement to and a foundation for 'Applied Econometrics I' (ECO375H5).", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and [ECO220Y5 or ECO227Y5 or 1.0 credit from (STA256H5 or STA258H5 or STA260H5)] and [(MAT133Y5 or MAT135Y5 or (MAT135H5 and MAT136H5) or (MAT137H5 and MAT139H5) or MAT137Y5]"}, {"name": "ECO385H5 • Economics of Information", "description": "This course analyses how markets function when market participants have asymmetric information. We will show how asymmetric information may lead to market breakdown and how an appropriately designed contract can help alleviate the adverse effect of asymmetric information on market efficiency. We will cover three types of models: moral hazard, screening and signaling. There are a wide variety of applications, including labour contracts, price discrimination, insurance markets, and marketing.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO399H5 • Research Opportunity Program", "description": "This course provides senior undergraduate students who have developed some knowledge of a discipline and its research methods, an opportunity to work in the research project of a professor in return for course credit. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer and fall/winter sessions are posted on the ROP website (www.utm.utoronto.ca/rop/research-opportunity-program) in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Minimum of 10.0 credits completed."}, {"name": "ECO399Y5 • Research Opportunity Program", "description": "This course provides senior undergraduate students who have developed some knowledge of a discipline and its research methods, an opportunity to work in the research project of a professor in return for course credit. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer and fall/winter sessions are posted on the ROP website (www.utm.utoronto.ca/rop/research-opportunity-program) in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Minimum of 10.0 credits"}, {"name": "ECO400Y5 • Economics Internship", "description": "Through a part time, unpaid, 200-hour work placement, fourth year students apply economics content and skills. Placements are made throughout the GTA in both the private and public sectors. Successful candidates gain an opportunity to enhance their University experience through on-site work placements providing the possibility to develop skill sets within a business setting. Monthly class meetings plus year-end and presentation are required. Normally, the 200 hours will be completed by attending the work placement one full day each week from September to April. Students interested in a finance-industry placement are strongly recommended to arrange their course schedule to allow for a two day a week work placement in one semester. This arrangement increases the possibility of placement and enhances the experience although careful course planning is essential. More information is available on the Department of Economics website:https://www.utm.utoronto.ca/economics/experiential-learning.", "prerequisites": "Fourth year standing in an Economics Program and recommended CGPA to be determined annually. Acceptance will be based on a combination of CGPA, experience, qualifications and interview performance."}, {"name": "ECO401Y5 • Special Topics in Economics", "description": "This course covers special topics in Economics at an advanced level. Content relates to instructor's area of interest, thus the course varies in focus from year to year. Students require specific prerequisites for each course. Details are available from the student advisor or departmental website. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 48-60 contact hours in total. See the UTM Timetable.", "prerequisites": "Fourth year standing in an Economics Program and recommended CGPA to be determined annually. Acceptance will be based on a combination of CGPA, experience, qualifications and interview performance."}, {"name": "ECO402H5 • Special Topics in Economics", "description": "This course covers a special topic in Economics. Content relates to instructor's area of interest, thus the course varies in focus from year to year. Students require specific prerequisites for each course. Details are available from the student advisor or departmental web site. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Fourth year standing in an Economics Program and recommended CGPA to be determined annually. Acceptance will be based on a combination of CGPA, experience, qualifications and interview performance."}, {"name": "ECO406H5 • Advanced Public Economics", "description": "This course addresses empirical and theoretical issues in public economics. This course will be especially focused on issues related to poverty and inequality. Topics include minimum wage, social mobility, neighborhood effects, welfare, and social insurance. We will also discuss the tools economists use to measure the causal effects of policies, and consider how statistics often presented in policy debates may be biased. After this course, students should be comfortable reading research papers in economics.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO411H5 • Human Capital and Education in the Economy", "description": "(FormerlyECO412Y5) This course addresses empirical and theoretical issues in education economics. Topics will include the interaction of human capital with growth and inequality, teacher incentives and teacher quality, early childhood education, and the racial achievement gap. We will also discuss the tools economists use to measure the causal effects of policies, and consider how statistics often presented in policy debates may be biased. After this course, students should be comfortable reading research papers in economics.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO420Y5 • Reading Course, Seminar or Workshop", "description": "Primarily for advanced Specialist students who have exhausted course offerings in a particular subject area. Open only when a faculty member is willing and available to supervise. Students must obtain the written approval of the chair or associate chair before enrolling. See the student advisor for details.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO421H5 • Reading Course, Seminar or Workshop", "description": "Primarily for advanced Specialist students who have exhausted course offerings in a particular subject area. Open only when a faculty member is willing and available to supervise. Students must obtain the written approval of the chair or associate chair before enrolling. See the student advisor for details.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO422H5 • Reading Course, Seminar or Workshop", "description": "Primarily for advanced Specialist students who have exhausted course offerings in a particular subject area. Open only when a faculty member is willing and available to supervise. Students must obtain the written approval of the chair or associate chair before enrolling. See the student advisor for details.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO433H5 • Gender and Family Economics", "description": "In this course, students will examine gender and the family within modern economics. Topics include: gender wage differentials in labour markets; labour force participation; marriage markets; intimate partner violence; fertility and the demand for children; divorce; and the life cycle of the family. Concepts are applied to current topics within the development and labour literatures.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO208Y5 or ECO209Y5) and [ECO220Y5 or ECO227Y5 or 1.0 credit from (STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO435H5 • Growth and Development of the Chinese Economy", "description": "Both the pace and scale of China's economic transformation over the last three decades are unprecedented in human history. Understanding the nature and the sources of this great transformation is important for at least two reasons. First, it may provide valuable lessons of economic development for other developing countries. Second, the Chinese economy has become increasingly integrated with the world economy. The growth prospect of China is important for both China and the rest of the world. This course will examine China's growth and development through the lens of the modern macroeconomic theory. The topics that will be covered in the course include China's historical growth performance, structural transformation and growth since 1978, resource reallocation and aggregate productivity changes, financial sector development, inflation and business cycles in China.  This course is part of the Certificate in Global Perspectives.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO209Y5 or ECO208Y5) and (ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5))."}, {"name": "ECO436H5 • Measuring Well Being", "description": "The course concerns itself with measuring societal economic well being. The historical development of the subject is considered together with the conceptual issues (and objections) associated with representing the welfare of economic agents. Different notions of welfare (Poverty, Inequality, Polarization, Equality of Opportunity) and the various empirical techniques for examining them are critically explored and applied using existing datasets.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO208Y5 or ECO209Y5) and [ECO220Y5 or ECO227Y5 or 1.0 credit from (STA256H5 or STA258H5 or STA260H5)]"}, {"name": "ECO440H5 • Advanced Topics in Financial Economics", "description": "This course deals with the following topics in financial economics: (1) Theoretical and empirical issues concerning the relevance of corporate financial structure; (2) Interactions between corporate investment and financing decisions; and (3) The role of the financial system and the legal system in economic development and growth.", "prerequisites": "[ECO200Y5 (70%) or ECO204Y5 (70%) or ECO206Y5] and ECO358H5 or by permission of instructor."}, {"name": "ECO456H5 • Public Policy Analysis", "description": "(FormerlyECO356H5) This course provides an opportunity for students to work with real-world data to address current public policy questions. The course discusses issues that arise when analyzing non-experimental social science data and will teach students to recognize the types of research designs that can lead to convincing policy conclusions. A hands-on approach will be emphasized.", "prerequisites": "(ECO200Y5 or ECO204Y5 or ECO206Y5) and (ECO202Y5 or ECO208Y5 or ECO209Y5) and (ECO220Y5(70%) or ECO227Y5 or (1.0 credit from STA256H5 or STA258H5 or STA260H5))"}, {"name": "ECO460H5 • Introduction to Financial Risk Management", "description": "This course provides an overview of financial risks which include market risk, credit risk and operational risk. It also discusses the importance of managing these risks and introduces students to basic tools for analyzing and managing them.", "prerequisites": "[ECO200Y5(70%) or ECO204Y5(70%) or ECO206Y5] and [ECO220Y5(70%) or ECO227Y5 or 1.0 credit from (STA256H5(70%) or STA258H5(70%) or STA260H5)]"}, {"name": "ECO461H5 • The Economics of Financial Risk Management", "description": "This course focuses on how to use derivative securities to manage financial risks. It includes a discussion of why firms should hedge financial market risk, identification and quantification of financial risks; the value-at-risk (VaR) measure of risk; credit risk and capital allocation and difference between speculation and hedging.", "prerequisites": "ECO460H5"}, {"name": "ECO466H5 • Empirical Macroeconomics and Policy", "description": "Students will increase their data literacy and learn how to apply techniques to address policy issues. The topics covered will include the practical design of monetary policy, the rationale for current monetary policy in Canada, and statistical methods for predicting key macroeconomic variables. As part of the course, students will follow current global issues and will forecast how domestic and international events may alter the Bank of Canada's monetary policy in the short run. Students will team-up with their classmates, discuss their individual forecasts, and select one for a group presentation. Traditionally, at the end of the course, a team fromECO466H5is chosen to compete in the Bank of Canada Governor’s Challenge.", "prerequisites": "ECO325H5 and [ECO220Y5 or ECO227Y5 or (1.0 credit from STA256H5, STA258H5, STA260H5)] or Permission of Instructor/Department."}, {"name": "ECO475H5 • Applied Econometrics II", "description": "A research-oriented course continuing fromECO375H5. The regression model is extended in several possible directions: time series analysis; panel data techniques; instrumental variables; simultaneous equations; limited dependent variables. Students will complete a major empirical term paper, applying the tools of econometrics to a topic chosen by the student.", "prerequisites": "ECO375H5"}]