[{"name": "ENG201Y5 • Reading Poetry", "description": "An introduction to poetry, through a close reading of texts, focusing on its traditional forms, themes, techniques, and uses of language; its historical and geographical range; and its twentieth-century diversity.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG202H5 • British Literature in the World I: Medieval to Eighteenth-Century", "description": "This course serves as an introduction to influential texts that have shaped British literary history from Beowulf and Geoffrey Chaucer to William Shakespeare, from John Milton and Aphra Behn to Frances Burney. Students will focus on questions such as the range and evolution of poetic forms, the development of the theatre and the novel, and the emergence of women writers. The course will encourage students to think about the study of English literatures in relationship to history, including the history of world literatures.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG203H5 • British Literature in the World II:  Romantic to Contemporary", "description": "An introduction to influential texts that have shaped British literary history from the Romantic period to the present, covering developments in poetry, drama, and prose, from William Wordsworth to Zadie Smith and beyond. The course will address topics such as revolution and war; the increasing diversity of poetic forms; the cultural dominance of the novel; romanticism, Victorianism, modernism, and postmodernism; feminism; colonialism and decolonization; the ethnic and cultural diversity of Anglophone literature in the twentieth and twenty-first centuries; literature and sexual identity; the AIDS epidemic; and technology and the digital age. The course will encourage students to think about the study of English literatures in relationship to history, including the history of world literatures.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG204H5 • How to Read Poetry", "description": "This course gives students the tools they need to appreciate and understand poetry's traditional and experimental forms, specialized techniques, and diverse ways of using language. The course asks a fundamental question for literary studies: why is poetry is such an important mode of expression in so many different time periods, locations, and cultures?", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG205H5 • Rhetoric", "description": "An introduction to the rhetorical tradition from classical times to the present with a focus on prose as strategic persuasion. Besides rhetorical terminology, topics may include the discovery and arrangement of arguments, validity in argumentation, elements of style, and rhetorical criticism and theory.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG206H5 • Rhetorical Criticism", "description": "This course will use the tools and perspectives of rhetoric, from the Sophists to the postmodern, to analyze and critique the texts and other cultural artifacts that surround us. Much of what we encounter in the cultural realm is an argument; the task in this course will be to understand and engage with those arguments. Students will analyze the rhetoric of poetry, fiction, and drama, as well as of news stories, speeches, video, images, and more.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG210Y5 • The Novel", "description": "An introduction to the novel through a reading of ten to twelve texts, representing a range of periods, techniques, regions, and themes.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG211H5 • Introduction to the Novel", "description": "This course gives students a foundational understanding of the novel in English. It introduces them to the history of the novel, from medieval sagas and adventure stories to modern experiments with fragmentary narratives. The course covers novels from a range of geographical places; students will be asked to consider why the novel has been so successful in the past, and what its futures might be. Students will read at least one complete novel during the course and extracts from others.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG213H5 • The Short Story", "description": "This course explores shorter works of nineteenth, twentieth and twenty first-century writers. Special attention will be paid to formal and rhetorical concepts for the study of fiction as well as to issues such as narrative voice, allegory, irony, and the representation of temporality.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG214H5 • The Short Story Cycle", "description": "This course explores collections of short stories. It examines individual stories, the relationships among and between stories, the dynamics of the collection as a whole, and the literary history of this genre, along with its narrative techniques and thematic concerns.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG215H5 • The Canadian Short Story", "description": "An introduction to the Canadian short story, this course emphasizes its rich variety of settings, subjects, and styles.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG217H5 • Writing about the Visual Arts", "description": "This course introduces students to various literary traditions of writing about the visual arts, from the close analysis of images in novels, poems, and essays to verbal forms (such as ekphrasis and calligrammes) that make poetry and fiction out of paintings, photographs, and sculptures. While the puzzle of translating between space-based and time-based arts will be at the centre of our inquiry, the course will also consider texts and books as visual objects; how writers create visual experiences and mental images; and how literary writing is inspired by museums and exhibitions. Students will have opportunities to practice writing about the arts in collaboration with the Blackwood Gallery at UTM and its featured artists, and, when possible, with other Peel Region and Greater Toronto Area artists and galleries.", "prerequisites": "4.0 credits\nStudents who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG218H5 • Interactive Storytelling and Worldmaking", "description": "This course examines the deep history and extraordinary diversity of interactive storytelling, with a focus on narrative art in digital games, transmedia/cross-platform projects, alternate reality and pervasive games, theme parks, and immersive performances, as well as literary texts and films. We will consider forms (e.g., riddles, parables, metafiction, branching narratives) that require participatory agency, choice-based and emergent storytelling, as well as genres (e.g., creation myths, planetary romances, travelogues, adventure fiction, Expressionist cinema) that discover or assemble a narrative by traversing a world. We will also explore the contexts and theoretical grounds of reader- and player-centric approaches.", "prerequisites": "Open to students who have successfully completed a minimum of 4.0 credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. "}, {"name": "ENG223H5 • Introduction to Shakespeare", "description": "This course introduces students to Shakespeare. Lectures equip them with historical knowledge about literature, politics, and the theatre in Shakespeare's time. Tutorials help them to grapple with Shakespeare's language, versification, and stagecraft. By the end of the course students will have a new framework within which to understand - and interrogate - the enduring power of Shakespeare's work.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG234H5 • Children's Literature", "description": "A critical and historical introduction to works written and created for or appropriated by children, from early didactic forms through the “Golden Era” to 20th-century fiction and contemporary works that centre non-white identities and experiences. The course may include fiction, poetry, drama, non-fiction, and visual media, and may cover works by authors such as John Bunyan, Robert Louis Stevenson, Lewis Carroll, Mark Twain, Lucy Maud Montgomery, A.A. Milne, Louise Fitzhugh, Salman Rushdie, Cherie Dimaline, Aviaq Johnston, Katherina Vermette, Audrey Thomas, Jason Reynolds, Hanna Alkaf, Namina Forna.", "prerequisites": "Open to students who have successfully completed a minimum of 4.0 credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG235H5 • Comics and the Graphic Novel", "description": "An introduction to the writing and sequential art of comics and graphic novels, this course includes fictional and nonfictional comics by artists such as Will Eisner, Art Spiegelman, Frank Miller, Alan Moore, Chris Ware, Daniel Clowes, Julie Doucet, Marjane Satrapi, Chester Brown and Seth.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG236H5 • Detective Fiction", "description": "At least 12 works by such authors as Edgar Allen Poe, Charles Dickens, Wilkie Collins, Arthur Conan Doyle, G.K. Chesterton, Agatha Christie, Dorothy L. Sayers, S.S. Van Dine, Dashiell Hammett, Rayond Chandler, William Faulkner, P.D. James, Ruth Rendell.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG237H5 • Science Fiction", "description": "This course explores speculative fiction that invents or extrapolates an inner or outer cosmology from the physical, life, social, and human sciences. Typical subjects include AI, alternative histories, cyberpunk, evolution, future and dying worlds, genetics, space/time travel, strange species, theories of everything, utopias, and dystopias.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG238H5 • Fantasy Literature", "description": "This course focuses on fantasy literature, film, and television, and draws on a wide range of critical, cultural, and theoretical approaches. As it explores the magical and supernatural, it may consider such genres as alternative histories, animal fantasy, epic, fairy tales, magic realism, and swords and sorcery. Authors and texts covered will survey the history of fantasy across American, British, and Canadian literature, and may include Beowulf, Octavia Butler, Lewis Carroll, Neil Gaiman, Ursela K. Le Guin, C.S. Lewis, George R. R. Martin, Ovid, J.K. Rowling, Shakespeare, Sir Gawain and the Green Knight, Jonathan Swift, and J. R. R. Tolkien.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG239H5 • Horror Literature", "description": "A critical and historical critical introduction to gothic literature, film, and television covering such authors as Angela Carter, Stephen King, H.P. Lovecraft, Richard Matheson, Edgar Allen Poe, Anne Rice, Mary Shelley, Robert Louis Stevenson, and Bram Stoker. The course draws on diverse critical and theoretical approaches as it examines a wide range of national and cultural contexts. It focuses on the gothic in broad terms and such concepts and issues as fear, horror, terror, the monstrous, the mythological, and the supernatural.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG250Y5 • American Literature", "description": "An introductory survey of major works in American literature, this course explores works in a variety of genres, including poetry, fiction, essays, and slave narratives.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG251H5 • Introduction to American Literature", "description": "This course introduces students to major works in American literature in a variety of genres, from poetry and fiction to essays and slave narratives.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG252Y5 • Canadian Literature", "description": "An introductory survey of major Canadian works in poetry, prose, and drama from early to recent times.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG255H5 • Introduction to Canadian Literature", "description": "This course introduces students to Canadian literatures, from the oral narratives of Canada's early Indigenous communities to new writing in a digital age.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100 level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG259H5 • Imagining Nature: Literature and the Environment", "description": "This course examines the relationship between writing and the environment. Students will examine the role of the written word in defining, thinking about, and acting in the interest of the planet and its climate, while considering literary genres, theoretical frameworks, and contemporary and multidisciplinary debates. Readings will vary but may include William Wordsworth, Henry David Thoreau, Walt Whitman, Rachel Carson, Edouard Glissant, Octavia Butler, Jamaica Kincaid, and Amitav Ghosh.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG261H5 • Music and Literature", "description": "This course introduces students to the intersection of music and literature. We will study how melody, rhythm and texture interact with language, story and performance using examples from folk ballads and blues, art-songs, popular songs, musical theatre, jazz and hiphop, as well as poems inspired by musical styles and performers. Works to be covered may include folksongs collected by Francis Child and Alan Lomax, Thomas Moore’s Irish Melodies, popular songs by Bob Dylan, Leonard Cohen and Joni Mitchell, theatrical works by Bertolt Brecht, Stephen Sondheim and Lin-Manuel Miranda, performances by The Last Poets, hiphop lyrics by Public Enemy, and poems by William Blake, William Wordsworth, Emily Dickinson, Langston Hughes and Don McKay.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.    Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG263H5 • Play and Games", "description": "Why do we play? Game designers, philosophers, sociologists, and performance theorists have long argued that play can tell us about our development as children and adults, our search for freedom, our relationship to animals, and the values and problems of our societies. This course introduces students to Play Studies and Game Studies in the humanities by considering the reasons we play in relationship to the objects we play with, including things that are more normally thought of as games—card and board games, sports, toys, video games—as well as other sites of playful thought and action, like paintings, films, and short stories. Students in this course will encounter major scholars of play and games and key terms and concepts in the analysis of play and games. We will play and design story-rich games and we will discuss effective narrative design primarily in digital games. Students will also consider problems in play and games like cheating, addiction, and gamification.", "prerequisites": "Open to students who have successfully completed a minimum of 4.0 credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website. "}, {"name": "ENG269H5 • Queer Writing", "description": "Introducing a lesbian, gay, bisexual, trans, and queer tradition in literature and theory, this course may explore texts from a variety of historical periods, from the classical to the contemporary. It will focus on a variety of genres, potentially including poetry, drama, fiction, criticism, and popular culture.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG271H5 • Toronto's Multicultural Literatures", "description": "Toronto is one of the world's most diverse and multicultural cities. This course is a study of literature by writers with strong connections to Toronto who explore issues such as diasporas, identity, nationality, place, origin, and the multicultural experience. Writers may include: Judy Fong Bates, Dionne Brand, Austin Clarke, Pier Giorgio Di Cicco, Rohinton Mistry, Michael Ondaatje, M. Nourbese Philip, Shyam Selvadurai, M. G. Vassanji.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG273H5 • Literatures of Immigration and Exile", "description": "In this course we will study literary and non-literary texts in English from the nineteenth century to the present day that come from colonial and postcolonial contexts and that speak to the experience of those affected by colonization, immigration, exile, war, and globalization. Students will be introduced to postcolonial theory and questions about race, ethnicity, religious difference, and diasporas in Anglophone literary studies. They may study texts by Joseph Conrad, Henry James, Samuel Beckett, James Joyce, Jean Rhys, Ezra Pound, Eugene Ionesco, Vladimir Nabokov, Arthur Koestler, Joseph Brodsky, V.S. Naipaul, Chinua Achebe, Milan Kundera, Josef Skvorecky, Salman Rushdie, Mavis Gallant, W.G. Sebald, Michael Ondaatje, Edwich Danticat, and Azar Nafisi.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG274H5 • Indigenous Literature and Storytelling", "description": "An introduction to Indigenous literature and storytelling with emphasis on First Nations, Métis, and Inuit authors in Canada and Native American authors in the United States of America. In this course, students will review academic citation practices, apply Indigenous theory to storytelling, and engage with audio recordings, poetry, drama, novels, short stories, and non-fiction by writers such as Jeannette Armstrong, Billy-Ray Belcourt, Natalie Diaz, Michael Dorris, Tomson Highway, Basil Johnston, Daniel Heath Justice, Lee Maracle, Eden Robinson, Leslie Marmon Silko, and Tommy Orange.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG275H5 • Feminist Approaches to Literature", "description": "This course will consider the implications, for literary studies and for literary writing, of modern traditions of feminist and gender theory. Students will encounter the work of major feminist thinkers - e.g., Mary Wollstonecraft, Simone de Beauvoir, Alice Walker, Julie Kristeva, and Judith Butler - and texts by major women writers. The course will explore feminist approaches to literature, including those that borrow from post-structural, psychoanalytic, and contemporary gender, race, and queer theories.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG276H5 • Fanfiction", "description": "This course investigates fanfiction from a variety of theoretical standpoints, including gender and sexuality studies, critical race studies, and affect theory. It considers the literary history of fanfiction- amateur, unauthorized stories about characters invented by canonical writers (e.g., Jane Austen and Arthur Conan Doyle); a wide selection of fanfiction stories; and the commercialization of the products of the modern fanfiction industry.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG277H5 • Bad Romance", "description": "This course covers romances of the eighteenth to the twenty-first century, ranging from the amatory (stories about love, longing, and desire) to the fantastic (the supernatural and fantasy). Students will consider issues of canonization, popularity, the text-author-reader relationship, definitions of high and low art, ideas about good and bad writing, and eroticism and desire. Texts may include Harlequin romances, paranormal romance, and works by Jane Austen, the Brontes, Daphne du Maurier, Stephenie Meyer, Nicholas Sparks, Sarah Waters, and E. L. James.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG279H5 • History of Video Games", "description": "This course introduces students to the history of video games from early arcade cabinets and personal computers to home video game consoles and mobile devices in everyday life. It considers the role of culture, technology, and marketing in the formation of interactive texts, genres, and play experiences. Students will be exposed to unique primary sources in the Syd Bolton Collection of video games and the Electric Playground Media Archive of historical game industry footage through course content, lectures, and assignments.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG280H5 • Critical Approaches to Literature", "description": "An introduction to literary theory and its central questions, such as the notion of literature itself, the relation between literature and reality, the nature of literary language, the making of literary canons, and the roles of the author and the reader.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG289H5 • Creative Writing", "description": "Students will engage in a variety of creative exercises, conducted across a range of different genres of literary writing.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG291H5 • Reading for Creative Writing", "description": "This course will help students to see connections between their reading and their work as creative writers. They will read texts in a variety of literary and non-literary genres and consider the way that writers learn their craft from other writers. Practical assignments will encourage students to find creative ways to critique, imitate, speak to, and borrow responsibly from the work they read.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits.     Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG299H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work on the research project of a professor. Students enrolled have an opportunity to become involved in original research, learn research methods, and share in the excitement and discovery of creating new knowledge. Professors' project descriptions for the following fall-winter session are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG299Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work on the research project of a professor. Students enrolled have an opportunity to become involved in original research, learn research methods, and share in the excitement and discovery of creating new knowledge. Professors' project descriptions for the following fall-winter session are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ENG300Y5 • Chaucer", "description": "The foundation of English literature: in their uncensored richness and range, Chaucer's works have delighted wide audiences for over 600 years. Includes The Canterbury Tales, with its variety of narrative genres from the humorous and bawdy to the religious and philosophical, and Troilus and Criseyde, a profound erotic masterpiece.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG301H5 • Making Love in the Sixteenth Century", "description": "In this course, students will follow the changing constructions of love and love poetry in the sixteenth century, starting with Wyatt and Surrey, passing through Richard Tottel, to the Elizabethan court, and ending with the erotic love poetry that served as a backlash against the Petrarchanism of the early sixteenth century.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG302H5 • Magical Realism", "description": "Magical realism is a visual and literary style that seamlessly incorporates fantastical or magical elements into realist fiction. In this way, magical realism challenges our usual expectations about reality and its representation. This course will explore the origins of magical realism in visual arts and its exciting revisions in diverse historical and cultural settings. Issues of individual and communal identity, social justice, revenge and haunting, traumatic past and collective memory, power struggles and political upheaval are all part of this literary style. We will look at paintings, read fiction and non-fiction, and consider film as productive contexts to examine the uneasy marriage between plausible reality and magical imagination.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits"}, {"name": "ENG303H5 • Milton", "description": "Selections from Paradise Lost and other works.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG304H5 • Seventeenth-Century Poetry", "description": "An in-depth study of poetry written during the reign of the early Stuarts and the English Civil Wars. Includes genres such as love poetry, social and political satire, metaphysical poetry, utopic fiction, and political philosophy and poetry, and authors such as John Donne, Katherine Philips, Margaret Cavendish, George Herbert, Richard Crashaw, Henry Vaughan, Thomas Traherne, Ben Jonson, Aemilia Lanyer, Robert Herrick, and Andrew Marvell.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG305H5 • Eighteenth-Century Satire and Print Culture", "description": "This course surveys what has been referred to as the ‘golden age of satire’, a period that witnessed a flourishing of satirical poetry, prose, drama, and illustration as powerful modes of critique. In the process of analyzing works by Swift, Pope, Montagu, Gay, Hogarth, and others, this course will explore concerns such as the rise of print culture, the legitimacy of satire, the gendering of satire, the role of criticism, the limits of humour, censorship, and the threat of seditious libel.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG306Y5 • Restoration and 18th-Century Literature", "description": "Writers of this period grapple with questions of authority and individualism, tradition and innovation, in politics, religion, knowledge, society, and literature itself. Special attention to John Dryden, Alexander Pope, Jonathan Swift, Samuel Johnson, and at least six other authors.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG308Y5 • Romantic Poetry and Prose", "description": "This course provides a general survey of the poetry and prose of the British Romantic period (roughly from 1770 to 1830). Subjects to be explored may include political revolution, slavery and abolition, the expansion of the British empire, the flourishing of women writers and feminist thought, and experimentation with literary forms. Authors to be considered may include Anna Barbauld, William Cowper, William Blake, Olaudah Equiano, William Wordsworth, Samuel Taylor Coleridge, Hannah More, Mary Wollstonecraft, Lord Byron, Percy Shelley, Mary Shelley, Jane Austen, Walter Scott, John Clare, Henry Louis Vivian Derozio, and John Keats.", "prerequisites": "1.0 credit of ENG and 3.0 additional credits."}, {"name": "ENG309H5 • Anishinaabe Storytelling and Oral Tradition", "description": "An introduction to the legends, beliefs, and values of the Anishinaabek Nation. Students will explore literary and non-literary texts, media, and/or performances, spanning traditional and innovative forms, genres, and mediums. Content may include contributions by Basil Johnston, Jane School Craft, George Copway, Richard Wagamese, Winona LaDuke, Margaret Noodin, Drew Hayden Taylor, Louise Erdrich, Waubgeshig Rice, Alan Corbiere, Isaac Murdoch, Leanne Betasamosake Simpson, Debajehmujig Theatre Group, and Aanmitaagzi.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG310H5 • Modern South Asian Literature in English", "description": "The English language belongs not just to the British colonizers, but to the artists and writers, the poets and politicians of the colonized world. From Rabindranath Tagore’s mystical poetry toSlumdog Millionaire, the styles and aesthetics of South Asian English are as vast as the peninsula itself, and the literature that has emerged from this diverse region has utterly reshaped contemporary global culture. Additionally, we will take up select contemporary criticism on subaltern studies, postcolonialism, and narratology. Authors will include Mulk Raj Anand, V.S. Naipaul, R.K. Narayan, Z.A. Suleri, Salman Rushdie, Anuradha Roy, Jjumpa Lahiri, as well as select works of poetry, film, and visual art.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits"}, {"name": "ENG311H5 • Medieval Literature", "description": "This course explores a selection of writings in from medieval Britain, excluding the works of Chaucer.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG312H5 • Special Topic in Medieval Literature", "description": "A concentrated study of one aspect of medieval literature or literary culture, such as a particular genre or author, a specific theme, or the application of a particular critical approach. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG313H5 • Special Topic in Early Modern British Literature", "description": "A concentrated study of one aspect of early modern British literature or literary culture, such as a particular subgenre or author, specific theme, or the application of a particular critical approach. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG314H5 • Special Topic in Eighteenth-Century British Literature", "description": "A concentrated study of one aspect of eighteenth-century British literature or literary culture, such as a particular subgenre or author, specific theme, or the application of a particular critical approach. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG315H5 • Special Topic in Nineteenth-Century British Literature", "description": "A concentrated study of one aspect of nineteenth-century British literature or literary culture, such as a particular subgenre or author, specific theme, or the application of a particular critical approach. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG and 3 additional credits."}, {"name": "ENG316H5 • Special Topic in Modern and Contemporary Literature", "description": "A concentrated study of one aspect of modern or contemporary literature or literary culture, such as a particular subgenre or author, specific theme, or the application of a particular critical approach. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG317H5 • Drama of the Global South", "description": "This course compares works of selected playwrights of the Global South in an effort to understand their refashioning of postcolonial perspectives and subaltern histories. Ranging beyond the West and its theatrical traditions, the course will explore innovative theatrical performances that focus on South-South affiliations and link discourses, places, and people positioned between peripheries. Students will learn about traditions of orality, cultural pluralities, and indigenous mythic/folk styles that constitute the unique syncretism of South-South theatre cultures. Writers may include Manjula Padmanabhan, Shahid Nadeem, Meng Jinghui, Dalia Taha, Athol Fugard, Ama Ata Aidoo, Ngugi wa Thiong’o, Derek Walcott, José Triana, and Ariel Dorfman.", "prerequisites": "1.0 credit in ENG and 3 additional credits."}, {"name": "ENG318H5 • Eighteenth-Century Women Writers", "description": "A study of poems, novels, dramas, and prose works by British and American authors such as Mary Astell, Aphra Behn, Anna Laetitia Barbauld, Frances Burney, Maria Edgeworth, Eliza Haywood, Hannah More, Judith Sargent Murray, Mercy Otis Warren, Charlotte Smith, Phyllis Wheatley, and Mary Wollstonecraft. Topics may include professionalization and the literary marketplace; domestic labour; motherhood and children’s literature; class and education; personal agency and political engagement; colonialism, slavery, and abolition; Bluestocking culture; and early feminist thought.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG319H5 • Sexuality, Race, and Gender in Video Games and Gaming Culture", "description": "This course investigates representation and identity in and through digital games. Students will primarily consider gender, race, sexuality, and the non-human world in relation to the complex circuits of desire, projection, and disguise that exist among players, avatars, non-player characters, and other gamers. Students will interpret and critique both blockbuster AAA games with large development budgets and production teams as well as small-scale indie and experimental games and will learn about expressive, critical, and avant-garde design and play practices. The class will also discuss games as instruments of persuasion, protest, social change, and community formation.", "prerequisites": "(1.0 credit of ENG, which must include 0.5 credit of 200-level ENG Game Studies and 3.0 additional credits) or permission from the department"}, {"name": "ENG320H5 • Transforming Literature in the Sixteenth Century", "description": "This course focuses on transformations of major literary forms during the sixteenth century, especially on how these transformations involve engagements with medieval and earlier materials. It covers such topics as Petrarchan poetry in translation by Wyatt and Surrey; John Fox's and John Bale's repackaging of Anne Askew's biography; and the work of Ovid and other classical authors in translation and adaptation, as in the Shakespeare's Venus and Adonis.", "prerequisites": "1.0 credit in English and 3.0 additional credits."}, {"name": "ENG322Y5 • The Rise of the Novel in the Eighteenth Century", "description": "This course studies the emergence of prose fiction as a genre recognized in both a literary and a commercial sense. Authors may include Aphra Behn, Daniel Defoe, Samuel Richardson, Henry Fielding, Laurence Sterne, Walter Scott, and Jane Austen.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG323H5 • Austen and Her Contemporaries", "description": "A study of selected novels by Austen and of works by such contemporaries as Radcliffe, Godwin, Wollstonecraft, Wordsworth, Edgeworth, Scott, and Shelley, in the context of the complex literary, social, and political relationships of that time.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG324H5 • Special Topic in Game Studies", "description": "A concentrated study of one facet of Game Studies, such as a genre, mechanic, or era in gaming, an aspect of game design, production, or reception, or the application of a specific critical approach. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits, which must include a 0.5 credit in a 200-level Game Studies course or permission from the director of Game Studies."}, {"name": "ENG325H5 • The Victorian Novel", "description": "This course surveys several major novels in order to understand the genre that came to dominate literary culture in the Victorian era. Topics may include realism, the marriage plot, the social-problem novel, feminism and sexual identity, novels of growing up, the city, and seriality. Authors may include Charles Dickens, William Makepeace Thackeray, Emily Brontë, Charlotte Brontë, Elizabeth Gaskell, Anthony Trollope, George Eliot, Wilkie Collins, Thomas Hardy, George Gissing, and Oscar Wilde, among others.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG326H5 • Premodern World Literatures", "description": "This course approaches the premodern period by examining early British literatures alongside literary works of the period c.500-1650 from the continents of Asia, Africa, Europe, and the Americas. Texts may include Tang dynasty poetry, the Tale of Genji, the Persian epic Shahnameh, the Italian Decameron, 1001 Nights, Old Norse sagas, Chaucer's Canterbury Tales, and Harriot's Briefe and True Report of the New Found Land of Virginia. Texts will be provided in translation where necessary.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG327H5 • Chaucer Today", "description": "Sometimes thought of as the foundation of English poetry, Geoffrey Chaucer’s life and work in the late 14th century may seem remote from the 21st. Yet, Chaucer continues to be read, retold, and reinterpreted today, both in the academy and in popular culture. This course will consider Chaucer’s work and its modern retellings to ask how and why he continues to matter. Alongside readings of Chaucer’s original poetry, we will consider modern adaptations and translations of his work into various media from film to hip-hop, Chaucer’s reappearance and uses in global contexts, and reinterpretations of his life and works amidst rapidly shifting political and cultural realities.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG328H5 • Writing for Games and Narrative Design", "description": "This course introduces students to the planning and implementation of writing for video games as well as the role of the narrative designer in game development. Students will practice multiple collaborative forms of game writing (e.g., flow charts, quest outlines, character descriptions, flavour text, non-player character dialogue, cut scenes, storyboard scripts), level design, and player experience creation. Students will learn to use design and editing tools as well as iterative processes of revising game writing to augment gameplay and game features. Students will also learn to analyze and critique diverse game narratives and will discuss careers in game writing.", "prerequisites": "1.0 credits in ENG and 3.0 additional credits, which must include a 0.5 credit in a 200-level Game Studies course or permission from the director of Game Studies"}, {"name": "ENG329H5 • Contemporary British Fiction", "description": "This course explores six or more works by at least four British contemporary writers of fiction.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG330H5 • Medieval Drama", "description": "Texts and performances preceding and underlying the plays of Shakespeare and his contemporaries, including creation-to-doomsday play cycles; plays performed in parishes, inns, great halls, outdoor arenas, and at court; religious and political propaganda plays; political pageants. Attention is given to social, political, and theatrical contexts.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG331H5 • Elizabethan Drama", "description": "This course explores English drama to the end of the reign of Queen Elizabeth I, with attention to such playwrights as John Lyly, Thomas Kyd, Christopher Marlowe, and William Shakespeare.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG332H5 • Restoration and Early 18th Century Literature", "description": "This course engages with British poetry, drama, and prose from the later seventeenth century through early eighteenth century—a period that saw the restoration of the monarchy, the Glorious Revolution, the Acts of Union, and the transition from Stuart to Hanoverian rule. Topics to be addressed may include religious and political dissent; colonialism and slavery; libertine culture; theatrical performance; female actors and women writers; the “birth” of the novel; and the establishment of the periodical press. Authors may include Aphra Behn, John Bunyan, Susanna Centlivre, Daniel Defoe, John Dryden, Anne Finch, Delarivier Manley, Samuel Pepys, and the Earl of Rochester.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits"}, {"name": "ENG333H5 • The Modernist Novel", "description": "This course explores novels by such writers as Henry James, Joseph Conrad, Willa Cather, Edmund Forster, James Joyce, Virginia Woolf, David Lawrence, and William Faulkner.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG334H5 • Global Indigenous Literatures", "description": "This course studies Indigenous literatures from around the world. Regions may include the Americas, the Pacific Islands, New Zealand, Australia, Asia, Africa, Russia, and Scandinavia. Through these literatures, the course addresses topics such as: the specific and localized ways colonialism manifests and exerts power; UNDRIP (the United Nations Declaration on the Rights of Indigenous Peoples); the distinct experiences, histories, storytelling traditions, and decolonization processes of Indigenous peoples from different regions; how and why decolonization processes shift from one part of the world to another; and movements and experiences that bring Indigenous peoples from various regions together in solidarity.", "prerequisites": "1.0 credit in ENG and 3 additional credits"}, {"name": "ENG335H5 • Jacobean Drama", "description": "This course explores English drama from the death of Queen Elizabeth I to the closing of the theatres, with attention to such playwrights as Ben Jonson, Thomas Middleton, William Shakespeare, and John Webster. As part of this course, students may have the option of participating in an international learning experience that will have an additional cost and application process.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG336H5 • Special Topic in Shakespeare", "description": "A concentrated study of one aspect of Shakespeare's work, such as his use of a particular genre, a particular period of his work, a recurring theme, or the application of a particular critical approach. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG337H5 • Restoration and Eighteenth-Century Drama", "description": "A study of drama and theatrical performance from 1660-1800, featuring works by authors such as Aphra Behn, Susannah Centlivre, William Congreve, Hannah Cowley, John Gay, George Lillo, Richard Brinsley Sheridan, Richard Steele, and William Wycherley. Students can expect to learn about the modes of drama practiced during this period and their intersection with sexuality and gender, class, economics, politics, colonialism, and national identity. Students will also learn about theatre history, including the advent of female performers, changing theatre construction, the Licensing Act and theatrical censorship, the rise of the celebrity actor, and the popularization of Shakespeare.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG338H5 • Eighteenth-Century British Literature", "description": "This course engages with British poetry, drama, and prose from the “Augustan Age” through the early Romantic period. Topics may include the flourishing of print culture; satirical and sentimental literature; the “rise” of the novel; art and aesthetics; science and technology; colonialism, slavery, and abolition; and women writers. Authors may include Frances Burney, Henry Fielding, Thomas Gray, Eliza Haywood, William Hogarth, Samuel Johnson, Lady Mary Wortley Montagu, Alexander Pope, Samuel Richardson, Mary Robinson, Richard Brinsley Sheridan, and Jonathan Swift.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG339H5 • Early Modern Women Writers", "description": "A study of poems, plays, prose fiction, and polemical works by medieval and early modern writers such as Anne Askew, Mary Wroth, Queen Elizabeth I, Mary Sidney, Amelia Lanyer, Lucy Hutchinson, Hester Pulter, and Margaret Cavendish. Topics may include race, women and science, love poetry from a female perspective, gender and trans studies, renarrations of the story of Eve, sexuality, and editorial history and practice.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG340H5 • The Rise of Modern Drama", "description": "A study of plays in English by such dramatists as Oscar Wilde, William Butler Yeats, George Bernard Shaw, John Millington Synge, Susan Glaspell, Langston Hughes, and Eugene O'Neill, as well as plays in translation by such dramatists as Henrik Ibsen, Anton Chekhov, August Strindberg, and Luigi Pirandello.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG341H5 • Modern Drama: Late Twentieth-Century to Present Day", "description": "A study of plays by such dramatists as Samuel Beckett, Arthur Miller, Tennessee Williams, Harold Pinter, Wole Soyinka, and Caryl Churchill, with background readings from other dramatic literatures.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG342H5 • Contemporary Drama", "description": "A study of ten or more plays by at least six recent dramatists.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG343H5 • World Drama", "description": "Students will read/watch screenings of drama in English and in translation from around the world, including Africa, East Asia, South Asia, the Middle East, the Caribbean, Latin America, and South America. Topics may include traditional forms (Kathakali dance, Noh and Kabuki, Beijing Opera, Nigerian masquerades) adapted for the modern stage; agit-prop and political drama; object performance; the place of drama within a global media ecology; and drama as a site of intercultural and transcultural appropriation, negotiation, and exchange.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG344H5 • Spy Fiction", "description": "This course examines the rise and popularization of spy fiction in the twentieth century. It focuses on authors such as Graham Greene and John le Carré within the context of the Cold War and the nuclear stand-off between the Soviet Union and the West.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG345H5 • Victorian Poetry", "description": "This course surveys the poetry of the Victorian era in Britain, with a focus on experiments in poetic genre and form, and on the social and political commitments of poetry in a period of colonialism, industrialization, and changing ideas about gender and sexuality. Topics may include lyric and the dramatic monologue, the poetry of political protest, love and sexuality, feminism and queerness, aestheticism and decadence, empire and the emergence of global poetry in English, and pastoral and the poetry of urban life. Poets may include Elizabeth Barrett Browning, Alfred Tennyson, Robert Browning, Matthew Arnold, Christina Rossetti, D. G. Rossetti, Gerard Manley Hopkins, A. C. Swinburne, Toru Dutt, George Meredith, Augusta Webster, Amy Levy, Oscar Wilde, Michael Field, Thomas Hardy, Sarojini Naidu, and many others.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG346H5 • Indigenous First Story Toronto", "description": "This course explores the history of Toronto/Tkaronto as it is documented in contemporary Indigenous texts and oral narratives. In addition to engaging with these works to provide a fuller understanding of Indigenous histories, treaties, and laws, this course may draw from archives such as First Story Toronto at the Native Canadian Centre of Toronto to shed light on present-day lived experiences. The course asks students to reflect on what it means to be treaty people within this territory, the responsibilities of living in the Toronto area, and how to be more mindful as treaty partners to Indigenous residents within this space and place. Course content may include audio recordings, fiction, non-fiction, poetry, visual art, film, and drama. The course may also include land-based and autoethnographic components.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits"}, {"name": "ENG347H5 • The Nineteenth-Century American Novel", "description": "This course will introduce students to historical and cultural concerns of nineteenth-century America through major subgenres of the novel, including the gothic, the sentimental, realism, and naturalism. Emphasis will be on shifts in the novel across the century as well as the relationship of the nineteenth-century novel to print culture, including serial publication in literary magazines and newspapers. We may also think about how non-fiction texts from this period draw on the conventions of fiction. Authors studied may include Charles Brockden Brown, Fanny Fern, George Lippard, Harriet Beecher Stowe, Charles Chesnutt, Mark Twain, Edith Wharton, and Pauline Hopkins.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits"}, {"name": "ENG348H5 • Special Topic in Indigenous Storywork", "description": "Applying decolonial and Indigenous methodologies, students will explore Indigenous texts, media, and/or performances, spanning traditional and innovative forms, genres, and mediums engaged by Indigenous writers and makers. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG349H5 • Contemporary Poetry", "description": "This course examines works by a variety of contemporary poets, focusing on how their writing participates in contemporary dialogues about art, society, and the larger world.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG350H5 • Poetry and Modernism", "description": "Special study of Hopkins, Yeats, Pound, Eliot, Stevens; selections from other poets.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG351H5 • Toni Morrison: Texts and Contexts", "description": "In this advanced introduction to the work of Toni Morrison, we will encounter masterpieces such asSula,Song of Solomon, andBelovedand pay particular attention to questions of literary tradition and inheritance, form and narrative voice, and ethics in contexts of oppression. We will read most of Morrison’s novels, alongside major essays, in the chronological order in which they were published. Students will be introduced to major themes in African American literary criticism and theory through close engagement with Morrison’s oeuvre and its critical legacy.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG352H5 • Canadian Drama", "description": "Canadian plays, with emphasis on major playwrights and on developments since 1940, but with attention also to the history of the theatre in Canada.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG353Y5 • Canadian Prose Fiction", "description": "A study of twelve or more Canadian works of fiction, primarily novels.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG354Y5 • Canadian Poetry", "description": "A study of major Canadian poets, modern and contemporary.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG355H5 • Black British Literature", "description": "This course is an advanced introduction to the concept and key texts of ‘Black British literature.’ A term arising directly in response to empire and the postcolonial, Black British literature indicates texts written by both African- and South Asian- descended writers from the Caribbean, Africa, and the subcontinent. Focused primarily on the twentieth-century, we will contextualize this literary tradition within wider questions of Britain in the world and how the idea of literary influence is challenged and re-formed. Writers may include: Sam Selvon, Hanif Kureishi, Derek Walcott, Stuart Hall, Buchi Emecheta, Caryl Philips, Zadie Smith, Helen Oyeyemi, and Warsan Shire.", "prerequisites": "1.0 credit in ENG and 3 additional credits"}, {"name": "ENG356H5 • Caribbean Literature", "description": "A multi-lingual and multi-racial archipelago, the Caribbean has a rich literary and theoretical tradition: this course will introduce students to major figures in Caribbean Anglophone literature (including Jean Rhys, Kamau Brathwaite, George Lamming, Erna Brodber, V.S. Naipaul, Jamaica Kincaid, in addition to some texts read in English translation (including Aimé Cesaire,Alejo Carpentier, Maryse Condé, Marie Vieux Chauvet)", "prerequisites": "1.0 credit in ENG and 3 additional credits"}, {"name": "ENG357H5 • New Writing in Canada", "description": "Close encounters with recent writing in Canada: new voices, new forms, and new responses to old forms. Texts may include or focus on poetry, fiction, drama, non-fiction, or new media.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG358H5 • Special Topic in Canadian Literature", "description": "A concentrated study of one aspect of Canadian literature or literary culture, such as a particular subgenre, author, period, or theme, or the application of a particular critical approach. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG359H5 • Land Back: Indigenous Voices and Narratives", "description": "This course examines how stories by Indigenous Peoples assert the inherent right to Indigenous sovereignty, self-determination, and self-government, with emphasis on settler colonialism in Canada and in the United States of America. This course engages with Indigenous narratives to understand the relationship between concepts of land rights, Indigenous resurgence, reconciliation, decolonization, and the politics of recognition. Topics may include Indigenous futurisms, digital sovereignty, treaty-making, Indigenous feminisms, sovereign eroticism, Indigenous political movements, land-based organizing, and environmental and climate justice. Texts may include the United Nations Declaration on the Rights of Indigenous Peoples and the UN Working Group on Indigenous Peoples, as well as film, music, literature, and non-literature from individuals such as Glen Coulthard, Winona Laduke, Alanis Obomsawin, Tracey Lindberg, Audra Simpson, Leanne Betasamosake Simpson, Joy Harjo, Leroy Little Bear, Snotty Nosed Rez Kids, and Taiaiake Alfred.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits"}, {"name": "ENG360H5 • Early American Literature", "description": "This course explores writing in a variety of genres produced in the American colonies in the seventeenth and eighteenth centuries, such as narratives, poetry, autobiography, journals, essays, sermons, and court transcripts.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG361H5 • Canadian Literature, Beginnings to 1920", "description": "This course explores the origins of Canadian literature, with an emphasis upon the post-Confederation period. Students will examine work in a range of genres, which may include novels, short stories, life writing and poetry, and will consider how the nation is being created and debated in print. Topics may include settler colonialism, nationalism, and representation. Attention may also be paid to Canadian book history and print culture in the period.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits"}, {"name": "ENG362H5 • Canadian Literature, 1920 to the Present", "description": "This course explores Canadian literature from the 1920s to the contemporary period. Students will examine the work of major authors in their cultural, social, and historical contexts. Topics may include the development of literary modernism in Canada, regional literary geographies, postmodern innovations, multiculturalism and hybridity, and Indigenous literary and cultural production in the part of Turtle Island that is called Canada.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG363Y5 • Nineteenth-Century American Literature", "description": "This course explores American writing in a variety of genres from the end of the Revolution to the beginning of the twentieth century.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG364Y5 • Twentieth-Century American Literature", "description": "This course explores twentieth-century American writing in a variety of genres.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG365H5 • Contemporary American Fiction", "description": "This course explores six or more works by at least four contemporary American writers of fiction.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG366H5 • Special Topic in American Literature", "description": "A concentrated study of one aspect of American literature or literary culture, such as a particular subgenre, author, period, or theme, or the application of a particular critical approach. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG and 3.0 other credits."}, {"name": "ENG367H5 • African American Literature", "description": "This class is an advanced introduction to the field of African American literary studies, tracing its origins and emergence through the slave trade to the present day, with particular focus on nineteenth- and twentieth-century writing, and the criticism and theory to which it gives rise. Authors studied may include: Harriet Jacobs, Charles Chesnutt, Pauline Hopkins, James Baldwin, Gayl Jones, Toni Morrison.", "prerequisites": "1.0 credit in ENG and 3 additional credits"}, {"name": "ENG368H5 • Black Feminist Poetics", "description": "This course considers the relationship between poetry written by Black women (particularly June Jordan, Audre Lorde, and Lucille Clifton) and Black feminist theory (bell hooks, Angela Davis, the Combahee River Collective). In addition to a grounding in this 20th-century moment, the course will also consider nineteenth-century example (including Sojourner Truth and Ida B. Wells) and the contemporary moment, consider a wide arc of how Black feminism produces and arises from Black poetics.", "prerequisites": "1.0 credit in ENG and 3 additional credits"}, {"name": "ENG369H5 • Black Women’s Writing", "description": "This course takes as its focus the intersection of race and gender as explored and expressed in diasporic Black women’s writing. With a focus on North America, we will ask about the relationships amongst self-expression and genre under conditions of disempowerment. This course introduces contemporary thinking about race and colonial encounters alongside fiction and life-writing by African American, Canadian, and Caribbean women from a range of historical periods. Authors may include: Mary Prince, Harriet Jacobs, Audre Lorde, Jamaica Kincaid, Edwige Danticat, Dionne Brand.", "prerequisites": "1.0 credit in ENG and 3 additional credits"}, {"name": "ENG370H5 • Global Literatures in English", "description": "This course involves in-depth study, within the framework of postcolonial and transnational studies, of literatures in English from around the world. It includes fictional and non-fictional texts and contemporary films and media representations.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG371H5 • Special Topic in World Literatures", "description": "A concentrated study of one aspect of postcolonial literature or literary culture, such as a particular genre, author, period, regional or national context, or theme, or the application of a particular critical approach. Topics may vary from year to year.", "prerequisites": "1.0 credits in ENG and 3.0 additional credits."}, {"name": "ENG372H5 • Special Topic in Literary Theory", "description": "A concentrated study of one aspect of literary or critical theory, such as a particular school of theory, an important author, or a contemporary theoretical debate. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG373H5 • Creative Writing: Poetry", "description": "This course will involve a wide variety of experiments with poetic expression and poetic forms.", "prerequisites": {"and": [], "or": ["ENG289H5", "ENG291H5"]}}, {"name": "ENG374H5 • Creative Writing: Prose", "description": "Students will experiment with fiction and non-fiction prose writing, including autobiography, biography, and narrative for new visual, digital, and interactive media.", "prerequisites": {"and": [], "or": ["ENG289H5", "ENG291H5"]}}, {"name": "ENG375H5 • Editing Literary Texts", "description": "Students will learn the basics of literary editing for different readerships: the course will cover such topics as the selection of a base text; treatment of variants; creation of paratext; design and layout; proofs and proofchecking; and the differences between print and digital media.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits; or ENG289H5/ENG291H5"}, {"name": "ENG376H5 • Creative Writing: Nonfiction", "description": "Students will experiment in a workshop environment with a variety of short, non-fictional forms, e.g. memoir, auto/biography, true crime.", "prerequisites": "1.0 credit in ENG and 3.0 other credits"}, {"name": "ENG377H5 • Special Topic in Creative Writing", "description": "A concentrated study of one aspect of creative writing practice, such as a particular genre or theme, or the application of a particular formal technique. Topics may vary from year to year.", "prerequisites": "1.0 credit in ENG (including ENG289H5 or ENG291H5) and 3.0 other credits"}, {"name": "ENG378H5 • Special Topic in Writing for Performance", "description": "A concentrated study of one aspect of writing for performance such as a particular medium (e.g. digital), genre, or theme. Topics may vary from year to year.", "prerequisites": {"and": [], "or": ["ENG289H5", "ENG291H5"]}}, {"name": "ENG379H5 • American Literature in Global Contexts", "description": "We often categorize literature by its nation of origin when we study and teach, though we also recognize the limitations involved in doing so. Over the past several decades, the study of U.S. literature, in particular, has been shaped by transnational and global approaches that emphasize the porous nature of any “national” literature. In this course, students will study approaches to American Literature in global contexts. These may include hemispheric approaches to U.S. literatures that emphasize U.S. interactions with Central America and the Caribbean, engagements with Africa in U.S. literatures, or U.S. literatures and the Pacific from the eighteenth century through the present.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits"}, {"name": "ENG380H5 • History of Literary Theory", "description": "Literary theory from classical times to the nineteenth century. Topics include theories of the imagination, genre analysis, aesthetics, the relations between literature and reality and literature and society, and the evaluation and interpretation of literature.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG381H5 • Digital Texts", "description": "This course considers the ways in which digital technologies are transforming texts, reading, readerships, and the idea of the literary. Students will study a wide variety of digital texts, e.g., fanfiction, webcomics, viral Tumblr posts and tweets, and video games. They will also learn about the use of digital tools to read, study, and preserve texts. The course may include a practical project, e.g., the design of a narrative game using Twine; the curation of a digital exhibit using Omeka; or an argument about some text/s using visualization software.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG382Y5 • Contemporary Literary Theory", "description": "This course explores literary theory from the early twentieth century to the present. Schools or movements studied may include structuralism, formalism, phenomenology, Marxism, post-structuralism, reader-response theory, feminism, queer theory, new historicism, psychoanalysis, postcolonial theory, and cultural and race studies.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG383H5 • British Romanticism and Its Contexts", "description": "This course gives students a new perspective on the cultural contexts for British Romanticism: students will learn about literature's relationship to philosophy, politics, religion, science, and colonialism in the Romantic period, as they examine works by some major authors such as William Wordsworth, Walter Scott, and Mary Shelley.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG384H5 • Literature and Psychoanalysis", "description": "An introduction to psychoanalysis for students of literature, this course considers major psycholanalytic ideas through close readings of selected texts by Freud and related psychoanalytic thinkers. The course also explores critiques and applications of Freud's work and examines a selection of literary texts that engage psychoanalytic theory.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG385H5 • British Romanticism, 1770-1800", "description": "This course covers the early Romantic period in British Literature. Students may read novels such as Frances Burney's Evelina; plays such as Richard Brinsley Sheridan's School for Scandal; writing on the French and American Revolutions; William Blake's Songs of Innocence and of Experience; and ballads by William Wordsworth, Samuel Taylor Coleridge, Hannah More, and Mary Robinson.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG386H5 • British Romanticism, 1800-1830", "description": "This course covers the later Romantic period in British Literature. Authors studied may include Walter Scott, Mary Shelley, Percy Shelley, Jane Austen, Lord Byron, and John Keats.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG387H5 • Popular Novels in the Eighteenth Century", "description": "This course offers students a chance to read some early novels in English - from the scandalous to the sentimental to the Gothic. They will consider what made novels best-sellers in eighteenth-century Britain and why the popularization of novel reading was such a source of controversy at the time. Authors may include: Daniel Defoe, Samuel Richardson, Henry Fielding, Laurence Sterne, Frances Burney, and Ann Radcliffe.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG388H5 • Spaces of Fiction", "description": "Real or imagined geographical locations, landscapes, rooms and houses play an important role in literature. In addition to providing a narrative setting, fictional space might guide our interpretation of plot, serve as a metaphor for broader historical, sociological or psychological issues, or become a character in its own right. Ranging across a variety of literary periods and genres, this course will explore how works of fiction describe space and how these descriptions shape our responses. Authors and texts may range from the early English period to the present day, including Beowulf, Geoffrey Chaucer, William Shakespeare, Margaret Cavendish, Jane Austen, Edgar Alan Poe, Nathaniel Hawthorne, Henry James, Virginia Woolf, Daphne du Maurier, Shirley Jackson, Gloria Naylor, Toni Morrison, Arundhati Roy, Amitav Ghosh, V.S. Naipaul, and so on.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG390Y5 • Individual Studies", "description": "A scholarly project chosen by the student and supervised by a faculty member. The form of the project and the manner of its execution will be determined in consultation with the supervisor. All project proposals must be submitted to the Undergraduate Advisor, who can provide proposal forms.", "prerequisites": "1.0 credits in English and 3.0 additional credits."}, {"name": "ENG391Y5 • Individual Studies - Creative Writing", "description": "A project in creative writing chosen by the student and supervised by a faculty member. The form of the project and the manner of its execution will be determined in consultation with the supervisor. All project proposals must be submitted to the Undergraduate Advisor who can provide proposal forms.", "prerequisites": "1.0 credits in English and 3.0 additional credits."}, {"name": "ENG392H5 • Canadian Fiction", "description": "Students will read novels and/or short stories of importance for Canadian literary history: these may include, for example, L.M. Montgomery's Anne of Green Gables, Hugh MacLennan's Two Solitudes, Lawrence Hill's Book of Negroes, and Alice Munro's Hateship, Friendship, Courtship, Loveship, Marriage.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG393H5 • Canadian Poetry in Context", "description": "This course gives students a chance to think about the social, historical, and personal circumstances that have produced the work of some major Canadian authors, from the poets of Canadian Confederation to contemporary Black and Indigenous writers such as M. NourbeSe Philip and Rita Joe.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG394H5 • American Literature from the Revolution to 1900", "description": "Students will read a selection of American writings from the late eighteenth and nineteenth centuries; these may include the stories of Edgar Allan Poe, the poetry of Walt Whitman and Emily Dickinson, Harriet Beecher Stowe's novels, and slave narratives such as those of Frederick Douglass and Harriet Jacobs.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG395H5 • American Literature 1900 to the Present", "description": "Students will read a selection of works by American authors as diverse as Edith Wharton, Ernest Hemingway, T.S. Eliot, Sylvia Plath, Harper Lee, Thomas Pynchon, and Jhumpa Lahiri.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG396H5 • Literary Theory Now", "description": "This course will explore some of the most recent, provocative, and significant developments in literary theory, including work in such areas as eco-criticism, literary activism, critical race studies, Indigenous studies, queer and trans studies, and cognitive literary studies.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG397H5 • Individual Studies", "description": "A scholarly project chosen by the student and supervised by a faculty member. The form of the project and the manner of its execution will be determined in consultation with the supervisor. All project proposals must be submitted to the Undergraduate Advisor by May 15 who can provide the proposal form.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG398H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for upper-level students to work on the research project of a professor. Students enrolled have an opportunity to become involved in original research, learn research methods, and share in the excitement and discovery of creating new knowledge. Professors' project descriptions for the following fall-winter session are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "1.0 credits in English and 3.0 additional credits."}, {"name": "ENG399Y5 • Research Opportunity Program", "description": "For senior undergraduate students who have developed some knowledge of a discipline and its research methods, this course offers an opportunity to work on the research project of a professor. Students enrolled will become involved in original research, develop their research skills, and share in the excitement and discovery of creating new knowledge. Professors' project descriptions for the following fall-winter session are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "1.0 credit in ENG and 3.0 additional credits."}, {"name": "ENG400H5 • Capstone Seminar: Writing a Research Project", "description": "This course offers specialists and advanced majors an opportunity to do sustained and intensive research on a topic developed in consultation with the instructor. Course instruction will consist of training in various research methodologies, advice and help in putting together reading and research lists, and guided workshops where students can practice drafting, editing, and peer editing as well as comparing notes and research materials.", "prerequisites": "Completion of 14.5 credits."}, {"name": "ENG410H5 • Seminar: Critical Game Studies", "description": "Advanced study of a topic in critical game studies that addresses urgent and evolving questions in critical approaches to games, e.g., defining games, play and players, game production, violence in games, and the social and pedagogical benefits of games.", "prerequisites": "1.0 credits in ENG and 3.0 additional credits, which must include 1.5 credits in Game Studies courses or permission from the director of Game Studies"}, {"name": "ENG414H5 • Seminar:  Literary Theory / Methods", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG415H5 • Seminar: Literary Theory / Methods", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG416H5 • Seminar:  Literary Theory / Methods", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG424H5 • Seminar:  Canadian Literature", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG425H5 • Seminar: Canadian Literature", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG426H5 • Seminar: Race, Ethnicity, Diaspora, Indigeneity", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG434H5 • Seminar: Race, Ethnicity, Diaspora, Indigeneity", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG435H5 • Seminar:  American Literature", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG436H5 • Seminar:  American Literature", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG460H5 • Seminar: Literature Pre-1700", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG461H5 • Seminar:  Literature Pre-1700", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG462H5 • Seminar: Literature Pre-1700", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG463H5 • Seminar: Literature 1700-1900", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG464H5 • Research Seminar: The Story of the Book", "description": "This course will introduce students to the history of the book and other technologies of human record. Focusing on the pre- and early modern periods, the course asks the question--what material substances and objects do people use to share imaginative stories? And, what difference can knowing about these make to the history of literature, including literatures in English? The course is partly experiential and collaborative in design. We will learn from one or more present-day book makers: e.g. an Ojibwe maker of birch bark scrolls; or a modern parchment maker or bookbinder. We will visit the Fisher Rare Book Library to see, among others books, one made in 1474 by William Caxton, England’s first printer. And we will collaborate with students working in Forensic Science and Chemistry to use scientific techniques--from advanced microscopy to x-ray fluorescence spectroscopy--to develop and answer humanistic questions about books: e.g. Where did book makers obtain their materials? How have book making technologies--and with them literary texts and traditions--travelled around the globe? What evidence have readers of old books left behind? Underpinning the course is a critical approach to the so-called “Toronto School”--that is, “the theory of the primacy of communication in the structuring of human cultures and the structuring of the human mind.” Is the work of e.g. Harold Innis and Marshall McLuhan relevant to the 21st study of literature? What messages are still readable in the media used by the literary communities of the past?", "prerequisites": "5.0 credits in ENG and 4.0 additional credits."}, {"name": "ENG470H5 • Seminar: Literature 1700-1900", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG471H5 • Seminar: Literature 1700-1900", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG472H5 • Seminar: Modern and Contemporary Literature", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG473H5 • Seminar: Modern and Contemporary Literature", "description": "See department for description.", "prerequisites": "5.0 credits in ENG and 4.0 additional credits"}, {"name": "ENG489Y5 • Creative Writing Workshop", "description": "The course allows students to workshop their own creative project/s with the instructor and their peers. Restricted to students who in the opinion of the Department show special aptitude. Detail requirements will be posted in advance of this date. Students should contact the instructor or the Undergraduate Advisor for more information.", "prerequisites": "Permission of instructor and portfolio must be submitted by 30 June and contact Undergraduate Advisor for more information."}]