[{"name": "ANT205H5 • Introduction to Forensic Anthropology", "description": "Introduction to the field of forensic anthropology. Outlines the areas in which forensic anthropologists may contribute to a death investigation and introduces basic concepts relating to the recovery and analysis of human remains.", "prerequisites": {"and": [], "or": ["ANT101H5", "BIO152H5"]}}, {"name": "ANT439H5 • Advanced Forensic Anthropology", "description": "Forensic anthropologists are responsible for the search, recovery, and analysis of human skeletal remains in modern contexts. This course will explore the knowledge and skills used by forensic anthropologists to reconstruct the biological profile of the deceased, make an identification, contribute to the determination of manner and mode of death, understand the events that took place at the scene, and to provide an estimate of time since death.", "prerequisites": {"and": ["ANT205H5", "ANT334H5"], "or": []}}, {"name": "FSC100H5 • The Real CSI", "description": "This class introduces the science of Crime Scene Investigation and related forensic specialities. Students will learn about the latest scientific developments in the field, contrasting these to popular portrayals of CSI in the media, and addressing the impact of popular portrayals on juror expectations, knowledge and misconceptions.Note: This is a general first year course open to everyone. PLEASE NOTE: The required FSC Program 1st year introductory course is:FSC239Y5Introduction to Forensic Science", "prerequisites": "ANT205H5 and ANT334H5"}, {"name": "FSC101H5 • The Real Law & Order", "description": "As a compliment to FSC100, this class transports students from the crime scene to the courtroom, to learn how forensic evidence and scientific methods hold up in court to become admissible. Students will discover the differences between approved and junk science, and see how emerging forensic sciences contribute to exonerations, addressing the impact of popular media portrayals on juror expectations, knowledge and misconceptions.Note: This is a general first year course open to everyone. PLEASE NOTE: The required FSC Program 1st year introductory course is:FSC239Y5Introduction to Forensic Science", "prerequisites": "FSC100H5"}, {"name": "FSC210H5 • Physical Evidence and Microscopy", "description": "Forensic Science examines physical evidence in relation to the law. There are a number of scientific techniques used to characterize physical evidence, but perhaps the most utilized technique is microscopy. In this course, students will practice how to process and characterize trace evidence using a number of different microscopy techniques, such as stereomicroscope, polarized light microscope (PLM), comparison microscope, scanning electron microscope (SEM), and confocal microscope. The theory and operation behind each microscopy technique will be discussed during lecture, while students will have the opportunity to operate the different microscopes during laboratory sessions.", "prerequisites": "FSC239Y5"}, {"name": "FSC220H5 • Introduction to Forensic Psychology", "description": "This course provides an introductory overview of the many ways psychological research and theories (i.e. behavioural science) can deliver useful information in collecting and assessing evidence for criminal investigation, trial, and prevention. Topics may include: eyewitness testimony, deception, criminal profiling, false confession, mental illness, victim trauma, criminal responsibility, risk assessment, serial killing, hate crimes, sexual offending, prejudiced policing, and jury decision-making. The aim of this course is to give students general insight into the various applied specializations of forensic psychologists.", "prerequisites": "PSY100Y5"}, {"name": "FSC239Y5 • Introduction to Forensic Science", "description": "Forensic science is the application of any scientific inquiry into criminal investigation. The results of such inquiry are ultimately for presentation in courts of law. Specialists in forensic science will lecture on a variety of topics that will include crime scene investigation, the role of the coroner, forensic pathology, forensic chemistry, forensic botany, forensic entomology, forensic anthropology, forensic dentistry, psychology and toxicology. Case studies will be reviewed, and the role of the expert witness will be examined.", "prerequisites": "PSY100Y5"}, {"name": "FSC271H5 • Ethics and Professionalism in Forensic Science", "description": "This course covers the importance of professionalism and ethical behaviour for Forensic Scientists. It looks at the role of the Forensic Scientist and the expert witness and the consequences when ethical guidelines are not followed.", "prerequisites": "FSC239Y5"}, {"name": "FSC300H5 • Forensic Identification", "description": "Focusing on the scene of the crime and evidence found there, this course is an introduction to the field of forensic identification. Topics include: crime scene protocols, management and reconstruction; image collection, storage and enhancement; recognition collection; and chain of custody and preservation of evidence.", "prerequisites": {"and": ["FSC239Y5", "FSC271H5"], "or": []}}, {"name": "FSC302H5 • Advanced Forensic Identification", "description": "Continuing fromFSC300H5, this course focuses on advanced crime scene examination and the use of evidence detection techniques. Topics include: advanced fingerprint development techniques, footwear collection and identification, analysis report writing, bloodstain pattern interpretation and crime scene plan drawing. Additional topics discuss biometrics, examiner bias, the expert witness, crime scene examination protocols and courtroom testimony.", "prerequisites": "FSC300H5"}, {"name": "FSC303H5 • Techniques of Crime Scene Investigation", "description": "This course will provide students with an introduction to forensic photography, crime scene processing, and forensic identification. Topics include, but are not limited to: fingerprint identification, chance impression evidence, physical evidence, crime scene and victim photography, and proper documentation of a crime scene. Students will gain an understanding of the basic \"toolkit\" required for crime scene processing, and learn the fundamentals of proper collection and analysis of physical evidence.As an alternative to (FSC300H5,FSC302H5), this course satisfies the third year IDENT requirement needed for enrolment inFSC481Y5,FSC482H5,FSC483H5, andFSC485H5. Note: This coursedoes notsatisfy the IDENT requirement forFSC407H5.", "prerequisites": {"and": ["FSC239Y5", "FSC271H5"], "or": []}}, {"name": "FSC307H5 • Missing Persons DVI and Unidentified Human Remains", "description": "The goal of this course is to gain a basic understanding of the case management involved in missing persons, disaster victim identification, and unidentified human remains cases. Topics covered will include the interdisciplinary interactions between anthropology, odontology, fingerprinting and forensic genetics in the identification and databasing of both missing persons and recovered unidentified human remains.", "prerequisites": "(ANT202H5 or BIO207H5). Priority given first to students enrolled in the Forensic Specialist Program and Forensic Science Majors."}, {"name": "FSC311H5 • Forensic Chemistry", "description": "This course focuses on the analysis of physical evidence based on the principles of analytical chemistry. Students will gain knowledge in the theory and operation of forensically relevant chemical and instrumental techniques used for the analysis of evidentiary items, including drug/alcohol analysis, gunshot residue, explosives, paint analysis, etc. Students will also develop skills relating to the interpretation, limitation, and implications of analytical results in a forensic context.  (Priority given first to Forensic Science Specialists and Majors; then Minors.)", "prerequisites": {"and": ["CHM211H5"], "or": [{"and": ["CHM110H5", "CHM120H5"], "or": []}, "CHM140Y5"]}}, {"name": "FSC312H5 • Bioinformatics in Forensic Biology", "description": "This course will introduce core concepts, practices and research topics including DNA sequence alignment, DNA sequence analysis, interacting with scientific databases, and genome sequencing technologies within a forensic biological context. This course includes computer-based practical exercises using freely available software (i.e., R Studio, the command line, etc.) wherein students will apply bioinformatics tools and be introduced to basic computer programming within a forensic and investigative genetic lens.", "prerequisites": "BIO206H5 and BIO207H5  "}, {"name": "FSC314H5 • Hot Topics in Forensic Science", "description": "A lecture-based course examining contemporary topics in forensic science. The course will emphasize group discussion where students will examine, review, criticize, and present on current trends and fundamental topics within forensic science, which could include evidence screening, methodology, forensic technological developments/enhancements as well as current ethical and/or political changes in the field. The implications and applications of forensic science research advances will also be explored. The theme of the course is expected to be topical and current, and to vary from year to year to accommodate the interests of both the students enrolled in the course and the faculty member(s) teaching the course.", "prerequisites": {"and": ["FSC239Y5", "FSC271H5"], "or": []}}, {"name": "FSC315H5 • Forensic Biology", "description": "This course focuses on the analysis and interpretation of biological evidence in a forensic context. Students will gain knowledge in the theory and operation of forensically relevant biological and instrumental techniques used for the analysis of evidentiary items, including DNA, bodily fluids, hair, etc. Students will also develop skills relating to the interpretation, limitation, and implications of analytical results in a forensic context.  (Priority given first to Forensic Science Specialists and Majors; then Minors.)", "prerequisites": {"and": ["BIO206H5", "BIO207H5"], "or": []}}, {"name": "FSC316H5 • Forensic Anatomy", "description": "This course examines the body as forensic evidence. Human gross anatomy and histology will be examined from the perspective of forensic pathology, students will learn about the role of the body in crime scene analysis, autopsy procedures such as fingerprinting and forensic imaging of the deceased, and address anatomical anomalies useful for forensic purposes such as identification. Other topics include bodily decomposition, disease, and injuries.", "prerequisites": "FSC239Y5 and FSC271H5  "}, {"name": "FSC320H5 • Forensic Psychopathology", "description": "Pathology is the study of disease and psychopathology is the study of mental illness. In Forensic Psychopathology, then, we make inquiries about mental illness in the context of forensic practices. In this course, we will explore multiple topics in the field providing the student with a general insight into its history, scientific merits, and practical relevance. We will survey prevailing theories on mental health, illness, and treatment. Investigate psychiatric diagnoses such as (juvenile) Conduct Disorder, Antisocial Personality Disorder, and Psychopathy, hereunder their application and relevance in risk assessment, behavior prediction, and offender rehabilitation. We will also discuss methodological, ethical, and legal issues in the field, for example, the scientific validity of psychiatric diagnostics, the ethical implications of using psychiatric assessments in forensic institutions, and the legal responsibility of mentally ill offenders.", "prerequisites": {"and": ["FSC220H5", "FSC271H5"], "or": []}}, {"name": "FSC330H5 • Best Practices in Forensic Science", "description": "This course will guide students through the common fundamentals of quality assurance, health & safety, resiliency and post-traumatic stress disorder (PTSD) training and report writing in forensic science professions.", "prerequisites": "FSC271H5"}, {"name": "FSC335H5 • Forensic Epistemology and Theory", "description": "This course will explore and discuss the basic role of a forensic scientist and what it means to be scientifically informed.", "prerequisites": {"and": ["FSC239Y5", "FSC271H5"], "or": []}}, {"name": "FSC340H5 • Research Design", "description": "This course introduces students to common methods of research design and the nature of data collection. Students will learn how to pose a meaningful research questions, to select appropriate data types, to define variables, examine bias, confounding factors, and select appropriate statistics that address their purpose.", "prerequisites": "FSC271H5"}, {"name": "FSC341H5 • Applied Forensic Statistics", "description": "Designed as a companion course toFSC340H5, Forensic Statistics will introduce students to basic analytic methods necessary to evaluate quantitative data in forensic science. Students will learn methods of visualizing and analyzing univariate, bivariate, and multivariate data in forensic science, with emphasis on practical applications of statistics in various forensic sub-disciplines. No prior knowledge of statistics and mathematics is required.", "prerequisites": "FSC239Y5"}, {"name": "FSC350H5 • Special Topics in Forensic Science", "description": "A survey of recent developments in theory and applications of forensic science with particular attention to case studies in a particular branch of forensic science. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "FSC239Y5 or permission of instructor"}, {"name": "FSC351H5 • Advanced Topics in Forensic Science", "description": "A survey of recent developments in theory and applications of forensic science with particular attention to case studies in a particular branch of forensic science. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "FSC239Y5 or permission of instructor"}, {"name": "FSC360H5 • Evidence, Law and Forensic Science in Canada", "description": "This course will explore the position of forensic science within the law in Canada. The focus will be on the evolution of the acceptance of forensic science in Canadian criminal law and its current position within the legal system. Topics include: Evidence law, expert evidence law, defining the expert, differing standards of legal acceptance for police sciences and others. Important historical documents and legal advancements will be surveyed.", "prerequisites": {"and": ["FSC239Y5", "FSC271H5"], "or": []}}, {"name": "FSC361H5 • Mental Illness and the Criminal Justice System", "description": "This course will develop students’ knowledge of forensic mental health issues throughout the criminal justice system, including the nature and extent of mental illness in our society and the various legal, social and ethical issues that arise when a mentally disordered individual comes into contact with the criminal justice system. Topics to be explored include: the medical and legal definitions of mental disorder and their relationship to each other; the criteria for state-compelled treatment and how it impinges upon individual autonomy; the changing views of the justice system’s duty to accommodate victims and witnesses with mental health issues; fitness to stand trial and the defense of not criminally responsible; and the Review Board process.", "prerequisites": "FSC271H5"}, {"name": "FSC370H5 • Forensic Psychopharmacology", "description": "This course introduces students to the area of psychopharmacology (drug induced changes in mood, thinking and behaviour). The mechanisms of action of drugs in the nervous system and their effects on the brain and on behaviour will be explored and the significance of psychopharmacology in criminal investigations and trials will be discussed.This course is recommended as preparation forFSC371H5.", "prerequisites": {"and": ["FSC239Y5", "FSC271H5", "BIO152H5"], "or": []}}, {"name": "FSC371H5 • The Science of Cannabis", "description": "This course introduces students to the science of cannabis. Students will learn about the constituents of cannabis, methods of analysis and the pharmacology of cannabinoids. In addition, the role of cannabis in forensic case work will be explored.", "prerequisites": "FSC239Y5 and FSC271H5 and BIO152H5"}, {"name": "FSC399Y5 • Research Opportunity Program", "description": "This course provides senior undergraduate students who have developed some knowledge of a discipline and its research methods an opportunity to work in a research project. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. This course is aimed at facilitating International Research Opportunities offered at U of T's partner institutions and coordinated through the Centre for International Experience. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "FSC239Y5 and FSC271H5 and BIO152H5"}, {"name": "FSC401H5 • Forensic Pathology", "description": "This is a general introduction of the scientific and medical basis of forensic pathology. The scientific aspects of death investigation will be emphasized including cause, manner, and time of death. Emphasis will be placed in developing skills to critically examine the published forensic scientific and medical literature. Also included are human rights death investigation, and custodial death.", "prerequisites": {"and": ["FSC239Y5", {"and": [], "or": ["FSC316H5", "BIO210Y5"]}], "or": []}}, {"name": "FSC402H5 • Forensic Toxicology", "description": "Forensic toxicology involves the study of the adverse effects of drugs, alcohol and poisons on biological systems in a medicolegal context. This course will include a review of pharmacokinetics, analytical techniques and quality assurance measures used in forensic toxicology, the effects of drugs on human performance and post-mortem toxicology of illicit drugs, pharmaceutical drugs and other poisons. The major focus of this course will be the role that a forensic toxicologist plays in criminal and death investigations.", "prerequisites": {"and": ["FSC239Y5", {"and": [], "or": [{"and": ["CHM110H5", "CHM120H5"], "or": []}, "CHM140Y5"]}], "or": []}}, {"name": "FSC403H5 • Forensic Analytical Toxicology", "description": "Analytical toxicology is the isolation, detection, identification, and quantitation of foreign compounds (xenobiotics) in biological and other specimens. This course integrates theoretical and practical aspects of analytical chemistry with forensic toxicology. General aspects of method development, implementation, validation, and laboratory operation will be explored.", "prerequisites": {"and": ["FSC239Y5", "CHM211H5"], "or": []}}, {"name": "FSC406H5 • Introduction To 3D Crime Scene Mapping And Reconstruction", "description": "This course introduces students to both standard and innovative methods of documenting, mapping, analyzing, and visualizing/reconstructing a crime scene for investigative purposes, including: total stations; laser scanners; panoramic images; and photogrammetry. Course topics range from basic measurement theory and statistics, to legal considerations such as admissibility and preparing courtroom-ready visualizations. Students will learn to use forensic mapping software to create courtroom-ready graphics.", "prerequisites": {"and": [], "or": ["FSC300H5", "FSC303H5"]}}, {"name": "FSC407H5 • Forensic Identification Field School", "description": "A field course to complement the material covered in bothFSC300H5, Forensic Identification &FSC302H5, Advanced Forensic Identification. The field school will be held on the U of T Mississauga Campus over a 2-week period during the summer term and during weekly two hour labs in the fall term. In these classes, students will experience practical exposure to field and laboratory methods related to evidence recognition, collection and interpretation. Emphasis will be placed on the types of evidence collected, processed, and analyzed by forensic identification specialists. General evidence and small object photography techniques will be an important component of the course.Course Application is required. See the Forensic Science Program website for details.", "prerequisites": "(FSC239Y5 and FSC302H5) or Permission of Instructor. Students seeking to use FSC407H5 as their capstone placement: FSC302H5 and FSC340H5 and (ANT407H5 or BIO259H5 or FSC341H5 or STA215H5 or STA220H5 or PSY201H5) and enrolment in a Forensic Science Specialist Program and Permission of Instructor. Course Application is required. See the Forensic Science Program website for details."}, {"name": "FSC415H5 • Advanced Methods in Forensic Biology", "description": "This advanced course explores the methodologies and data interpretation of forensic DNA typing, and other forensic biology techniques. The course will cover the principles, protocols, and current practices in an effort to understand the “what”, “how” and “why” of DNA analysis in a forensic context. Students will also learn about new and future trends in the field of forensic DNA typing, where discussion and evaluation of the primary literature is a key component of this course. Practical sessions will focus on the advanced techniques discussed in lecture.", "prerequisites": "FSC315H5"}, {"name": "FSC416H5 • Population Genetics", "description": "This course introduces students to the genetic variation between and within populations. The topics include evolutionary forces, quantitative genetics, and Baysian statistics as it applies to forensic biology.", "prerequisites": {"and": [{"and": [], "or": ["ANT202H5", "BIO207H5"]}, "BIO259H5", "FSC315H5"], "or": []}}, {"name": "FSC420H5 • Field and Lab Methods in Forensic Psychology", "description": "This course introduces students to field practices and research procedures in Forensic Psychology. The topics in field practice may include, but are not limited to: administrating risk assessment; conducting semi-structured patient interviews; fitness to stand trial assessment; mental health diagnostics; psychological profiling in criminal investigation; administering patient records; trial preparation. The tasks related to research procedures may include, but are not limited to: research literature searches and citation management; writing ethics proposals; data collection, annotation, analysis, and storage; writing abstracts, critical analysis, and methods; writing peer-review responses; formalizing and executing research theory, hypotheses and design.", "prerequisites": {"and": ["FSC220H5", "PSY344H5"], "or": []}}, {"name": "FSC430H5 • Seminar in Forensic Science", "description": "As a capstone course,FSC430H5is intended to apply the unique interdisciplinary perspectives acquired by students enrolled in the Forensic Science Minor. This course will address key themes in forensics, and culminate in a collaborative course project, informed and shaped by these perspectives. Students can expect to work in partnerships, groups, or teams to investigate and discuss major issues, hot topics, historical events or growing bodies of knowledge that contribute to a broader understanding of forensic science and how it is relevant across many, if not all disciplines.Restricted to students enrolled in the Forensic Science Minor.", "prerequisites": "FSC360H5"}, {"name": "FSC439H5 • Forensic Anthropology Case Analysis", "description": "This course offers a case-based approach to forensic anthropology. Students will critically evaluate real forensic anthropological cases, in addition to completing their own mock cases - from the transfer of evidence to a mock trial.", "prerequisites": "ANT439H5"}, {"name": "FSC481Y5 • Internship in Forensic Science", "description": "As the capstone experience for the Forensic Science Specialist Programs, this course provides students with professional practice and research experience. Students are required to attend classes that address proper research design and methodology, as well as issues of professional practice in the forensic sciences including: ethics; research protocols; written and verbal communication skills; professional communication (interviews, letters, emails, reports, presentations, and publications); and expert witness testimony. Students will also be placed with a participating forensic agency to conduct research and gain an understanding of the unit's daily operations. In addition to practice presentations, critiques, an ethics approval application, a 10-15 page research proposal, and a mock interview, students are required to formally present the results of their research at the annual Forensic Science Day symposium and submit a publication quality manuscript of their work.Note: Internship Placements are arranged by the FSC Program. Students MUST apply for this course and the Course Application is due in the February preceding the placement. See the Forensic Science Program website for details on course application, information, and procedures. There will be an information session regarding Internship Placements, preceding the application period. Students must have one free day (Monday - Friday) to work at their internship placement site and must be in the final year before graduation. Students are expected to provide their own transportation to placement work site.", "prerequisites": "FSC340H5 and (ANT407H5 or BIO259H5 or FSC341H5 or STA215H5 or STA220H5 or PSY201H5) and Enrolment in a Forensic Science Specialist Program and Permission of Instructor. Students seeking an IDENT capstone placement must also have completed FSC302H5. Course application is required. See the Forensic Science Program website for details."}, {"name": "FSC482H5 • Professional Practice in Forensic Science", "description": "This course will address practical considerations of professional practice, including professional writing, ethics in research, interviews, mock trial, and journal publication. Students MUST apply for this course. Course Application & Procedures:https://www.utm.utoronto.ca/forensic/applications", "prerequisites": "Enrolment in a Forensic Science Specialist Program and completion of the forensic program statistics course(s) requirement and any third level IDENT course and permission of instructor."}, {"name": "FSC483H5 • Collaborative Research Internship", "description": "As the alternative capstone experience, this course provides students the opportunity to work in a cross-disciplinary collaborative environment to address case-based research questions.Note: Topics will be made available at the time of application. Students MUST apply for this course and the course application is due in the February preceding the internship. See the Forensic Science Program website for details on course application, information and procedures. There will be an information session regarding this course, preceding the application period. Students must have one free day (Monday - Friday) to work on their collaborative research internship and must be in the final year before graduation.", "prerequisites": " FSC340H5 and (ANT407H5 or BIO259H5 or FSC341H5 or STA215H5 or STA220H5 or PSY201H5) and Enrolment in a Forensic Science Specialist Program and Permission of Instructor. Students seeking 'crime scene' related research must have completed FSC302H5 or FSC303H5. Course application is required. See the Forensic Science Program website for details. "}, {"name": "FSC484H5 • Communicating Forensic Science", "description": "As a pre-professional training experience, this capstone course will prepare students in media literacy for communicating their forensic sub-discipline in a variety of avenues. Students will learn how to present forensic content through writing, digital media (podcasts, vlogs, etc.), interviews, and outreach engagement. The course will develop skills as they pertain to converting complex science to accessible testimony, both for public and academic/educational settings, as well as handling/engaging with journalism media.Elements of course completion will include commitments external to class time, including, but not limited to: Forensic Skills Development workshops, HMALC workshops, RGASC workshops, and Forensic Outreach programming, all in conjunction with lecture components. Students are required to complete a minimum of 20 hours of communication experience outside of scheduled class time.Major assignments will include presentations through various media of the student's choice, as well as a cumulative interviews with police forensic science and professionals.Course application is required. See the Forensic Science Program website for details.", "prerequisites": "FSC340H5 and (ANT407H5 or BIO259H5 or FSC341H5 or STA215H5 or STA220H5 or PSY201H5) and Enrolment in a Forensic Science Specialist Program and Permission of Instructor. Course application is required. See the Forensic Science Program website for details."}, {"name": "FSC485H5 • Professional Opportunity in Forensic Science", "description": "This course provides students with the opportunity to engage in, and reflect on, a professional forensic experience that contributes to their employment eligibility after graduation. They will develop networking skills, enhance professional competencies, and are given the opportunity to locate and select their own experience relevant to their career goals, which may include (but is not limited to) a possible: work-study position, conference workshop, professional certification, field school, paid or unpaid internship or agency co-op. All opportunities must be approved by the program director in the term prior to enrolment.Course application is required. See the Forensic Science Program website for details.", "prerequisites": " FSC340H5 and (ANT407H5 or BIO259H5 or FSC341H5 or STA215H5 or STA220H5 or PSY201H5) and Enrolment in a Forensic Science Specialist Program and Permission of the Instructor. Students seeking 'crime scene' related experiences must have completed FSC302H5 or FSC303H5.  Course application is required. See the Forensic Science Program website for details."}, {"name": "FSC489H5 • Advanced Independent Project", "description": "For students wishing to complete original research, a feasibility study, critical review of the literature or position paper leading towards a publishable report.", "prerequisites": "Permission of Program Director."}, {"name": "FSC489Y5 • Advanced Independent Project", "description": "For students wishing to complete an extended research project across the Fall and Winter terms. Students are responsible for identifying a supervisor, after which they must seek Program Director approval.", "prerequisites": "Permission of Program Director."}, {"name": "HSC403H5 • Visualization of Forensic Demonstrative Evidence", "description": "This course examines the visual representation of forensic demonstrative evidence in Canadian courtrooms. A case-based approach simulates professional practice. Forensic anthropology, biology and visual communication theory are explored in new media for presentation. Visual problem solving skills are developed through collaboration. In class, presentations and practica are combined with critical analysis of visualizations.", "prerequisites": "10.0 credits, including ANT205H5 or ANT306H5 or (BIO208H5 and BIO209H5) or BIO210Y5 or FSC239Y5"}, {"name": "HSC405H5 • Digital Forensic Facial Approximation", "description": "This course examines the technical, anatomical, and sociological considerations involved in the three-dimensional digital forensic facial approximation. Human facial anatomy, traditional reconstruction techniques, and the use of 3D animation software are the core areas of study. Using this knowledge, students reconstruct the facial identity of an individual known only from cranial skeletal remains.", "prerequisites": "(HSC200H5 and one of the following courses: HSC300H5 or HSC301H5 or HSC302H5 or HSC307H5) or permission of instructor"}]