[{"name": "FRE180H5 • French Language Skills and Learning Strategies for University Study", "description": "This course provides students with a solid grounding in the French language skills and language learning strategies required for successful completion of a French Major or Specialist program. Students will discover vocabulary and grammatical structures in a variety of authentic written and spoken texts, connect form to meaning, participate in spoken and written interactions, and complete tasks on topics centered on student life in Montreal.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FSL206H5 or as determined by the department's French Placement Test. All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time."}, {"name": "FRE181H5 • Introduction to French Studies", "description": "This course provides an introduction to French studies with a focus on expanding students’ French language proficiency. It also introduces basic notions in French linguistics, literary & cultural studies, and language teaching & learning. Students will practice processing authentic texts in a variety of written and spoken formats through the guided discovery of new vocabulary and through the consolidation of grammatical structures. They will learn to connect form to meaning and to develop their spoken and written skills via an investigation of global French-speaking cultures.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FRE180H5 or the equivalent as determined by the department's French Placement Test. All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time."}, {"name": "FRE227H5 • Teaching and Learning a Second/Foreign Language", "description": "This course provides an introduction to second language pedagogy with a particular focus on French. Students will learn key concepts in pedagogy and compare the teaching and learning processes and experiences of first and second language learners as well as the roles of classroom teachers and learners via the creation of linguistic portraits and pedagogical materials.", "prerequisites": {"and": [], "or": ["FRE181H5", "FSL305Y5", "FSL306H5"]}}, {"name": "FRE240H5 • Interpreting French Narratives", "description": "This courseprovides an introduction toFrench& Francophoneliterary and cultural studies,providingstudentswitha set of interpretive toolsthatthey can use to analyzenarrativetexts and movies in French classes and beyond.Particular emphasiswill beplacedon developing attentive and critical reading skills about and throughnarrativetexts and movies, and on deploying these skills accurately in written and oral productions and discussions.", "prerequisites": {"and": [], "or": ["FRE181H5", "FSL306H5"]}}, {"name": "FRE272H5 • A Linguistic Introduction to the French Language", "description": "This course provides a linguistic introduction to the French language and French-language phenomena. Students will learn to analyze meaning, word, sound, and sentence structure; describe linguistic phenomena including first and second language acquisition, bilingualism, and creoles; and identify the linguistic variation observed among French speakers and speech communities.", "prerequisites": {"and": [], "or": ["FRE181H5", "FSL306H5"]}}, {"name": "FRE280Y5 • Language Practice: Written", "description": "This course develops writing skills at an intermediate level in the areas of vocabulary, grammar and style. Emphasis will be put on practice and error correction.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FRE181H5 or equivalent as determined by the department's French Placement Test. All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time."}, {"name": "FRE282H5 • Intermediate Language Practice: Written French", "description": "This course develops writing skills at an intermediate level in the areas of vocabulary, grammar, and style. Students will acquire practical tools for understanding and producing French written texts for their university studies and beyond. Emphasis will be placed on developing descriptive, narrative, and argumentative writing skills. All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FRE181H5 or FSL305Y5 or FSL306H5 or as determined by the department's French Placement Test. All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time."}, {"name": "FRE283H5 • Intermediate Language Practice: Spoken French", "description": "This course provides students with intensive practice in listening and spoken French at the intermediate level. Students will acquire the skills and vocabulary necessary for daily conversations and understanding of Francophone culture through exposure to various media and authentic documents such as songs, storytelling, videos, games, and interviews and other media. Particular attention is paid to spontaneous speech, formal and informal interactions, as well as presentation skills. All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FRE181H5 or FSL305Y5 or FSL306H5 or the equivalent as determined by the department's French Placement Test (https://frenchpt.utm.utoronto.ca/)."}, {"name": "FRE299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "FRE181H5 or FSL305Y5 or FSL306H5 or the equivalent as determined by the department's French Placement Test (https://frenchpt.utm.utoronto.ca/)."}, {"name": "FRE312H5 • Modernity, Tradition, and Resistance in Quebec Literature", "description": "This course explores the tension between modernity and tradition in a range of fiction and non-fiction written in Quebec from the 19thcentury to the present day. Students will apply previous knowledge in literature, and their oral and written competences in French to the study of multiple literary genres including the novel, short story, essay and journalistic texts. Particular emphasis will be placed on extending attentive reading skills as ways of reflecting on texts and their relationship to gender, freedom, identity, space and history.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE316H5 • Comedy and Tragedy in Quebec Theatre", "description": "This course explores topics in Quebec theatre, from the 19thcentury to the present day. Studentswillapply previous knowledge in literature, andtheiroral and written competences in French to the study of a variety of plays.Particular emphasiswill beplacedon extending attentive reading skills as ways ofreflecting ondramatic texts and their relationship to space, language,and society.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5."}, {"name": "FRE325H5 • Talking like a child: language acquisition of French", "description": "We might not remember how we learned our first language(s)but we knowit/them so well…Or do we? We take the child’sperspective inlanguagelearning, focusingonthe following topics: the acquisition of grammar, the development of communicative skills,the development of a language in a multilingual environment (as a majority language versusa heritage language),the differences and similarities between simultaneous and successive language acquisition.", "prerequisites": "((FRE272H5 or FRE272Y5) and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE342H5 • History of Quebec and French Canada", "description": "This course examines the history of French Canada, focusing in particular on the period from the 1830s to the present. It explores questions of culture, political community, language, and geography, looking to these aspects of historical experience to situate Quebec and French Canada with respect to North America's English-speaking majority as well as to the French-speaking nations of Europe, Africa, and elsewhere in the Americas. The course is taught in English but students will work with French-language material and will be required to write all tests and assignments in French. This course is taught in conjunction withHIS342H5.", "prerequisites": "FRE280Y5 or (FRE282H5 and FRE283H5) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE343H5 • Indigenous Literatures in Quebec and Francophone Canada", "description": "The course explores Indigenous literatures in Francophone Canada including Indigenous texts and authors from Quebec. The works discussed engage with issues of sovereignty, anti-racism, Native identity and gender, and span multiple genres including fiction, theatre, poetry and essay.", "prerequisites": "[FRE240Y5 or (FRE240H5 and FRE241H5)] and (FRE280Y5 or a minimum grade of 77% in FSL406H5)"}, {"name": "FRE352H5 • Teaching French Grammar", "description": "This course examines practical and theoretical issues surrounding grammar in the language curriculum such as various approaches to the implementation of grammar in language curricula, such as in grammar-translation or task-based learning; the role and limitations of descriptive grammar, including pedagogical grammar; form focus versus meaning focus; interference and error analysis; feedback on errors. Students will be asked to critique and create teaching materials.", "prerequisites": "(FRE227H5 and (FRE272H5 or FRE272Y5) and [FRE280Y or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE354H5 • Teaching French in a Plurilingual Context", "description": "This course allows students to explore innovative pedagogical approaches such as the Action Oriented and Plurilingual & Pluricultural Approaches, building on knowledge and skills acquired inFRE227H5Teaching and Learning a Second/Foreign Language. This is accomplished through the examination of the linguistic and cultural diversity observed in French Language classes today, and the discovery of innovative and current teaching approaches followed by the creation of pedagogical materials. Particular emphasis is placed on students’ abilities to transfer knowledge into practice.", "prerequisites": {"and": [], "or": ["FRE227H5", "FRE272Y5"]}}, {"name": "FRE355H5 • Psycholinguistics: multilingual learners in action", "description": "This courseprovides an introduction toreal-time language interaction in multilingual comprehension and production. A primary focus will be on language development, spoken and written language processing, the organisation of multilingual memory, and the main experimental methods in psycholinguistics.", "prerequisites": "((FRE272H5 or FRE272Y5) and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE356H5 • Versailles and the Classical Age", "description": "This course explores topics in 17th century French culture and Versailles as the expression of the major cultural achievements of this period. Students will apply their oral and written competences in French to the study of a variety of texts, art forms, and media. Particular emphasis will be placed on extending attentive interpretive skills as ways to reflect on the development of 17th century classical taste and its relationship to its political, social, and artistic context.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE363H5 • Love and Pain in French Literature", "description": "This course explores the tension between love and pain in a range of French literary works from 1800 to the contemporary era.Students will apply their previous knowledge in literature, and oral and written competences in French, to the study of multiple autobiographical and literary genres. Particular emphasis will be placed on extending attentive reading skills as ways of reflecting on first- and third-person writing and its relationship to love, social context and expectations, and gender.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE364H5 • Society through the French Novel", "description": "This course explores the representation of social issues in French literature, from the 19thcentury to the contemporary era. Students will apply previous knowledge in literature, and their oral and written competences in French to the study ofsocial exclusion and marginality, class consciousness, and social identities as literary themes. Particular emphasis will be on extending attentive reading skills as ways of thinking about storytelling and its relationship to character, the interplay between documentary and fictional genres, and commitment through authorship.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE367H5 • French Fiction of the 20th Century", "description": "This course allows students to exploreFrench fiction of the 20thCentury. Students apply previous knowledge in literature and cultural studies, andtheiroral and written competences in French to the study of works.Particular emphasiswill beplacedon extending attentive reading skills as ways ofreflecting onmemory and the telling of war experiences,the lives of women, andcrime and guilt in the French context.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE369H5 • The French Novel Today", "description": "This course explores contemporary French literature. Students will apply previous knowledge in literature, and their oral and written competences in French to the study ofkey trends in contemporary fiction and autobiography. Particular emphasis will be placed on extending attentive reading skills as ways of reflecting on storytelling and its relationship to critical social commentary, the creative power of language, and testimony.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE370H5 • Voices from No-Man's Land: Diaspora Writings in the 21st Century Francophone Literature", "description": "Contemporary literature written in the French language offers a rich and fertile ground for writers of various origins, cultures and languages who are united by several common factors: exile, immigration, transculturation, identity and alterity, and relationship with French, among others. This course explores these topics while relating them to literary and cultural contexts as well as students' real life through extensive reading and analysis of ultra contemporary novels and short stories by authors such as Dany Laferrière, Ying Chen, Aki Shimazaki, Kim Thúy, Marco Micone, Abla Farhoud, Sergio Kokis, Agota Kristof, Dai Sijie, or Nancy Huston.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE376H5 • French Phonology and Phonetics", "description": "A study of the phonological system of modern French based on actual samples of speech taken from different regional varieties and socio-economic groups.", "prerequisites": "((FRE272H5 or FRE272Y5) and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE377H5 • Phonetics & Phonology of French Foreign Accent", "description": "This course explores the phonetic and phonological properties of second language French learners' speech. Particular emphasis is placed on students' ability to summarize typical characteristics and phenomena of second language speech learning, identify segmental and prosodic features of non-native French including inter-learner variability, and conduct acoustic analyses of real learner speech.", "prerequisites": "((FRE272H5 or FRE272Y5) and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE378H5 • French syntax and the multilingual speaker", "description": "This course explores the sentential structure of French through the lens oflanguage learners.The focus is first and foremost on thelearning of French grammar including relative clauses, negation, pronominals and the agreement system.", "prerequisites": "((FRE272H5 or FRE272Y5) and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE380H5 • Plurilingual Theatre : Developing Writing and Oral Skills in French", "description": "The use of drama or theatre-based activities is a proven way to motivate and support learners in a foreign language classroom. Through observation, active participation, and reflection on the processes involved when learning French language and culture, students will use their knowledge of French, and other languages, to enhance communicative skills through drama (ranging from improvisation to full-length plays).", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE382H5 • Advanced Language Practice: Written French", "description": "This course develops writing skills at an advanced level in the areas of vocabulary, grammar and style. Emphasis will be put on practice and error correction.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FRE282H5 or a minimum grade of 77% in FSL406H5 or the equivalent as determined by the department's French Language Placement Test (https://frenchpt.utm.utoronto.ca/)."}, {"name": "FRE383H5 • Advanced Language Practice: Spoken French", "description": "This course provides students with intensive practice in listening and spoken French at the advanced level. Students will acquire competences and vocabulary necessary for authentic academic and professional settings. Formal and informal interactions, projects and tasks are designed to enhance various types of oral communication skills.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": {"and": [], "or": ["FRE283H5", "FSL406H5"]}}, {"name": "FRE384H5 • Second Language Acquisition of French", "description": "This course examines the lexical, phonetico-phonological, (morpho)syntactic, and sociolinguistic competence of second language learners of French. Students will come to understand the acquisition of these competences with respect to major themes including input and output quantity & quality, crosslinguistic influences, developmental sequences, individual differences, and the effects of training and classroom instruction. Particular emphasis is placed on students’ ability to analyze learner data.", "prerequisites": "[FRE225Y or FRE227H or FRE272H5 or FRE272Y5] and [FRE280Y5 or (FRE282H5 and FRE283H5) or a minimum grade of 77% in FSL406H5]."}, {"name": "FRE385H5 • Decoding French Language Games", "description": "This course explores the phonological properties of French language games such as Verlan and Loucherbem. Adopting a comparative approach with standard French, particular emphasis will be placed on students' ability to identify and model phonological patterns of segmental and syllable structure modification using both descriptive and theoretical phonological tools.", "prerequisites": "(FRE272H5 or FRE272Y5) and [FRE280Y5 or (FRE282H5 and FRE283H5) or a minimum grade of 77% in FSL406H5]"}, {"name": "FRE386H5 • French Semantics", "description": "Various approaches to the notion of meaning; its functioning at all levels of representation.", "prerequisites": "[(FRE272H5 or FRE272Y5) and (FRE282H5 and FRE283H5)] or a minimum grade of 77% in FSL406H5 or equivalent."}, {"name": "FRE387H5 • French Morphology", "description": "A study of the morphological system of modern French, its relationship to syntax and phonology; theoretical notions derived from the analysis of specific data. Special attention will be given to the methods of analysis and classification, as well as selected morphological categories (verbs, nouns, etc.).", "prerequisites": "[(FRE272H5 or FRE272Y5) and (FRE282H5 and FRE283H5)] or a minimum grade of 77% in FSL406H5 or equivalent."}, {"name": "FRE389H5 • Individual Differences in Second Language Acquisition", "description": "This course examines the effects of cognitive (e.g., aptitude, working memory) and affective differences (e.g., motivation, L2 anxiety) on second language acquisition. Students will come to understand the nature of these differences via empirical studies on learners of French and the use of assessment instruments including questionnaires and on-line tests. Particular emphasis is placed on students' ability to discuss between-learner differences in comprehension and production, identify relevant individual differences capable of explaining such variability, and conduct their own individual differences research.", "prerequisites": "(FRE225Y5/FRE227H5 or FRE272H5/FRE272Y5) and [FRE280Y5 or (FRE282H5 and FRE283H5) or a minimum grade of 77% in FSL406H5]"}, {"name": "FRE391H5 • Women and LGBTQ+ Writers and Filmmakers of the Francophone World", "description": "This courseinvitesstudents to explore women and LGBTQ+ writers and filmmakers from France and the Francophone world. Studentswillapplytheirprevious knowledge in literature and cultural studies, andtheiroral and written competences in French to the study of works by French, Quebecois, Caribbean and African authors and directors.Particular emphasiswill beplacedon extending attentive reading skills as ways of thinking about gender representation, feminism,and identity in fiction, non-fiction,and films.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE393H5 • French Society through Film", "description": "This course explores the representation of social issues in French cinema, from the Sixties to the contemporary era. Students will develop knowledge in cultural studies, and their oral and written competences in French, through the study ofsocial exclusion and marginality, class conflict, and social identities as cinematographic themes. Particular emphasis will be placed on extending attentive interpretive skills as ways of reflecting on storytelling and its relationship to the cinematic medium, the interplay between documentary and fictional genres, and authorship.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE395H5 • Francophone Media and Global Culture", "description": "This course explores media and culture in the Francophone world through textual, graphic, musical and cinematographic content. Students will apply previously acquired knowledge in cultural studies, and their oral and written competences in French to the study of multiple cultural and mediatic forms including movies, graphic novels and songs. Particular emphasis will be placed on extending attentive reading skills as ways of thinking about texts, images and music, and on deploying these skills to better understand the relationship between different Francophone cultures within our contemporary world.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE397H5 • Francophone African and Caribbean Cinema", "description": "This courseprovidesan introduction toFrancophone African and Caribbean cinema studies, tracing its origins and emergence to the present day. Studentswillapply previous knowledge in cultural studies, andtheiroral and written competences in French to the study of works by North-African, Sub-Saharan African, and Caribbean male and female directors.Particular emphasiswill beplacedon extending attentive reading skills as ways of thinking about colonialism, gender, space,and identity in narrative movies and documentaries.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE398H5 • The Culture of Paris", "description": "This course explores the city of Paris as it developed into a cultural beacon of excellence in French culture throughout the 19th and 20th centuries. Students will expand and apply previous knowledge in cultural studies, and their oral and written competences in French, to the study of the events that have shaped the Paris of today. Particular emphasis will be placed on extending attentive interpretive skills to the impact of historical events, city planning and promotion, and artistic celebration, and on deploying these skills to think critically about heritage in the French context.As part of this course, students have the option of participating in an international learning experience that will have an additional cost and application process.", "prerequisites": "(FRE240H5 and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE399H5 • Research Opportunity Program", "description": "This course provides senior undergraduate students who have developed some knowledge of research methods used in the discipline of French studies to work in the research project of a U of T Mississauga professor for course credit. Enrolled students have the opportunity to become involved in original research, develop their research skills, and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer and fall/winter sessions are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": {"and": [{"and": [], "or": ["FRE227H5", "FRE240H5", "FRE272H5"]}, "FRE282H5", "FRE283H5"], "or": []}}, {"name": "FRE399Y5 • Research Opportunity Program", "description": "This course provides senior undergraduate students who have developed some knowledge of research methods used in the discipline of French studies to work in the research project of a U of T Mississauga professor for course credit. Enrolled students have the opportunity to become involved in original research, develop their research skills, and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer and fall/winter sessions are posted on the ROP website in mid-February and students are invited to apply at that time. See Experiential and International Opportunities for more details.", "prerequisites": {"and": ["FRE227H5", {"and": [], "or": ["FRE240H5", "FRE272H5"]}], "or": []}}, {"name": "FRE400H5 • French Studies Internship", "description": "Students enrolled in a French Studies program of study will have the opportunity, through work placement, to apply the knowledge and expertise gained throughout their studies in French. The work placement will take place in corporations, local media or community organizations. Application deadline is February 28th. Students will be required to include a letter of interest highlighting their qualifications as suitable candidates for an internship opportunity. Applicants who meet minimum criteria (must be in 4th year of studies, number of courses completed in FRE and CGPA) will be selected for an interview. Final decisions will be based on a combination of academic qualifications, experience, and the interview.", "prerequisites": "FRE382H5 and FRE383H5 and an additional 1.0 credit at the 300 level in FRE"}, {"name": "FRE440H5 • Francophone Periodical Studies", "description": "This advanced research course provides students a theoretical and practical background in periodical studies, exploring the interaction of literature and journalism from the beginning of the 19thcentury to the present day in France and Quebec. Students work under the supervision of the instructor to prepare, collect, and analyze data from periodicals, newspapers and magazines, and to present findings in the form of a research report.", "prerequisites": "1.0 credit from among 300-level French and Francophone Literary & Cultural studies courses category."}, {"name": "FRE442H5 • Advanced Language Practice IV: Written", "description": "Consolidation of writing skills in the areas of vocabulary, grammar and style. This writing intensive course focuses on improving persuasiveness in writing, in part by reading and analyzing a variety of texts to learn to recognize strategies that work in written communications.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FRE382H5 or permission of the instructor. Also open to francophones and/or holders of the French or international baccalauéat but contingent on the results of the Online French language placement test (https://frenchpt.utm.utoronto.ca/)."}, {"name": "FRE445H5 • Special Topics in French & Francophone Literary and Cultural Studies I", "description": "A study of fiction, non-fiction or theoretical approaches in French and Francophone literature and culture.", "prerequisites": "(0.5 credit at the 300-level from the French & Francophone Literary and Cultural Studies category) and (0.5 credit of FRE at the 300-level, determined annually contingent on course content)"}, {"name": "FRE446H5 • Special Topics in Literature II", "description": "A study of fiction, non-fiction or theoretical approaches inFrench&Francophone literature and culture.", "prerequisites": "(0.5 credit from the 300-level French and Francophone Literary & Cultural Studies category) and (0.5 credit of FRE at the 300-level, determined annually contingent on course content)"}, {"name": "FRE453H5 • Teaching French Culture", "description": "This advanced research course deepens students’ theoretical and practical background in language pedagogy, exploring research questions related to issues surrounding the integration of culture in the language curriculum including the relationship between authentic language and culture, and the role of linguistic and cultural diversity in education. Students will learn to critique and create teaching materials and undertake an independent research project.", "prerequisites": "FRE354H5 and 0.5 credit at the 300-level from among the FRE Language Teaching and Learning courses."}, {"name": "FRE482H5 • Creative Writing", "description": "This course allows students to develop their French writing skills with a variety of short imaginative and first-person genres. Students will extend their knowledge of language creativity and written competences in French to the production of a range of creative texts based on examples and using generative techniques. Particular emphasis will be placed on developing precision and a diversity of expressive skills, especially varied vocabulary and standard idiomatic turns.", "prerequisites": "FRE382H5"}, {"name": "FRE487H5 • Advanced Topics in Experimental French Linguistics", "description": "An advanced study (or in-depth examination) of a specific topic in experimental French linguistics. Content in any given year depends on the instructor. Contact the department for details.", "prerequisites": "0.5 credit from the French Linguistics category plus 0.5 FRE 300-level credit determined annually contingent on course content."}, {"name": "FRE488H5 •  Advanced Topics in Theoretical French Linguistics", "description": "An advanced study (or in-depth examination) of a specific topic in theoretical French linguistics. Content in any given year depends on the instructor. Contact the department for details.", "prerequisites": "0.5 credit from the French Linguistics category plus 0.5 FRE 300-level credit determined annually contingent on course content."}, {"name": "FRE489H5 • The Structure of the Syllable in Romance Languages", "description": "A comparative approach to the study of various phonological processes of contemporary Romance languages. Current issues on the representation of syllable structure and problems of syllabification in reference to phenomena such as liaison, elision, definite and indefinite article selection et cetera.", "prerequisites": "FRE376H5 and FRE377H5 and (FRE385H5 or LIN229H5) and any 0.5 credit of FRE Linguistics or LIN at the 300-level"}, {"name": "FRE490Y5 • Senior Essay", "description": "An independent research paper on either a literary or linguistic topic to be proposed by the student and supervised by an instructor, culminating in a major research paper. For Specialists who wish to fulfill the requirements for their fourth year Literature courses. A maximum of 1.0 credit can be taken in both Senior Essay (FRE490Y5) and Independent Study (FRE491H5,FRE492H5)", "prerequisites": "1.0 credit of FRE at the 300-level relevant to the topic of study"}, {"name": "FRE491H5 • Independent Study", "description": "A scholarly project supervised by a Faculty member on a literary or linguistic topic of common interest, including readings, discussions and papers.", "prerequisites": "1.0 credit of FRE at the 300-level relevant to the topic of study"}, {"name": "FRE492H5 • Independent Study", "description": "A scholarly project supervised by a Faculty member on a literary or linguistic topic of common interest, including readings, discussions and papers.", "prerequisites": "1.0 credit of FRE at the 300-level relevant to the topic of study"}, {"name": "FSL105H5 • Functional French-Novice", "description": "The objective of this course, which serves as a starting point in our series of FSL courses, is to introduce students to the phonetic system of the French language, to teach basic vocabulary and to develop awareness of the functions of language in different situations and contexts. An awareness of various francophone cultures and communities will be developed.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time."}, {"name": "FSL106H5 • Functional French-Advanced Beginner", "description": "Through the use of teaching materials adapted to their level, students will continue to develop their linguistics abilities and to use them in specific situations. For instance, students will learn how to ask for information, how to refuse or accept an offer. On completion of this course, a linguistic system of basic but useful structures will have been assimilated. An awareness of various francophone cultures and communities will be developed.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FSL105H5 or the equivalent as determined by the department's Placement Test.  Before enrolling in a French language course for the first time all students MUST complete the Placement Test (https://frenchpt.utm.utoronto.ca/)."}, {"name": "FSL205H5 • Functional French – Low Intermediate I", "description": "This course focuses on developing communication skills as well as furthering students’ fluency through the production and understanding of authentic messages, working on engaging tasks while using more diverse lexical forms and expressions. Students will participate in interpersonal interactions where they learn to express emotion and opinion using culturally appropriate expressions and greater vocabulary breadth. An awareness of various francophone cultures and communities will be developed.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FSL106H5 or the equivalent as determined by the department's French Placement Test (https://frenchpt.utm.utoronto.ca/)"}, {"name": "FSL206H5 • Functional French - Low Intermediate II", "description": "This course focuses on nuancing acquired written and oral communication skills and on further developing students’ fluency and accuracy through the production and understanding of complex sentences, refined forms and idiomatic expressions, and the further development of discourse-oriented abilities to create meaning.", "prerequisites": "FSL205H5 or the equivalent as determined by the department's French Placement Test."}, {"name": "FSL305H5 • Functional French - High Intermediate I", "description": "This course focuses on understanding information, comparing and reformulating types of discourse, developing more refined fluency and spontaneity in proficiently discussing current and cultural affairs and contentious topics, using different registers and tone in a broad range of situations and texts & media encountered in their academic experiences. Understanding various francophone cultures and communities will be part of the course discussion.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FSL206H5 or the equivalent as determined by the department’s French Placement Test (https://frenchpt.utm.utoronto.ca/)."}, {"name": "FSL306H5 • Functional French – High Intermediate II", "description": "This course focuses on analyzing and synthesizing information, comparing and evaluating diverse types of discourse, developing advanced fluency and spontaneity, accuracy and complexity in proficiently discussing and writing about current and cultural topics, using different registers and tone in a broad range of situations, texts & media. Understanding various francophone cultures and communities will be integrated in the course content and student learning experience.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FSL305H5 or the equivalent as determined by the department's French Placement Test (https://frenchpt.utm.utoronto.ca/)."}, {"name": "FSL405H5 • Functional French-Advanced I", "description": "Course will focus on developing both oral and written skills in the production and understanding of complex discourse (including organization, cohesion, nuanced lexical forms and expressions) in order to participate in varied, sustained and unscripted situations. An awareness of various francophone cultures and communities will be developed.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FSL306H5 or as determined by the department's Placement Test. All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time."}, {"name": "FSL406H5 • Functional French-Advanced II", "description": "Students will focus on developing both oral and written skills in the production and understanding of complex discourse (including organization, cohesion, nuanced lexical forms and expressions) in order to initiate and sustain varied and unscripted exchanges. An awareness of various francophone cultures and communities will be developed.All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca) before enrolling in ANY FSL or FRE language course for the FIRST time.", "prerequisites": "FSL405H5 or the equivalent as determined by the department's French Placement Test. All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time."}, {"name": "FSL466H5 • French for Business Communication", "description": "This project-based course advances practical uses of written and spoken French in business contexts. Activities and assignments are scaffolded to privilege deeper level of learning and simulate an authentic job search process in order to improve and strengthen reading comprehension, communication, writing and presentation skills that students can directly apply in the workplaces.", "prerequisites": "FSL405H5 or the equivalent as determined by the department's French Placement Test. All students are REQUIRED to complete the French Placement Test (https://frenchpt.utm.utoronto.ca/) before enrolling in ANY FSL or FRE language course for the FIRST time."}, {"name": "JFL369H5 • Romance Linguistics", "description": "Have you ever wondered how a single \"mother\" language can give rise to many different \"daughter\" languages? How do closely related languages come to be so different? What unique mix of historical events, social relationships, and language acquisition processes produces each variety?This course takes the Romance language family as a case study in language change within a well-documented language family, examining the major linguistic changes that occurred within the last 2500 years from every-day spoken Latin to the Modern Romance languages. We also consider micro-variations among both well-known and understudied Romance varieties with the aim of finding explanations involving both internal and external forces of change.No prior knowledge of Latin or a Romance language is necessary.For students in either a French Specialist or Major Programs wishing to count this course toward program requirements, must complete written work in French.", "prerequisites": {"and": [{"and": [], "or": ["LIN229H5", "FRE376H5", "FRE377H5"]}, {"and": [], "or": ["LIN232H5", "FRE378H5"]}], "or": []}}, {"name": "JFL388H5 • Bilingualism and Multiple Language Acquisition", "description": "This course examines simultaneous and successive second (and multiple) language acquisition. We will look at topics such as the bilingual brain, the nature of the input, age constraints on language acquisition, language separation and cross-linguistic influences, the status of the heritage language, schooling in a second language (for example French immersion programs), and various methods used in the study of bilingualism in individuals. Bilingual/multilingual corpora will be examined. The language of instruction will be English. Students will have the option to write assignments in either English or French. Written work to be completed in French for credit towards a Specialist (French) or Major (French).", "prerequisites": "[(LIN102H5 or FRE227H5 or FRE225Y5 or FRE272H5 or FRE272Y5) and 0.5 credit from LIN288H5 or LIN231H5 or LIN232H5 or LIN233H5] or 0.5 credit of FRE linguistic at the 300-level."}, {"name": "JFL389H5 • Second Language Assessment", "description": "This course provides an introduction to the principles and frameworks of second language assessment as well as to the practices of standardized testing and classroom assessment. We begin by discussing models of linguistic competence and frameworks for second language assessment as well as test design including language benchmarking. In the second part of the course, the focus turns to best practices in the assessment of vocabulary, grammar, comprehension, production, and socio-pragmatic competence.", "prerequisites": {"and": ["FRE272H5", {"and": [], "or": ["FRE282H5", "FRE283H5"]}], "or": []}}, {"name": "JFL454H5 • Teaching and Learning Varieties of Canadian French", "description": "(Offered in English) This course offers students the opportunity to become familiar with the primary research methods used in sociolinguistic studies, with how sociolinguistics helps to understand the properties of Canadian French, and with the pedagogical implications arising from sociolinguistic research on Canadian French. This course will contain a research-based component. Written work to be completed in French for credit towards a Specialist (French) or Major (French).", "prerequisites": "[(1.0 credit of FRE Linguistics at the 300-level or LIN256H5) and 0.5 credit of LIN at the 300-level and reading ability in French] or permission of instructor."}, {"name": "LTL380H5 • Theoretical Issues In Second Language Teaching and Learning", "description": "This course examines theoretical research on adult second language learning and the resultant implications for second language teaching. Topics include age, affect, communicative competence, and sociolinguistics. Links are drawn to pedagogical practices, including error correction, materials selection, and order and method of presentation. This course is taught in English and is open to students from other disciplines. Written work to be completed in French/Italian for credit towards a Specialist (French or Italian) or Major (French/Italian).", "prerequisites": "FRE227H5 and (FRE282H5 and FRE283H5) or (ITA200Y5 and an additional 0.5 credit in ITA at the 200-level or higher)."}, {"name": "LTL381H5 • Methodologies for Teaching English as a Second Language", "description": "This course provides an overview of classroom teaching methods, techniques and strategies for English as a second language, as well as ways of creating and adapting materials to particular teaching contexts such as English-as-a-second-language (ESL) in Canada, English for Academic Purposes (EAP), English for Specific Purposes (ESP), English-as-a-Foreign-Language (EFL) abroad, and blended teaching. Theoretical issues and classroom implications for teaching and learning with technology will be discussed. Classroom management techniques will also be examined, along with ways to access and work with classroom management and technology-related resources.", "prerequisites": "(LIN101H5 and LIN102H5 and a minimum of 0.5 credit in LIN or LTL at the 200-level or higher) or [(FRE282H5 and FRE283H5) and FRE227H5] or (ITA200Y5 and an additional 0.5 credit in ITA at the 200-level or higher)"}, {"name": "LTL382H5 • Teaching Second Language Speaking and Listening", "description": "This course examines theories and practices related to the teaching and learning of speaking and listening in a second language, particularly with reference to English. The course will focus on the theoretical and research-based underpinnings of second language speaking and listening on the ways in which instruction can facilitate the development of these skills. The relationship of pronunciation to listening and listening skills will be explored, and an overview of teaching pronunciation to second language learners will be provided (particularly with reference to English).", "prerequisites": "(LIN101H5 and LIN102H5 and a minimum of 0.5 credit in LIN or LTL at the 200-level or higher) or [(FRE282H5 and FRE283H5) and FRE227H5) or (ITA200Y5 and an additional 0.5 credit in ITA at the 200-level or higher)"}, {"name": "LTL383H5 • Teaching Second Language Reading and Writing", "description": "This course examines theories and practices related to the teaching and learning of reading and writing in a second language, particularly with reference to English. The course will focus on the theoretical and research-based underpinnings of second language reading and writing and on the ways in which instruction can facilitate the development of these skills. The relationship of vocabulary to second language reading and writing will be examined (particularly with reference to English).", "prerequisites": "(LIN101H5 and LIN102H5 and a minimum of 0.5 credit in LIN or LTL at the 200-level or higher) or [(FRE282H5 and FRE283H5) and FRE227H5] or (ITA200Y5 and an additional 0.5 credit in ITA at the 200-level or higher)"}, {"name": "LTL456H5 • Sociolinguistics and Second Language Teaching and Learning", "description": "This course considers the impact on variant use by second language learners exerted by linguistic and extra-linguistic factors, such as the surrounding linguistic context, age, sex, style, and curricular and extra-curricular exposure. Implications are drawn for second language teaching, including deciding what registers and variants to teach and what activities to employ. Written work to be completed in French/Italian for credit towards a Specialist (French or Italian) or Major (French/Italian).", "prerequisites": {"and": [{"and": [], "or": ["FRE225Y5", "FRE227H5"]}, {"and": [], "or": ["FRE280Y5", "FRE282H5"]}], "or": []}}, {"name": "LTL486H5 • Teaching and Learning Cross-Cultural Communication", "description": "This course examines cross-cultural language use by second language learners from both a theoretical and pedagogical perspective. Topics addressed include the role of pragmatic transfer between native and target languages, individual differences, learning context, and instruction in the development of second language pragmatic competence. Written work to be completed in French/Italian for credit towards a Specialist (French or Italian) or Major (French/Italian).", "prerequisites": {"and": [{"and": [], "or": ["FRE225Y5", "FRE227H5"]}, {"and": [], "or": ["FRE280Y5", "FRE282H5"]}], "or": []}}, {"name": "LTL487H5 • Second Language Pedagogy", "description": "This course offers a comprehensive survey and analysis of fundamental concepts and issues related to second, bilingual, and foreign language instruction by developing students' knowledge of second language acquisition, approaches to language teaching, computer-assisted teaching, and pedagogical design and implementation in the language classroom. Written work to be completed in French/Italian for credit towards a Specialist (French/Italian) or Major (French/Italian).", "prerequisites": {"and": [{"and": [], "or": ["FRE225Y5", "FRE227H5"]}, {"and": [], "or": ["FRE280Y5", "FRE282H5"]}], "or": []}}, {"name": "LTL488H5 • Principles and Strategies for Online Second Language Course Design", "description": "This course will conduct a critical appraisal of online course materials, and formulate appropriate pedagogical strategies for their exploitation. This course is taught in English and is open to students from other disciplines. Written work to be completed in French/Italian for credit towards a Specialist (French/Italian) or Major (French/Italian).", "prerequisites": {"and": [{"and": [], "or": ["FRE225Y5", "FRE227H5"]}, {"and": [], "or": ["FRE280Y5", "FRE282H5"]}], "or": []}}, {"name": "LTL495Y5 • Individual Project", "description": "A research or reading project undertaken by the student under the supervision of a faculty member. Written work to be completed in French/Italian for credit towards an LTL program in French or Italian.", "prerequisites": "0.5 credit at the 300 or 400 level in LTL"}, {"name": "LTL496H5 • Individual Project", "description": "A research or reading project undertaken by the student under the supervision of a faculty member. Written work to be completed in French/Italian for credit towards an LTL program in French or Italian.", "prerequisites": "0.5 credit at the 300- or 400-level in LTL"}]