[{"name": "GGR276H5 • Spatial Data Science I", "description": "Introduction to the study of geographical phenomena using descriptive and inferential statistics. Fundamentals of geographic data and statistical problem solving using non-spatial and spatial descriptive statistics. Decision making using evidence gathered from inferential statistical analysis. Graphical summary, geographic visualization and mapping of analytical results. Application of state of the art software for statistical analysis. Provides background for future studies in geographic information systems and advanced statistical analysis. The course strikes a balance between developing an understanding of core non-spatial and spatial statistical concepts, while demonstrating technical proficiency in the application of software to the study of geographical questions.", "prerequisites": "4.0 credits"}, {"name": "GGR278H5 • Geographical Information Systems", "description": "Introduction to models of representation and management of geographical data for scientific analysis. Basic quantitative methods and techniques for geographic data analysis, including collection, manipulation, description and interpretation. Practical exercises using GIS and statistical software packages with examples drawn from both physical and human geography.", "prerequisites": "4.0 credits"}, {"name": "GGR311H5 • Landscape Biogeography", "description": "A geographical, multi-scale perspective on the relationship between the physical landscape and the distribution, movement, dispersal, and abundance of select animal species. Landscape measures including (but not limited to) fragmentation indices, habitat metrics, and estimates of animal movement will be considered. Emphasis is placed on understanding the biology of the species being studied, the physical structure of the landscape, and the intricacies of various modeling software. Students should expect to develop a well-rounded set of skills in analyzing animal movement, and producing relevant and usable results towards the management of varied landscapes and the conservation of species.", "prerequisites": "9.0 credits"}, {"name": "GGR321H5 • Geographic Information Processing", "description": "Problem solving using geographic information systems (GIS). Essential distributed computing aspects of GIS are presented. Among topics covered are the use of logic in spatial analysis, line-of-sight analysis, route selection, site selection, and landscape analysis. Hands-on assignments are emphasized.", "prerequisites": "8.5 credits and GGR278H5"}, {"name": "GGR322H5 • GIS and Population Health", "description": "The purpose of this course will be to develop an appreciation for the conceptual and methodological intersections that exist between geographical information systems and population health. While population health can include incidence and prevalence of disease and ill-health, as well as concerns about service provision, this course will focus mainly on disease, injury, illness more broadly. The course will include both lectures, where foundational concepts will be introduced and related to practical lab sessions, where students will gain experience using GIS to map and study health information. Topics will include: spatial databases for population health, mapping health data, analyzing the spatial clustering of disease and/or injury, mapping and analyzing environmental and social risk factors.", "prerequisites": "(8.5 credits and GGR278H5) or permission of instructor"}, {"name": "GGR335H5 • Remote Sensing Applications", "description": "The purpose of this course is to familiarize students with the various ways in which remote sensing images have been used for environmental applications among the sectors of government, industry, and academia. A part of the course will be devoted to application projects employing remote sensing and spatial data analysis in natural resources and environmental assessments.", "prerequisites": "8.5 credits and (GGR276H5 or GGR278H5 or GGR337H5)"}, {"name": "GGR337H5 • Environmental Remote Sensing", "description": "This introductory course emphasizes mastering fundamental remote sensing concepts and utilizing remotely sensed data for monitoring land resources and environmental change. Topics include surface-energy interactions, sensor systems, image interpretation, and applications for examining soil, vegetation and water resources. Upon completion of this course, students should have the necessary knowledge and skills to pursue more advanced work in digital image processing and remote sensing applications.", "prerequisites": "9.0 credits"}, {"name": "GGR338H5 • Environmental Modeling", "description": "An application of environmental models to contemporary problems of decision-making. The course demonstrates the relevance of techniques of data management (statistics, computer systems) to issues facing Canada and the global community.", "prerequisites": "9.0 credits including GGR276H5"}, {"name": "GGR370H5 • The Geography of Transportation", "description": "Transportation is an integral aspect of our daily lives and plays a key role in shaping the economy and the environment. Through this course, students will explore the geography of transportation. Topics will include, mobility and accessibility, transportation networks and flows, Geographic Information Systems in Transport (GIS-T), planning and policy, environmental and human health impacts, and other current issues.", "prerequisites": "9.0 credits including GGR278H5"}, {"name": "GGR372H5 • Geographical Analysis of Land Resources", "description": "This course focuses on the nature of land resources information and its analysis. Emphasis is on use of geographic information systems to model and analyze a variety of land resources. Topics such as terrain analysis and interpolation will be covered.", "prerequisites": "9.0 credits including GGR278H5 or permission of instructor"}, {"name": "GGR376H5 • Spatial Data Science II", "description": "This course builds on quantitative methods introduced in GGR276, and aims to provide a broad study of advanced statistical methods and their use in a spatial context in physical, social, and environmental sciences. The course covers theories, methods, and applications geared towards helping students develop an understanding of the important theoretical concepts in spatial data analysis, and gain practical experience in application of spatial statistics to a variety of physical, social and environmental problems using advanced statistical software.", "prerequisites": "(9.0 credits including GGR276H5 or STA256H5) or permission of instructor"}, {"name": "GGR381H5 • Spatial Database", "description": "Students will gain basic knowledge of spatial database design, implementation, query, and sharing. Playing with real-world datasets, students will create, edit, and manage geospatial databases using a variety of commercial and open-source software such as ArcGIS and PostgreSQL.", "prerequisites": {"and": [], "or": ["GGR278H5", "CSC263H5"]}}, {"name": "GGR382H5 • Digital Mapping and Principles of Cartography", "description": "This course will cover foundational concepts in mapmaking (cartography) using geographical information systems (GIS). The course will also explore map rendering in the digital and mobile worlds where the power of geography and cartography are leveraged through development of location based services used increasingly in everyday life. Topics covered will include but are not limited to: coordinate systems and map projections, measurement and classification, making maps using GIS, critical appraisal of mapped information. The course will combine lectures with practical sessions where foundational concepts will be applied using GIS and related technologies and software.", "prerequisites": "9.0 credits including GGR278H5"}, {"name": "GGR437H5 • Cloud-based Image Analysis", "description": "This course builds on the fundamental remote sensing concepts, techniques, and applications introduced inGGR337H5, and aims to provide an advanced study of digital image processing and remote sensing applications. In specific, this course will use a cloud-based platform for large-scale analysis of satellite imagery, including mapping ground features, detecting changes, and identifying trends on the Earth's surface.", "prerequisites": "14.0 credits including GGR337H5 or permission of instructor"}, {"name": "GGR440H5 • Drone Remote Sensing", "description": "Industries from agriculture through to defense and mining are investing in Unmanned Aerial Vehicles (UAV) technology to support operational and strategic objectives. This course will cover the adoption of UAV technologies as a remote sensing tool and the impact of logistical, regulatory, and technical hurdles on UAV technology now and in the future. Through the course, students will gain the knowledge requirements to operate a UAV following Transport Canada guidelines and develop skills in processing UAV imagery into information assets that support applications where high resolution, spatial accuracy, and high detail is required.", "prerequisites": "14.0 credits including GGR337H5"}, {"name": "GGR442H5 • GIS Capstone Project", "description": "Students apply prerequisite knowledge and techniques to real-world GIS projects requested by external partners. Through background research, proposal, data management, and implementation, students develop GIS professional competencies, which will be demonstrated through collaboration, presentations and reports.", "prerequisites": "12.0 credits including (GGR276H5 or STA256H5) and GGR278H5 and (1.0 credit from GGR321H5 or GGR335H5 or GGR337H5 or GGR376H5 or GGR381H5 or GGR382H5 or GGR463H5) or permission of instructor."}, {"name": "GGR444H5 • Space Time Data Analysis", "description": "This course is designed for senior undergraduate students in a workshop format with a specific focus on application. Topics include space-time data collection, processing, analysis, and visualization. Widely used space-time analysis tools and newly developed data mining techniques will be introduced and discussed with examples and hands-on practices in the class. With practical experience on real-world space-time datasets, students will learn the basic knowledge and various tools for analyzing spatiotemporal datasets. The course encompasses practical instruction and training in ArcGIS Pro to use multiple public available space-time datasets. The primary outcome for students taking this course will be an independent analysis of a substantial space-time dataset, a formal report of the analysis, and a professional oral presentation.", "prerequisites": "13.5 credits and GGR321H5"}, {"name": "GGR463H5 • Geographic Information Analysis and Processing", "description": "This course focuses on the digital representation and analysis of geospatial phenomena using open source software. Class discussions cover the foundational methods, algorithms, and scripting languages used in GIS analysis, which are reinforced in lab using current, widely used open source software. The course is structured as a series of modules that culminate in a final project. Students are encouraged to incorporate individual areas of interest into class discussion and assignments. Successful students will broaden their GIS toolset, increasing the flexibility of their work.", "prerequisites": "14.0 credits including GGR321H5"}, {"name": "GGR494H5 • Special Topics in GIS", "description": "(FormerlyGGR394H5) Studies of selected topics in Geographic Information Systems not covered in regular courses. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "14.0 credits or permission of instructor"}]