[{"name": "GGR201H5 • Introduction to Geomorphology", "description": "This course provides an introduction to the principles and concepts of geomorphology, the study of the processes that shape the surface of the earth. The course adopts a process-oriented approach to the study of the variety of landforms found in the natural environment. Topics are mainly taken from a Canadian perspective and include energy flows through the land, weathering and erosion (fluvial, coastal, chemical, aeolian, and glacial), hillslope materials, drainage basin morphology, periglacial environments, and human modification of the landscape.", "prerequisites": {"and": [], "or": ["GGR112H5", "ENV100Y5"]}}, {"name": "GGR202H5 • Geography of Canada", "description": "This course will spotlight how Canada, as a nation, is constructed through historical and contemporary systems of inclusions and exclusions. Taking a geographic approach to Canada means taking a look at the social construction of ‘Canada’ through the politics and production of spaces. We will explore how landscape, borders, regions, territory, land, and environment are imagined, organized, contested and fought for by individuals and communities.", "prerequisites": "4.0 credits"}, {"name": "GGR207H5 • Cities, Urbanization and Development", "description": "This course will introduce students to urban social processes, urban form and urban history. A particular emphasis will be placed on global urbanization, internal spatial and social structure of cities, as well as past and contemporary urban problems.", "prerequisites": "4.0 credits"}, {"name": "GGR208H5 • Population Geography", "description": "This course examines the link between people and places from a global perspective. The course will cover topics related to population patterns and processes, geographic theories related to population and sustainability, as well as the tools used by geographers to study population size, composition and migration. This course fulfills 1 field day.", "prerequisites": "4.0 credits"}, {"name": "GGR209H5 • Economic Geography", "description": "An introduction to the interaction of the economic, social and political institutions that determine the quality of life in a particular place. Subjects covered range from economic efficiency and social equity to the location dynamics of value chains. The emphasis of the course is on Canadian examples.", "prerequisites": "4.0 credits"}, {"name": "GGR210H5 • Social Geographies", "description": "Social geography is concerned with the ways in which social relations, identities and inequalities are produced across space. This course examines social geography in the North American context with a specific focus on identity/difference and inequalities in cities. We will explore cities as sites of both cosmopolitan inclusion and exclusion.", "prerequisites": "4.0 credits"}, {"name": "GGR214H5 • Global Weather and Climate", "description": "The climates of the globe are created from the kinds of weather systems which usually occur. This course surveys the weather systems of the globe and the geography which helps to transform them into regional climates. It uses just enough physics to show you how it all works and how we can make informed assessments about ideas on climatic change.", "prerequisites": "4.0 credits including GGR112H5 or ENV100Y5"}, {"name": "GGR217H5 • Fundamentals of Hydrology", "description": "Hydrology is the study of the quantity, quality, storage, and transfer of the world's freshwater. The presence of water on and in the continents and atmosphere sustains the terrestrial biosphere, including human life. This course focuses on the central concepts of hydrology by taking a systems approach to the movement and storage of water on and in a watershed. Based on the framework of the water cycle, the course emphasizes the physical processes that control the stores and transfers of water and energy in the Earth system. This course serves as a gateway to the more advanced treatment of hydrology in upper levels, as well as providing a solid understanding of the fundamentals of the science of water for students in other streams of physical geography, environmental science, earth science, and biology.", "prerequisites": "4.0 credits including GGR112H5 or ENV100Y5"}, {"name": "GGR227H5 • Ecosystems and Environmental Change", "description": "This course introduces the rapidly advancing fields of ecosystem science through the exploration of how ecosystems respond to climate change, pollution, and intensive natural resource management. The impacts from anthropogenic stressors on ecosystem functioning are often complex, with interactions occurring among plants, microorganisms, and physical and chemical environments. Lecture topics and case studies focus primarily on important representative Canadian ecosystems that also play vital roles in the resource sector including forests, agricultural land, wetlands and aquatic ecosystems.", "prerequisites": "4.0 credits including GGR112H5 or ENV100Y5"}, {"name": "GGR252H5 • Retail Geography", "description": "Commercial activities are a significant and visible part of our social system. We are what we consume, and our consumption priorities describe our society. Consumption practices are mediated through the action of retailers and the preference of consumers. The course examines the organization of the retail economy and considers relationships between retail practices and environmental, ethical and social justice concerns. Likewise it explores how social, environmental and ethical beliefs of consumers influence their purchasing practices, the connections between consumer behaviour and the practices of retailers and the possibilities for developing a retail economy that better aligns with societal concerns for social justice, ethical production and environmental sustainability.", "prerequisites": "4.0 credits"}, {"name": "GGR265H5 • (Under)development and Health", "description": "In this course students will be introduced to contemporary development and health issues by examining historical experiences, social, political, economic and environmental processes. This approach will help highlight the vast diversity and address some of the many questions about the region including: What processes underlie famine and food insecurity? What are the underlying causes of the conflict and genocide in some regions? What processes explain spatial disparities in health, or regional and gender differences in HIV rates and the outbreak of rare diseases like Ebola? The course will rely on case studies from the Sub-Saharan (SSA), one of the most diverse and intriguing regions in the world, to provide an understanding of the complexity in each topic.", "prerequisites": "4.0 credits"}, {"name": "GGR276H5 • Spatial Data Science I", "description": "Introduction to the study of geographical phenomena using descriptive and inferential statistics. Fundamentals of geographic data and statistical problem solving using non-spatial and spatial descriptive statistics. Decision making using evidence gathered from inferential statistical analysis. Graphical summary, geographic visualization and mapping of analytical results. Application of state of the art software for statistical analysis. Provides background for future studies in geographic information systems and advanced statistical analysis. The course strikes a balance between developing an understanding of core non-spatial and spatial statistical concepts, while demonstrating technical proficiency in the application of software to the study of geographical questions.", "prerequisites": "4.0 credits"}, {"name": "GGR277H5 • Social Research Methods in Geography", "description": "This course introduces students to the range of social research methods and approaches used in the field of human geography. The course will cover research design, research ethics, data collection methods including interviews, focus groups, surveys, etc., ethics in conducting research with human subjects, and data analysis and interpretation. This course fulfills 1 field day.", "prerequisites": "4.0 credits"}, {"name": "GGR278H5 • Geographical Information Systems", "description": "Introduction to models of representation and management of geographical data for scientific analysis. Basic quantitative methods and techniques for geographic data analysis, including collection, manipulation, description and interpretation. Practical exercises using GIS and statistical software packages with examples drawn from both physical and human geography.", "prerequisites": "4.0 credits"}, {"name": "GGR300H5 • Special Topics in Human Geography", "description": "This course explores a particular area within human geography. Topics will vary from year to year. See department website for details. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "9.0 credits including GGR277H5 and permission of instructor"}, {"name": "GGR301H5 • Pandemics, Inequality, and Health: Exploring the Nexus of Health Disparities in Crisis", "description": "Through an interdisciplinary lens, this course will examine the unequal distribution of health outcomes during pandemics and how social, economic, and political factors contribute to these disparities. In doing so, this course will explore existing and historical political, social, and systemic inequalities that have persisted and widened during pandemics and health crises with a particular focus on marginalized populations that are disproportionately affected by pandemics and social inequities. Using case studies and contemporary examples, this course will analyze how socioeconomic factors, including access to healthcare, education, housing, and economic stability influence and worsen health outcomes and wellbeing during pandemics. Students will also explore the science that inform local and global interventions and policy responses aimed at reducing disparities and promoting resilience in communities facing the dual burden of pandemics and social inequities.", "prerequisites": "9.0 credits including GGR277H5 and permission of instructor"}, {"name": "GGR304H5 • Dendrochronology", "description": "Tree rings are a powerful natural archive for addressing research questions across a range of spatial and temporal scales, owing to the fact that they are annually resolved, long-lived (e.g., multi-century) and cover a large portion of the Earth's surface. Tree-rings reflect changes in their local environment, and they are sensitive to factors that limit biological processes such as light, soil moisture, temperature and disturbance. Environment changes are 'encoded' in the physical properties of tree-rings (e.g., ring-width, wood density or isotopes). This course will provide students with the theoretical background and technical skills needed to cross-date, measure, analyse and interpret tree-ring data, and use this information to address practical research questions.", "prerequisites": "9.0 credits including [GGR276H5 and (GGR214H5 or GGR227H5) or permission of instructor]"}, {"name": "GGR305H5 • Biogeography", "description": "Analysis of past and present plant and animal distributions, and of the environmental and biological constraints involved. The course emphasizes the impact of continental drift, Quaternary climatic changes and human interference on contemporary patterns.", "prerequisites": "9.0 credits"}, {"name": "GGR307H5 • Environmental Soil Science", "description": "Soils play critical roles in sustaining life. They support plants and agriculture, serve as home to a plethora of organisms, recycle organic matter and nutrients, provide materials for construction, art, and medicine, preserve paleoecological and archaeological records, regulate global climate through the exchange of greenhouse gasses, and filter contaminants in water and waste. This course introduces fundamentals of soil formation, physical, chemical and biological characteristics, and classification schemes. It explores the role of, and how humans interact with, soils in Canadian forests, wetlands, agricultural systems, and industrial and urban settings. Aspects of carbon, nutrient, and pollutant biogeochemistry in soils are explored in detail. This course fulfills 2 field days.", "prerequisites": "9.0 credits"}, {"name": "GGR309H5 • Wetland Ecosystems", "description": "Wetlands are an integral part of our biosphere, playing fundamental roles in the modification of water quality, biodiversity, and the global carbon cycle. This course focuses on the classification, hydrology, biogeochemistry, and ecology of wetland systems. The latter part of the course builds on this physical foundation by introducing management issues associated with wetland preservation, restoration and creation. This course fulfills 4 field days.", "prerequisites": "9.0 credits"}, {"name": "GGR311H5 • Landscape Biogeography", "description": "A geographical, multi-scale perspective on the relationship between the physical landscape and the distribution, movement, dispersal, and abundance of select animal species. Landscape measures including (but not limited to) fragmentation indices, habitat metrics, and estimates of animal movement will be considered. Emphasis is placed on understanding the biology of the species being studied, the physical structure of the landscape, and the intricacies of various modeling software. Students should expect to develop a well-rounded set of skills in analyzing animal movement, and producing relevant and usable results towards the management of varied landscapes and the conservation of species.", "prerequisites": "9.0 credits"}, {"name": "GGR313H5 • Gender and the City", "description": "In this course students will be introduced to approaches in social geography that examine the links between gender and urban environments. Specific topics and issues to be covered include, for example, poverty, work, sex trade, human trafficking and safety. Topics will be explored across multiple scales including bodies, home, neighbourhood and community. This course fulfills 1 field day.", "prerequisites": "9.0 credits"}, {"name": "GGR315H5 • Physical Hydrology", "description": "This course centres on the advanced treatment of the physical principles involved in the occurrence and movement of water on and beneath the Earth's surface. Watershed-scale hydrologic systems are investigated, along with basic principles of fluid mechanics. Open channel hydraulics, soil water, and groundwater processes are investigated. The importance of understanding water movement in the environment by exploring the relationship of hydrology to other environmental sciences is stressed. This course fulfills 2 field days.", "prerequisites": "9.0 credits including GGR214H5 or GGR217H5"}, {"name": "GGR316H5 • Landforms", "description": "Systems approach to hillslope geomorphology studies; processes of erosion and deposition; mass wasting; slope forms of humid and arid regions; process-response models; applied aspects.", "prerequisites": "9.0 credits including GGR201H5 or Permission of Instructor"}, {"name": "GGR317H5 • The Cryosphere: Canada's Frozen Environments", "description": "Snow and ice dominate the Canadian landscape. There is virtually no area in Canada that escapes the influence of snow and ice. We skate on frozen ponds, ski down snow covered mountains, drive through snow blizzards and watch how ice jams in rivers cause rivers to swell and floods to occur. The duration and the thickness of snow and ice increase rapidly northwards, and glaciers are found in mountainous areas and in large parts of the Arctic region. Given that snow and ice impact heavily on the Canadian way of life, this course seeks to understand the dynamics of snow and ice in a hydrological context. This course will examine snow properties, snow cover distribution, glacier hydrology, melt runoff, and ice in its many forms (lake ice, river ice, sea ice, and ground ice). This course will also examine some of the recent observed changes occurring in the cryosphere regions of Canada. This course includes an off campus field trip. This course fulfills 2 field days.", "prerequisites": "9.0 credits including GGR214H5 or GGR217H5"}, {"name": "GGR318H5 • Political Geography", "description": "Political geography is concerned with the spatial expression of political entities and events. It involves analysis at a variety of scales ranging from the local to the global. The control and manipulation of territory and the imposition of political boundaries and political ideas are central to this analysis. The course provides discussion on nation building, the emergence of the state system, theories on the state, and the role of the state as provider of services and regulator of activities, and electoral geography and governance. This course fulfills 1 field day.", "prerequisites": "9.0 credits"}, {"name": "GGR319H5 • Landscapes of Belonging", "description": "Grounded in human geography and qualitative methods, this course investigates the meaningful non-tangible relationships between humankind and environment. These relationships include emotional attachment (to place), aesthetics (of landscape), ethics (of environment), and relationships (to place and to other species). We will examine these ideas through exploration of the geohumanities; ways of seeing or apprehending the world; ways of being in place; ways of translating or reproducing the world; and possible paths forward in the relationship between us and the landscapes around us. This course fulfills 1 field day", "prerequisites": "9.0 credits of which 1.0 credit must be GGR or ENV"}, {"name": "GGR321H5 • Geographic Information Processing", "description": "Problem solving using geographic information systems (GIS). Essential distributed computing aspects of GIS are presented. Among topics covered are the use of logic in spatial analysis, line-of-sight analysis, route selection, site selection, and landscape analysis. Hands-on assignments are emphasized.", "prerequisites": "8.5 credits and GGR278H5"}, {"name": "GGR322H5 • GIS and Population Health", "description": "The purpose of this course will be to develop an appreciation for the conceptual and methodological intersections that exist between geographical information systems and population health. While population health can include incidence and prevalence of disease and ill-health, as well as concerns about service provision, this course will focus mainly on disease, injury, illness more broadly. The course will include both lectures, where foundational concepts will be introduced and related to practical lab sessions, where students will gain experience using GIS to map and study health information. Topics will include: spatial databases for population health, mapping health data, analyzing the spatial clustering of disease and/or injury, mapping and analyzing environmental and social risk factors.", "prerequisites": "(8.5 credits and GGR278H5) or permission of instructor"}, {"name": "GGR325H5 • Business and Industrial Geography", "description": "This course uses economic principles and geographical analysis to help you understand the global economic map of the early 21st century. It aims to show the way in which economic activities are organized within and across countries and how this affects people and communities. Both broad patterns of economic organization and specific case studies will be discussed. Topics covered range from the impact of public policy on regional growth to a case study of the financial services industries. In short, the course attempts to answer the following question about the global economic map: \"What is where, and why? and so what?\".", "prerequisites": "9.0 credits"}, {"name": "GGR329H5 • Environment and the Roots of Globalization", "description": "A critical discussion of how geographical factors, such as landscape, flora and fauna, might help explain why history unfolded differently on different continents. How geography might have impacted the development of agriculture, complex technologies, writing, centralized government and how, in the process, it has shaped the current world economic map.", "prerequisites": "9.0 credits"}, {"name": "GGR333H5 • Energy and Society", "description": "A broad survey of humankind's ability to control and manipulate energy. Forms of energy and use; energy eras and transitions; past and present economic and policy debates. Understanding of technical terms, physical principles, creation of resources and trade-offs will be emphasized as a basis for discussions about current energy options.", "prerequisites": "9.0 credits"}, {"name": "GGR335H5 • Remote Sensing Applications", "description": "The purpose of this course is to familiarize students with the various ways in which remote sensing images have been used for environmental applications among the sectors of government, industry, and academia. A part of the course will be devoted to application projects employing remote sensing and spatial data analysis in natural resources and environmental assessments.", "prerequisites": "8.5 credits and (GGR276H5 or GGR278H5 or GGR337H5)"}, {"name": "GGR337H5 • Environmental Remote Sensing", "description": "This introductory course emphasizes mastering fundamental remote sensing concepts and utilizing remotely sensed data for monitoring land resources and environmental change. Topics include surface-energy interactions, sensor systems, image interpretation, and applications for examining soil, vegetation and water resources. Upon completion of this course, students should have the necessary knowledge and skills to pursue more advanced work in digital image processing and remote sensing applications.", "prerequisites": "9.0 credits"}, {"name": "GGR338H5 • Environmental Modeling", "description": "An application of environmental models to contemporary problems of decision-making. The course demonstrates the relevance of techniques of data management (statistics, computer systems) to issues facing Canada and the global community.", "prerequisites": "9.0 credits including GGR276H5"}, {"name": "GGR349H5 • Cities in Transition", "description": "The internal geography of contemporary cities is in the midst of a series of transitions related to new settlement patterns, immigration, workplace location, transportation and communication technologies, globalization, and shifts in urban governance. This course will examine these transitions and their effects on the social and political geography of the city. Themes include gentrification, spatial mismatch, concentrated poverty, political fragmentation, and the emergence of new urban forms and of the post-modern city.", "prerequisites": "9.0 credits"}, {"name": "GGR353H5 • Disease and Death", "description": "This course will provide a geographical perspective on patterns of mortality, morbidity and access to health care among populations. It will outline current theoretical and empirical underpinnings in health geography and emphasize the links between health and place. The course covers some traditional themes in health geography including spatial dissuasion of diseases and access to health care. Using illustrations from evolving fields such as Global Health, Aboriginal Health, and Immigrant Health the course delves into the important theme of health inequalities.", "prerequisites": "9.0 credits"}, {"name": "GGR361H5 • City Planning and Development", "description": "This course outlines important concepts and historical milestones involved in the planning and development of cities. It involves examination of urban sprawl, urban intensification efforts, and of the evolution of urban form and the interplay of private and public forces that shape the built-form of Canadian cities. This course fulfills 2 field days.", "prerequisites": "9.0 credits"}, {"name": "GGR362H5 • Exploring Urban Neighbourhoods", "description": "With a majority of the world's population living in urban areas, nearly all of the problems and possibilities of society and human-environment relations are becoming urban questions. The city is the setting in which broad social, cultural, political, and economic processes unfold, mediated and shaped by local context. Our focus in this course is the internal structure of the city. We examine the ways in which local experiences and conditions of urban life are shaped by social differentiation and processes of change. Our examination includes considerations of race, class, gender, and ethnicity in the context of urban life as a way of exploring how identity and place shape one another. We consider different theoretical frameworks that researchers utilize to make sense of both the persistence of old problems and the emergence of new ones. Instruction will adopt a blended approach in which students will connect the concepts covered in class discussion through field work based exploration of local urban neighbourhoods. This course fulfills 5 field days.", "prerequisites": "9.0 credits"}, {"name": "GGR363H5 • Global Migration and Health", "description": "International migration is an important global issue. Hundreds of millions of individuals currently live outside their country of origin. Most migrants leave their country of origin in search of better economic and social opportunities while others are forced to flee crises including political unrest, violence, and natural disasters. Migration poses numerous challenges for individuals, families, communities and governments including those related to health and access to health care services. This course examines contemporary international migration from a geographic perspective with a specific focus on the complex relationships among global (im)migration, health, and broader social determinants of health. Topics covered may include: migration theories, immigration trends and policies, integration and citizenship, social determinants of health, and health care policy.", "prerequisites": "9.0 credits including GGR353H5"}, {"name": "GGR365H5 • Trade and Globalization", "description": "This course uses economic and geographical principles to help students understand the advent of the current period of globalization. In this context, globalization refers to international trade liberalization which results in increased contacts across borders, migration, trade, and investment. Topics covered will include the history of globalization, the environment, sweatshops, development and inequalities. By the end of the course, students should have gained a deeper understanding of current controversies surrounding international trade and globalization.", "prerequisites": "9.0 credits"}, {"name": "GGR370H5 • The Geography of Transportation", "description": "Transportation is an integral aspect of our daily lives and plays a key role in shaping the economy and the environment. Through this course, students will explore the geography of transportation. Topics will include, mobility and accessibility, transportation networks and flows, Geographic Information Systems in Transport (GIS-T), planning and policy, environmental and human health impacts, and other current issues.", "prerequisites": "9.0 credits including GGR278H5"}, {"name": "GGR372H5 • Geographical Analysis of Land Resources", "description": "This course focuses on the nature of land resources information and its analysis. Emphasis is on use of geographic information systems to model and analyze a variety of land resources. Topics such as terrain analysis and interpolation will be covered.", "prerequisites": "9.0 credits including GGR278H5 or permission of instructor"}, {"name": "GGR374H5 • Water Quality and Stream Ecosystems", "description": "Flowing water courses (streams and rivers) are unique ecosystems from lake, terrestrial, and wetland environments, and are integral in regulation of land-borne solutes to larger water bodies. This course provides a holistic treatment of the stream ecosystem, with particular emphasis on nutrient and contaminant transformation, in-stream hydraulics and morphology, the hyporheic, parafluvial, and riparian zones, as well as hillslope hydrological processes responsible for transfer of water to the stream. Variability in stream biota, community interactions, and ecosystem-level processes are also discussed. Weekly field and lab exercises provide the student with hands-on experience with the lecture material. This course fulfills 4 field days.", "prerequisites": "9.0 credits including GGR217H5 or GGR227H5 or BIO205H5"}, {"name": "GGR375H5 • Physical Environment of the City", "description": "The physical structure of the city results in a distinctive local climate that is linked to air and water quality, as well as to energy use. A geographical information system is used to assemble physical information from which to model the urban climatic environment, taking the example of Mississauga. Particular emphasis is placed upon the role of field measurements and satellite data as sources of geographical information.", "prerequisites": "9.0 credits"}, {"name": "GGR376H5 • Spatial Data Science II", "description": "This course builds on quantitative methods introduced in GGR276, and aims to provide a broad study of advanced statistical methods and their use in a spatial context in physical, social, and environmental sciences. The course covers theories, methods, and applications geared towards helping students develop an understanding of the important theoretical concepts in spatial data analysis, and gain practical experience in application of spatial statistics to a variety of physical, social and environmental problems using advanced statistical software.", "prerequisites": "(9.0 credits including GGR276H5 or STA256H5) or permission of instructor"}, {"name": "GGR377H5 • Global Climate Change", "description": "The main focus of this course is upon the climatic aspects of environmental change which affect Great Lakes water levels, disappearing glaciers, sea level rise, desertification and dwindling water resources in an ever more populous world. These changes to the earth surface environment are explored in the context of themes and issues which were introduced in first year, with a view to answering an important question: whether policy action on climate change must wait for more science, or whether action is merely delayed by failure to appreciate science.", "prerequisites": "9.0 credits including GGR112H5 or ENV100Y5"}, {"name": "GGR379H5 • Field Methods in Physical Geography", "description": "This course is structured around one major field trip that will occur before fall-term courses begin, preparatory work, and approximately bi-weekly course meetings during the regular academic term to complete complementary work in computer and/or wet laboratories. Field projects will involve analyses and mapping of vegetation, soils, aquatic systems, hydrology, and/or geomorphology, and subsequent data analysis. Students will be required to write one major research paper and present projects to the class. Each student is required to pay the costs of his/her transportation and accommodation. Students must register on ACORN, on a first-come first-serve and non-refundable deposit basis. The deposit must be received by the Department within one week from the first day of enrollment or the student will be dropped automatically from the course. Students should contact the Department to find out more details about the specific fieldtrip plans. This course fulfills 7 field days.", "prerequisites": "1.0 credits from: (GGR201H5 or GGR214H5 or GGR217H5 or GGR227H5) and 1.0 credits from any other GGR/ENV SCi course(s) and 2.0 credits from any science courses and permission of instructor"}, {"name": "GGR381H5 • Spatial Database", "description": "Students will gain basic knowledge of spatial database design, implementation, query, and sharing. Playing with real-world datasets, students will create, edit, and manage geospatial databases using a variety of commercial and open-source software such as ArcGIS and PostgreSQL.", "prerequisites": {"and": [], "or": ["GGR278H5", "CSC263H5"]}}, {"name": "GGR382H5 • Digital Mapping and Principles of Cartography", "description": "This course will cover foundational concepts in mapmaking (cartography) using geographical information systems (GIS). The course will also explore map rendering in the digital and mobile worlds where the power of geography and cartography are leveraged through development of location based services used increasingly in everyday life. Topics covered will include but are not limited to: coordinate systems and map projections, measurement and classification, making maps using GIS, critical appraisal of mapped information. The course will combine lectures with practical sessions where foundational concepts will be applied using GIS and related technologies and software.", "prerequisites": "9.0 credits including GGR278H5"}, {"name": "GGR383H5 • Contaminants in the Environment", "description": "This course discusses various types of contaminants (metals, persistent organic pollutants, emerging contaminants, pesticides, pharmaceuticals, flame-retardants, micro-plastics, nano-materials, etc.) and their impacts on the environment. Lectures cover sources, transport and fate of these contaminants in various environmental media (air, water, and soil/sediment), degradation mechanisms, uptake into biological systems, and toxicity. A number of case studies such as pollutants in Arctic ecosystems and the potential risks they pose to the health of Indigenous People and the role of science in informing policy addressing pollutants will be examined. Class and group activities during tutorials, including discussions of current scientific articles, will complement lectures.", "prerequisites": "[8.0 credits and (1.0 credit from GGR201H5 or GGR214H5 or GGR217H5 or GGR227H5)] or permission of instructor"}, {"name": "GGR384H5 • Climatology of Canadian Landscapes", "description": "This course will focus on the natural surface climates of Canada. Topics covered will include Alpine and forest environments; ocean and wetland regions; and both artic and subarctic climates. Surface energy processes will be examined, and how the behavior of energy exchange varies by climate region. This course fulfills 4 field days.", "prerequisites": "9.0 credits including GGR214H5 or GGR217H5"}, {"name": "GGR385H5 • Indigenizing Space and Place", "description": "This course looks critically at how places and people are come to be labelled as indigenous and how this labelling is tied to political, social, economic, and environmental systems that shape the spaces in which we all live. Furthermore, this course asks how spaces and places can be indigenized and what this means for social relations. We will study these processes at multiple scales - from international solidarity networks to nationalist claims on territory to an individual's sense of belonging. We will examine a wide range of topics related to these processes such as the geographies of education, the Truth and Reconciliation Commission, resource conflicts, media representations, identity formation and well-being. While we will be focusing on indigenizing geographies within the context of Canada as a settler nation, we will also engage with how indigenous geographies shape and are shaped by nationalisms in other parts of the world. As part of this course, students may have the option of participating in an international learning experience that will have an additional cost and application process. This course fulfills 1-5 field day (to be adjusted according to student activity) .", "prerequisites": "9.0 credits"}, {"name": "GGR387H5 • Food and Globalization", "description": "A broad overview of the historical development of the global food economy and a survey of recent trends and controversies. Topics discussed range from basic food staples, food markets and trade liberalization to food security, environmental sustainability and alternative agricultural systems.", "prerequisites": "9.0 credits"}, {"name": "GGR389H5 • Field Studies in Human Geography", "description": "This course will provide students with a first-hand exposure to the social, urban, historical and cultural geography of a North American city. During a 5-7 day stay in a city, students will apply basic field methods, such as observation and field note taking, to gain an in-depth understanding of the landscape and build environment. Students will participate in collecting primary observational data as well as gathering information gleaned from guided tours, lectures and group discussion. Admission to course will be through application due by end of March. The student's application must be submitted to the department and must include a current transcript, a current curriculum vita, and a letter of application explaining why their qualifications and interest make them suitable candidates for this field course opportunity. Applicants who meet minimum criteria will be selected for an interview. Acceptance will be based on a combination of GPA, experience, qualifications and interview performance. There is a nonrefundable fee associated with this course beyond tuition, for which the accepted students are responsible. This course fulfills 6 field days.", "prerequisites": "8.0 credits including GGR111H5 and GGR207H5 and GGR210H5 and GGR277H5"}, {"name": "GGR399Y5 • Research Opportunity Program", "description": "This course provides senior undergraduate students who have developed knowledge of geography and have studied its research methods the chance to work as part of a research team, under the direction of a professor, in exchange for course credit. Students have the opportunity to be involved in original research, enhance their research skills and participate in the excitement and discovery of facilitating new knowledge. Based on the nature of the project, projects may satisfy the Sciences or Social Sciences distribution requirement. Participating faculty members post project descriptions for the following summer and fall/winter semesters on the ROP website (www.utm.utoronto.ca/rop) in mid-February and students are invited to apply at that time. This course may fulfill field day components. Please consult with your supervisor.", "prerequisites": "9.0 credits"}, {"name": "GGR404H5 • Paleoenvironmental Change", "description": "Knowledge of paleo (past) climate and environmental change is crucial to understanding Earth System dynamics and predicting future change. Students will be exposed to a spectrum of traditional and frontier methods employed in past global change research, with a focus on the Cenozoic Era (~66 million years). This course will examine varied topics such as sea level rise; climate change over geologic and societal time; the Anthropocene, onset of Northern Hemisphere glaciations; and radiometric dating. More broadly, this course aims to provide students with an understanding of how paleoenvironmental studies contribute to advancing knowledge of the Earth System.", "prerequisites": "14.0 credits including 0.5 credit from: GGR214H5 or GGR304H5 or GGR305H5 or GGR384H5 or ERS321H5 or permission of instructor"}, {"name": "GGR406H5 • Environmental Biogeochemistry", "description": "Environmental biogeochemistry provides an introduction to the biological, chemical, and geological processes that regulate the flow of energy and matter in the environment. This seminar course explores the processes underlying biogeochemical cycles of major elements such as carbon and nutrients, and examines how these key cycles have been altered during the Anthropocene, an era of unprecedented human-induced environmental and climate change. Topics covered include biogeochemical processes in atmospheric, ocean, freshwater and terrestrial compartments; emerging techniques (eg., stable-isotopes and paleo-proxies) used in biogeochemistry; and how disruptions to biogeochemical processes are at the root of many environmental issues such as eutrophication, climate change, ozone depletion, ocean acidification and toxic metal contamination.", "prerequisites": "14.0 credits or permission of instructor"}, {"name": "GGR407H5 • Ecohydrology", "description": "Ecohydrology explores the feedback between biological, hydro-logical and biogeochemical processes that help shape ecosystem form and function. These feedbacks are central to the regulation of the global climate and water resources. With pronounced and rapid human modification to the landscape and climate system this field of study is increasingly relevant to formulate mitigation strategies. This seminar and research course explores the feedback processes most crucial to climate change and water resources. Topics include ecosystem control on the water balance, the role of peat-lands in ameliorating climate change, hydro-logic controls on species diversity, and the role of the watershed in mitigating human pollutants. Students are expected to conduct independent and collaborative study.", "prerequisites": "GGR315H5 or a combination of GGR217H5 plus one of (GGR305H5 or GGR307H5 or GGR309H5 or GGR374H5 or BIO311H5 or BIO330H5)"}, {"name": "GGR415H5 • Geographies of Indigenous Health", "description": "Indigenous people of Canada - the First Nations, Metis and Inuit peoples - have very rich and diverse histories. However, common to most are large disparities in health compared to the non-Indigenous population. This seminar course will examine the health conditions of Indigenous peoples in Canada including a focus on the geographic, historic, and contemporary factors leading to health disparities and inequalities. The course will also examine health and well-being through an Indigenous worldview.", "prerequisites": "14.0 credits including GGR353H5"}, {"name": "GGR418H5 • Geopolitics", "description": "The course focus is classical and contemporary geopolitical theories. We examine different and competing ideas and consider how and if geographic logic of the international (or global) political order has changed. Discussion will initially focus on the historical progression of geopolitical reasoning and then will proceed to discuss imperial rivalries, concepts of hegemony and world order and the geopolitics of the Cold War and the post-Cold War eras. The final section of the course will consider theoretical struggles surrounding the geopolitics in the early 21st. century and the challenges posed by critical geopolitics, social movements, environmental changes and feminist theory. Throughout, the primary concern is how the effects of scale, space and power in global politics is understood and experienced.", "prerequisites": "14.0 credits"}, {"name": "GGR420H5 • Geography of Finance and Financial Crisis", "description": "The global financial crisis brought to mainstream attention the important role played by finance, and new and strange terms such as subprime, derivatives, ABCP, libor, CDS, CDOs. The aftermath of crisis also witnessed mortgage foreclosures and evictions, factory closures, bailouts of large banks and hedge funds, and the implosion of public finances in a number of European nations. This course seeks to understand the spatial organization of financial flows, intermediaries, and instruments, and how these may be related to the apparently disparate phenomenon cited above. It explores how this geography of finance might be related to the production of financial crisis, and how the global geography of international finance relates to the public finances of nations and municipalities, pension and hedge funds, and individual investors. This course begins by exploring the workings of international finance, and examining the history of financial crisis, including both the current crisis and the great depression. We consider the different theories of financial crisis emanating from disparate political-economic-geographical perspectives, as well as the divergent policy implications that flow from such theories. The course then explores on the literature regarding the localized effects of the geography of finance, from the geography of sub-prime lending and foreclosures, to unemployment in selected European cities, the geography of new start-ups in developing nations, and the geography of credit card debt, bankruptcies and defaults.", "prerequisites": "14.0 credits"}, {"name": "GGR426H5 • The Geographies of Human Rights", "description": "This course examines the promises, problems and paradoxes of human rights. We will study the local, national and global aspects of human rights enforcement and violation. By examining specific case studies, we shall examine how so-called 'universal' human rights are articulated and practiced differently in different places. Throughout this course, we shall explore human rights as means of empowerment as well as oppression.", "prerequisites": "14.0 credits"}, {"name": "GGR437H5 • Cloud-based Image Analysis", "description": "This course builds on the fundamental remote sensing concepts, techniques, and applications introduced inGGR337H5, and aims to provide an advanced study of digital image processing and remote sensing applications. In specific, this course will use a cloud-based platform for large-scale analysis of satellite imagery, including mapping ground features, detecting changes, and identifying trends on the Earth's surface.", "prerequisites": "14.0 credits including GGR337H5 or permission of instructor"}, {"name": "GGR440H5 • Drone Remote Sensing", "description": "Industries from agriculture through to defense and mining are investing in Unmanned Aerial Vehicles (UAV) technology to support operational and strategic objectives. This course will cover the adoption of UAV technologies as a remote sensing tool and the impact of logistical, regulatory, and technical hurdles on UAV technology now and in the future. Through the course, students will gain the knowledge requirements to operate a UAV following Transport Canada guidelines and develop skills in processing UAV imagery into information assets that support applications where high resolution, spatial accuracy, and high detail is required.", "prerequisites": "14.0 credits including GGR337H5"}, {"name": "GGR442H5 • GIS Capstone Project", "description": "Students apply prerequisite knowledge and techniques to real-world GIS projects requested by external partners. Through background research, proposal, data management, and implementation, students develop GIS professional competencies, which will be demonstrated through collaboration, presentations and reports.", "prerequisites": "12.0 credits including (GGR276H5 or STA256H5) and GGR278H5 and (1.0 credit from GGR321H5 or GGR335H5 or GGR337H5 or GGR376H5 or GGR381H5 or GGR382H5 or GGR463H5) or permission of instructor."}, {"name": "GGR444H5 • Space Time Data Analysis", "description": "This course is designed for senior undergraduate students in a workshop format with a specific focus on application. Topics include space-time data collection, processing, analysis, and visualization. Widely used space-time analysis tools and newly developed data mining techniques will be introduced and discussed with examples and hands-on practices in the class. With practical experience on real-world space-time datasets, students will learn the basic knowledge and various tools for analyzing spatiotemporal datasets. The course encompasses practical instruction and training in ArcGIS Pro to use multiple public available space-time datasets. The primary outcome for students taking this course will be an independent analysis of a substantial space-time dataset, a formal report of the analysis, and a professional oral presentation.", "prerequisites": "13.5 credits and GGR321H5"}, {"name": "GGR461H5 • Advanced Urban Planning", "description": "This course will build on the material taught inGGR361H5, City Planning. This course will delve deeper into the scholarship related to urban planning and urban development more broadly such as planning for multicultural cities, ethics in planning and planning ethics, contemporary scholarly theories of planning (collaborative planning theory etc.), planning for more equal cities and planning for sustainability.", "prerequisites": "14.0 credits including any one of: GGR207H5 or GGR361H5 or GGR349H5"}, {"name": "GGR463H5 • Geographic Information Analysis and Processing", "description": "This course focuses on the digital representation and analysis of geospatial phenomena using open source software. Class discussions cover the foundational methods, algorithms, and scripting languages used in GIS analysis, which are reinforced in lab using current, widely used open source software. The course is structured as a series of modules that culminate in a final project. Students are encouraged to incorporate individual areas of interest into class discussion and assignments. Successful students will broaden their GIS toolset, increasing the flexibility of their work.", "prerequisites": "14.0 credits including GGR321H5"}, {"name": "GGR479H5 • Special Topics in Physical Geography", "description": "An advanced seminar dealing with topics in physical geography, to be selected according to staff and student interests. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "14.0 credits or permission of instructor"}, {"name": "GGR484H5 • The Climate of the Arctic", "description": "High latitude environments are becoming the focus of increasing scientific attention because of their role in global environmental change. The implications of changes occurring to the sea ice and snowcover are far reaching and can have impacts on physical, biological and human systems both within and beyond the region. This course will provide a comprehensive examination of climates of high latitudes. Topics that will be covered include the Arctic energy budget and atmospheric circulation, the hydrologic cycle in the Arctic, the ocean-sea ice-climate interactions and feedbacks, modeling the Arctic climate system as well as an evaluation of recent climate variability and trends.", "prerequisites": "14.0 credits including GGR214H5 or GGR317H5 or permission of instructor"}, {"name": "GGR489H5 • Special Topics in Human Geography", "description": "An advanced seminar dealing with topics in human geography, to be selected according to staff and student interests. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "14.0 credits or permission of instructor"}, {"name": "GGR494H5 • Special Topics in GIS", "description": "(FormerlyGGR394H5) Studies of selected topics in Geographic Information Systems not covered in regular courses. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "14.0 credits or permission of instructor"}, {"name": "GGR497H5 • Human Geography Independent Research Project", "description": "This independent project course is designed to give students experience in the definition and execution of a one-term research study on a human geography topic, under the guidance of a member of the faculty. Students who wish to pursue this option with a specific faculty member or who have an idea for a research project should approach the faculty member early - before the start of the academic term - to negotiate the terms of the project.", "prerequisites": "14.0 credits and permission of instructor"}, {"name": "GGR498H5 • Physical  Geography Independent Research Project", "description": "This independent project course is designed to give students experience in the definition and execution of a one-term research study on a physical geography topic, under the guidance of a member of the faculty. Students who wish to pursue this option with a specific faculty member or who have an idea for a research project should approach the faculty member early - before the start of the academic term - to negotiate the terms of the project.", "prerequisites": "14.0 credits and permission of instructor"}, {"name": "JEG400Y5 • Geography / Environment Science Internship", "description": "Through a part-time, unpaid work placement, students apply the natural science based environmental science/physical geography expertise gained through previous course work. Placements are made at local conservation authorities, municipalities, environmental consulting companies, corporations, provincial or federal agencies, and other organizations. Students must submit an application online. Instructions for the application can be found on the Geography Department home page:https://utm.utoronto.ca/geography/field-internship-and-thesis-courses", "prerequisites": "15.0-18.0 credits and permission of instructor"}, {"name": "JEG401Y5 • Geography / Environment Social Science Internship", "description": "Through a part-time, unpaid work placement, students apply the knowledge and expertise gained through previous course work in geography. Placements may be made in a range of settings. For example, placements may include municipal government, regional government, neighbourhood organizations and centres, corporations as well as with non-governmental organizations. Admission for this course will be through an online application. Instructions for the application can be found on the Geography Department home page:https://utm.utoronto.ca/geography/field-internship-and-thesis-courses", "prerequisites": "15.0-18.0 credits and permission of instructor"}, {"name": "JEG417Y5 • Honours Thesis", "description": "This course is designed to give students experience in the design and execution of an independent senior thesis under the supervision of a faculty member.In order to register in the course, students must obtain approval from a supervisor, complete an application form and submit the form to the Department of Geography. Please refer to the Department of Geography website for details:https://utm.utoronto.ca/geography/field-internship-and-thesis-courses.This course may fulfill field day components. Please consult with your supervisor.", "prerequisites": "14.0 credits"}, {"name": "JGE378H5 • Natural Hazards", "description": "Earth is a dangerous place and risk is an inherent feature of life on this planet. Some of the events and processes that we call \"hazardous,\" such as earthquakes, volcanic eruptions, floods, tsunamis, cyclones, and forest fires are natural environmental processes. We define them as hazards only when they pose a threat to human interests. In this course we will examine natural hazards as well as some technological hazards, their causes, their potential impacts on people, and their management and mitigation.", "prerequisites": "9.0 credits"}]