[{"name": "GER200Y5 • Intermediate German", "description": "Taught in German. This language course is a continuation of work done inGER100Y5. Expansion of grammar and vocabulary, practice in listening, reading, composition, and conversation while cultivating an introductory awareness of German culture. This is an interactive course with an emphasis on communicative expression and authentic materials. The Department reserves the right to place students in the appropriate course in the series (GER100Y5,GER200Y5,GER300Y5).", "prerequisites": "GER100Y5 or GER101H1 or permission of department."}, {"name": "GER204H5 • Masterpieces in German Literature in Translation", "description": "Taught in English and open to all students. Readings offered in both English and, as a comparative option, German. A survey of selected themes and topics on masterpieces of German literature. Students should check with the department and/or instructor regarding the course focus in the term it is being offered.", "prerequisites": "GER100Y5 or GER101H1 or permission of department."}, {"name": "GER205H5 • Introduction to German Literature", "description": "Taught in German. An introduction to the study of German literature and literary concepts using original German texts.", "prerequisites": "GER100Y5 or GER101H1 or permission of department."}, {"name": "GER250H5 •  Introduction to German Culture", "description": "Taught in English and open to all students. How can we define \"Germany\" both historically and in its modern and increasingly multicultural context? How did Germany become the political and economic powerhouse of the European Union? How can we reflect on the Holocaust using identity, nationality and memory? These and other broad questions are examined in their cultural, social and intellectual context from the Middle Ages to the present. As part of this course, students may have the option of participating in an international learning experience that will have an additional cost and application process.", "prerequisites": "GER100Y5 or GER101H1 or permission of department."}, {"name": "GER299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "GER100Y5 or GER101H1 or permission of department."}, {"name": "GER300Y5 • Advanced German", "description": "Taught in German. Building on materials introduced inGER100Y5andGER200Y5, this language course provides students with a deeper understanding of German by developing communicative proficiency in all four language skills, emphasizing effective oral and written expression, aural and reading comprehension, and in-depth reviews and expansion of grammatical structures. The Department reserves the right to place students in the appropriate course in the series (GER100Y5,GER200Y5,GER300Y5).", "prerequisites": {"and": [], "or": ["GER200Y5", "GER201H1"]}}, {"name": "GER303H5 • German Current Events Through Print and Online News Media", "description": "The study of important political, social, and cultural issues in contemporary Germany on the basis of print and online sources is studied. Topics are typically selected by the instructor with the input of students. The course provides further refinement of writing style, reading strategies, vocabulary, and conversation skills.", "prerequisites": "GER300Y5"}, {"name": "GER305H5 • German Literature: From the 18th to the 21st century", "description": "Taught in German. Building on the work ofGER205H5, this course explores texts from the 18th to the 21st century.", "prerequisites": {"and": [], "or": ["GER100Y5", "GER205H5"]}}, {"name": "GER320H5 • Topics in German Literature", "description": "Topic, genre, period, and author studies. This course may be repeated for credit with different content.", "prerequisites": "GER205H5, GER305H5"}, {"name": "GER330H5 • Topics in German Cultural Studies", "description": "This course covers various topics in the culture of German-speaking countries. Such topics may include Berlin, Weimar culture, unification and the politics of memory in postwar Germany. This course may be repeated for credit with new content.", "prerequisites": "GER204H5, GER205H5"}, {"name": "GER335H5 • Post-War German Culture and Literature: Memory and the Holocaust", "description": "Taught in English and open to all students. Examines representations of the Holocaust in post-WWII German culture and literature across multiple generations and perspectives using a variety of media, including literature, film, architecture, photography and memoir.", "prerequisites": "GER204H5, GER205H5"}, {"name": "GER353H5 • German National Cinemas", "description": "An introductory survey of the history of German cinemas from the silent period to the present. Counts toward the Minor in Cinema Studies. Knowledge of German is not required.", "prerequisites": "GER204H5, GER205H5"}, {"name": "GER354H5 • Topics in German Cinema Studies", "description": "This course will cover various topics that may include genre studies, a period focus (Weimar, New German Cinema, Nazi Cinema, GDR Cinema), directors (Fritz Lang, Wim Wenders), or themes (transnational cinema, cinema and the city, film and history, film and literature, etc.). This course may be repeated for credit with different content. It counts toward the Minor in Cinema Studies. Knowledge of German is not required.", "prerequisites": "GER204H5, GER205H5"}, {"name": "GER355H5 • The Theatre of Bertolt Brecht", "description": "This course will study selected plays by Brecht and investigate his dramatic theories and stage techniques. All readings will be in German.", "prerequisites": {"and": ["GER205H5", "GER305H5."], "or": []}}, {"name": "GER370H5 • German for a Global Context: Business and International Relations I", "description": "Taught in German. An introduction to the use of German in a global and professional context, focusing on German for business and international relations. Emphasis on oral and written communication.", "prerequisites": "GER200Y5 or GER201H1 or permission of the department."}, {"name": "GER371H5 • German for a Global Context: Business and International Relations II", "description": "Taught in German. An introduction to the use of German in a global and professional context, focusing on German for business and international relations. Emphasis on oral and written communication.", "prerequisites": "GER370H5 or permission of the department"}, {"name": "GER450H5 • Advanced Seminar in German Literature", "description": "Topic, genre, period, and author studies. This course may be repeated for credit with different content.", "prerequisites": "GER204H5 and GER205H5, and 0.5 of 300/400 level literature or culture course"}, {"name": "GER475H5 • Advanced Seminar in German Cultural Studies", "description": "This course is an in-depth study of different topics in the cultures of German-speaking countries. It may be repeated for credit with different content.", "prerequisites": "GER205H5 and GER305H5, and 0.5 of 300/400 level literature or culture course."}, {"name": "GER490H5 • Independent Study", "description": "An independent research paper or scholarly project supervised by a member of staff on a literary or cultural topic. Students must submit a written proposal that includes a provisional project or paper title, plan of study and preliminary bibliography. Open only to students in their fourth year of study.", "prerequisites": "Written permission of the instructor and of the Department to be obtained by May 1st for the Fall Session; by November 1st for the Winter Session."}]