[{"name": "HIN211H5 • Introductory Hindi I", "description": "This course is for students with no prior knowledge of the Hindi language. Students will learn to read and write Hindi in Devanagari script with basic rules of Hindi grammar. Introduction to phonology, grammar, syntax of modern Hindi; emphasis on basic writing and reading.", "prerequisites": "All students who are enrolling in an HIN language course for the first time are required to complete the Hindi Language Assessment Questionnaire. Students who have not completed an assessment cannot be approved for course enrolment. Please visit https://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnaires"}, {"name": "HIN212H5 • Introductory Hindi II", "description": "This course focuses on further developing grammatical structures fromHIN211H5and continues to the next level of Hindi grammar. Students will be introduced to vocabulary of next level to advance their speaking and writing skills by writing compositions and short essay.", "prerequisites": "HIN211H5 or appropriate language level as indicated by the Hindi Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnaires)."}, {"name": "HIN311H5 • Readings in Hindi", "description": "This course is designed for students who have a fair knowledge of Hindi. In this course children's stories from Indian classical writings Panchtantra, Jataka and other folk stories will be discussed.", "prerequisites": "HIN212Y5 or the permission of the instructor."}, {"name": "HIN312H5 • Intermediate Hindi I", "description": "This course focuses on the further development of grammatical structures from Introduction to Hindi and continues to the next level of Hindi grammar and communicative skills. Students will be introduced to the vocabulary of intermediate level to advanced. Their speaking and writing skills will be developed by writing compositions and short essays.", "prerequisites": "HIN212H5 or as indicated by results from the Hindi Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnaires)."}, {"name": "HIN313H5 • Intermediate Hindi II", "description": "As a continuation of Intermediate Hindi I (HIN312H5), this course aims at developing student’s language to the next level, focusing on specific problems of grammar and essay writing. It also includes simple Hindi readings that introduce Hindi literature. Samples of modern Hindi writings will be discussed.", "prerequisites": "HIN312H5"}, {"name": "HIN411H5 • Hindi Culture and Media", "description": "The course is designed for students who have completed intermediate Hindi. The course enhances all four language skills through a focus on culture delivered via various forms of the media. The teaching material for the course will largely include segments from Hindi films, soap operas, Music TV, cine magazines or related items from newspapers in Hindi.Students who take this course for Language Citation (in Hindi) notation must complete written course work in Hindi.", "prerequisites": "HIN313H5 or permission of instructor."}, {"name": "HIN412Y5 • Advanced Hindi", "description": "This course is designed for students who already have a good knowledge of Hindi; it offers them an opportunity to effectively use the knowledge attained in previous years to read and understand advanced texts in sociocultural and literary studies, and engage in discussing issues pertaining to modern Indian society.", "prerequisites": "HIN312Y5"}]