[{"name": "HIS299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of at least 4.0 and not more than 9.0 credits."}, {"name": "HIS301H5 • North Africa and Western Asia Before World War I", "description": "A cultural history of North Africa and Western Asia from the 1870s to World War I. This late Ottoman period, known in Europe as thefin de siècle, was marked by imperialisms, nationalisms, and revolutions, as well as anxiety and alienation, environmental degradation, famine, and genocide.", "prerequisites": "HIS201H5"}, {"name": "HIS305H5 • 1898: Empires and Conflict in Global History", "description": "The Klondike Gold Rush, imperial conflict in North Africa, and the Spanish American War: 1898 is a pivotal year in global history. This course investigates the circuits of empire, capitalism, and environmental extraction in a rapidly industrializing and increasingly interconnected world.", "prerequisites": "HIS201H5"}, {"name": "HIS306H5 • The Cold War", "description": "This course will review the alliance systems and conflicts that dominated international relations in the period 1945-1991. It will examine specific incidents such as the Berlin Blockade and Airlift of 1948-49, the Hungarian uprising of 1956, the Cuban Missile Crisis, the Vietnam War, and the Prague Spring, as well as the broader strategies and tactics that followed by the two superpowers and their allies. Particular attention will be given to the documentary evidence that has been declassified in the past two decades, and the light it sheds on earlier developments.", "prerequisites": "HIS201H5"}, {"name": "HIS307H5 • The Russian Revolutions of 1917", "description": "The fall of the Romanovs and the coming to power of the Bolsheviks have been controversial. This course examines interpretations of the 1917 events using original sources from 1917 in English.", "prerequisites": "A course in modern European history."}, {"name": "HIS308H5 • Themes in the History of Women Before 1800", "description": "This course focuses on the history of women before the 19th century emphasizing select themes in ancient, medieval, and early modern history.", "prerequisites": "A course in modern European history."}, {"name": "HIS310H5 • The History of Women Since 1800", "description": "This course is a brief survey of the history of women in since 1800 emphasizing select themes in modern history.", "prerequisites": "A course in modern European history."}, {"name": "HIS315H5 • Indigenous Peoples and Immigrants in Canada", "description": "This course examines the intertwined social, cultural, economic, and political histories of Indigenous peoples and immigrants in Canada. It explores the influence on lived experience of a wide variety of phenomena and ideas including community, place, indigeneity, ethnicity, gender, colonialism, empire, and mobility from the distant to the present.", "prerequisites": "A course in modern European history."}, {"name": "HIS318H5 • Canadian Environmental History: Contact to Conservation", "description": "This course focuses on the interaction of people and the environment. Themes include environmental change as a result of: European exploration and settlement; the transfer of animals, plants and diseases; the impact of contact and the \"Columbian exchange\" on indigenous peoples; the fur trade; the lumber industry; the destruction of the bison, the reserves system, and immigrant settlers in the West; the emergence of the conservation movement in Canada.", "prerequisites": "8.0 credits"}, {"name": "HIS319H5 • Canadian Environmental History:  Conservation to the Modern Environmental Movement", "description": "This course focuses on the interaction of people and the environment in the 20th Century. Themes include the environmental impact of industrialization, urbanization, and the revolution in transportation, and of resource development in the mining, oil, and gas industries; the destruction and preservation of wildlife; parks and the wilderness idea; the modern environmental movement; the contested world of modern agriculture and the food industry; the collapse of the fisheries; Canadian public policy, environmental law, and Canada's international role concerning the environment.", "prerequisites": "8.0 credits"}, {"name": "HIS321H5 • Medieval and Early Modern Scotland", "description": "This course examines the political, social, cultural, and religious history of Scotland during the medieval and early modern periods. Topics include the Anglo-Norman impact, the Wars of Independence, Stewart monarchy, the growth of towns and trade, Highlands and Lowlands, the medieval Church, the Protestant Reformation, and Union with England.", "prerequisites": "0.5 HIS credit"}, {"name": "HIS323H5 • The Rwandan Genocide: History, Violence, and Identity", "description": "This course examines the 1994 Rwandan Genocide, situated within larger historical frameworks of the nature of precolonial polities, the impact of colonialism, and the crises of postcolonial state building. Through a close examination of primary sources and historical arguments, this course will explore history and memory, violence and trauma, identity and belonging, justice and reconciliation.", "prerequisites": "0.5 HIS credit"}, {"name": "HIS324H5 • Settler Colonialism, Violence, and Revolution: The Mau Mau Rebellion in Kenya", "description": "This course examines colonial violence and revolution through the case of the Mau Mau Rebellion in Kenya. Through an examination of primary sources and historical arguments, this course explores settler colonialism; local moral economies and land; gender and generational conflict; propaganda and revolutionary thought; and decolonization, memory, and contemporary legacies of Mau Mau.", "prerequisites": "0.5 HIS credit"}, {"name": "HIS325H5 • Modern African History", "description": "Looking at the last one hundred years of modern African history, this course will examine the consolidation of colonial societies; transformations in gender, sexuality and identity politics; the roots of ethnic patriotisms, racial ideologies and African nationalisms; the role of violence in colonial and postcolonial governance; and the contemporary in historical perspective.", "prerequisites": "0.5 HIS credit"}, {"name": "HIS326H5 • History of Women in Canada", "description": "A course on the experiences of women in what is now Canada, from the deep past through the twentieth century. It addresses questions related to the many roles women occupied in Indigenous and settler societies and how these have changed over time. The course explores political, social, and cultural movements alongside personal relationships and lives.", "prerequisites": "0.5 HIS credit"}, {"name": "HIS327H5 • The Early Medieval World", "description": "Disorder, destruction, the dissolution of old and the creation of new societies, and a cultural revival that continues to influence intellectual and literary traditions: these are the big themes examined in this history of the early medieval world.", "prerequisites": {"and": [], "or": ["CLA231H5", "CLA370H5", "HIS221H5."]}}, {"name": "HIS330H5 • Politics and Political Change in Latin America", "description": "Examines major movements and cultures in Latin American politics from independence to present day. Topics include: nineteenth-century militarism; revolutionary socialism in Cuba and Nicaragua; military dictatorships in Argentina, Brazil and Chile; and recent grassroots and transnational political movements. Emphasizes the integral roles of gender, race and the United States in the region's political processes.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS336H5 • The Imperial Victorian World", "description": "This course investigates the development of British politics and the emergence of its global empire from the early nineteenth century to 1900. It engages with key historical issues such as the development of representative government, imperialism, colonial relationships, the industrial revolution, and new political ideologies (i.e. conservativism, liberalism, socialism).", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS337H5 • History of Information and Media", "description": "In (mis)information age, it seems that the more we know, the less we understand. This course examines how data, fact, and information all have their own history, and that their production and circulation are shaped by politics, emotion, capital, as well as mediated by technology.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS338H5 • The Holocaust in Nazi Germany and Occupied Europe", "description": "This course provides an expansive survey of the Nazi extermination of European Jews, including the ideological underpinnings of the genocide; the policies leading up to the \"Final Solution\" in Germany and the rest of Europe, a broad overview of the varied reactions and policies of many countries throughout Europe, the role of the Vatican and the response of the Jews themselves as well as the international community; the motivation of the perpetrators; and the complexities of survival in the ghettoes and concentration camps.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS339H5 • Postwar Germany, 1945-present", "description": "This course will explore the history of Germany beginning in 1945. We will examine the evolution of Germany from a dictatorship to a divided state by looking at Allied Policies in the 1940s, the economic wonder of the 1950s, and the tensions between East and West Germany until the fall of the Berlin wall in 1989. This course will look at both East and West Germany's very different confrontations with the Nazi past, the student movement of the 1960s, domestic terrorism in the 1970s, the breakdown of communism in the 1980s, and the growing pains of reunification that exist to the present day. All of these developments will be seen through legal, political, cultural, and media trends.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS340H5 • The Reformation in Europe", "description": "The focus of this course will be the religious movements of sixteenth century that are described collectively as the Reformation: Lutheranism, Calvinism, the Radical Reformation and the Counter-Reformation.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS341H5 • England in the Age of Reformation and Revolution", "description": "Tudor and Stuart England (1485-1714) is a transformative period in English history. From the reign of Henry VIII, the Reformation, and the Scientific Revolution, to the execution of Charles I and the Glorious Revolution, this course charts out England’s dramatic development from peripheral backwater to emerging world superpower.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS342H5 • History of Quebec and French Canada", "description": "This course examines the history of French Canada, focusing in particular on the period from the 1830s to the present. It explores questions of culture, political community, language, and geography, looking to these aspects of historical experience to situate Quebec and French Canada with respect to North America’s English-speaking majority as well as to the French-speaking nations of Europe, Africa, and elsewhere in the Americas. Proficiency in French is not required for students enrolled inHIS342H5, though those with French-language skills will be given the opportunity to work with French-language material. This course is taught in conjunction withFRE342H5.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS355H5 • Histories of Extraction and the Future of the Environment", "description": "This course uses Indigenous, transnational and feminist frameworks to examine colonialism’s impact on the environment. From Turtle Island (Canada/U.S.) to Aotearoa (New Zealand), this course dismantles colonial histories, extractive industries and the state apparatuses that govern our relationship to the environment to form alternative understandings of environmental histories and futures.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS357H5 • The Renaissance", "description": "A cultural history of the 15th and 16th centuries set against the socio-economic background. The course will concentrate upon the development of the Renaissance in Italy and will deal with its manifestations in Northern Europe.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS358H5 • Canada Since World War Two", "description": "This course examines Canadian developments in the post-war period. It explores the tremendous economic expansion in that period. It surveys trends in immigration and urban development. The course also examines social movements and social change, as well as the growth of nationalism in Canada and Quebec.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS366H5 • Diasporic Histories & Cultures", "description": "This course explores a number of significant historic diasporas - and sites of diaspora - from Constantinople to Al-Andalus to Shanghai, to the United States and the United Kingdom, and to Tel Aviv and the West Bank, through historical record, fiction, memoir and film.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS367H5 • Diasporic Canada", "description": "This course explores the history of Canada as a recipient of diasporic communities, arriving from many parts of the world and bringing a great variety of cultures and experiences.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS369H5 • Great Lakes Aboriginal History", "description": "Algonkian and Iroquoian history from the eve of European contact to the present in the Great Lakes region of today's Canada and the United States. Algonkian and Iroquoian societies in the 16th century, change over time, material culture, and inter-cultural relations among natives and between natives and Euroamericans.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS371H5 • The Americas: Interaction and Inequality", "description": "An introduction to the history of Americas (the present-day territories of the Caribbean, Canada, Latin America and the United States) from pre-conquest indigenous societies to the end of the 20th century. This course will explore the Americas as a zone of connection and interaction between people of distinct environments, cultures and experiences. It surveys the historical continuities and transformations within the region and its linkages to increasingly globalized networks of culture, communication and commerce.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS372H5 • The United States in the 20th Century", "description": "Major developments in the economic, social, political, and cultural life of the United States during the past century as it grew from a burgeoning industrial nation to the leading Superpower.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS374H5 • Gender and Sexuality in the US, 1945-present", "description": "This class historicizes the intersectional analysis of gendered and sexed bodies after 1945. We explore topics such as normative gender expectations; reproductive freedom; masculinities; second-wave feminism; race, class and poverty; conservative backlash; media and gender/sexuality; LGBTQ social movements; trans histories. In terms of methods, I look forward to introducing students to experiments in digital history.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS378H5 • East Asian Cities", "description": "An examination of the historical transformation of East Asian cities from the imperial to modern times. The course focuses especially on how cities have been planned, depicted, experienced.", "prerequisites": "CLA231H5 or CLA370H5 or HIS221H5."}, {"name": "HIS382H5 • Nations, Borders and Citizenship in South Asia", "description": "This course examines the emergence of the connected histories of nation-states, space and border-making in modern South Asia. It is especially interested in engaging the changing political languages, practices and contested visions of citizenship that have animated and shaped languages of space, place and belonging in South Asia.", "prerequisites": "HIS282H5"}, {"name": "HIS384H5 • International Relations in the Middle East - Regional Perspectives on the 20th Century", "description": "The discovery of oil, the establishment of the state of Israel and subsequent wars for Palestine, Pan-Arabism and Political Islam were the over-riding factors in the regional balance of power. This course examines international relations as they were shaped by state- and non-state actors in 20th Century Egypt, Saudi Arabia, Israel/Palestine, Iraq, Iran, Lebanon and Syria.", "prerequisites": {"and": [{"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}, {"and": [], "or": ["HIS201H5", "HIS236H5", "HIS282H5", "HIS290H5", "HIS295H5", "HIS306H5"]}], "or": []}}, {"name": "HIS385H5 • Orientalism and Occidentalism", "description": "This course reflects on Edward W. Said's seminal Study Orientalism. The first part focuses on the debates around academic representations of the Orient before and after Said's intervention: his critics, alternative perspectives and methodological elaborations. The second part dissects the ways in which Orientalism inhabits political forms of belonging such as romantic nationalism or Islamic fundamentalism, as well as colonial constructions of liberalism, race, gender and sexuality. The third part examines the ramifications of Orientalist knowledge production in the media and in visual culture. The course also raises questions of strategic reversals of Orientalism, and to what extent Occidentalism can be considered the non-Western equivalent to Western constructions of Otherness.", "prerequisites": "HIS201H5"}, {"name": "HIS386H5 • Gender and History in South Asia", "description": "This course seeks to understand the manifold ways in which gender has shaped South Asian history, with a particular emphasis on the period from the colonial era to contemporary times. The themes will include the relationship between gender, kinship, society and politics on the one hand and race, imperialism, nationalism, popular movements and religion on the other.", "prerequisites": "HIS282H5"}, {"name": "HIS388H5 • Histories of Modern Hinduism in South Asia", "description": "This course examines the social, cultural and political history of Hinduism since 1800. Themes include Hindu socio-reform and political movements, public and popular engagements with Hinduism, and the role of religious institutions, sites, beliefs and rituals in crafting contestatory Hindu 'publics' and ideologies. It emphasizes the nexus between gender, class, caste, region and the language of religion in shaping national and transnational political and cultural identities.", "prerequisites": {"and": [], "or": ["HIS282H5", "RLG205H5"]}}, {"name": "HIS389H5 • Localities, Regions and Nations in South Asia", "description": "This course foregrounds and examines the role of localities and regions in forging social, cultural and political identities and cartographies in South Asian history before and after colonial rule. The course examines the shifting relationship between localities, regions and empires from 1200-1800, and thereafter in the era of colonialism, nationalism and post colonial nation-states. The course is especially interested in how social groups from the margins shaped, or alternatively contested political and spatial articulations of region, locality and nations.", "prerequisites": "HIS282H5"}, {"name": "HIS390H5 • Revolutions and Nations in Latin America", "description": "Examines social revolutions in Guatemala, Bolivia, Cuba and Nicaragua. It emphasizes the historical linkages between these revolutions and national identity, and stresses the roles of gender, race and the United States in revolutionary processes. This course considers as well the counterrevolutionary politics of the 1970s and 1980s in Central America and the Southern cone.", "prerequisites": "HIS282H5"}, {"name": "HIS391H5 • Mexico from Aztec to Zapatista", "description": "This course examines the origins and evolution of Mexican society, from its prehispanic empires to the Mexican Revolution (1910-1940). Drawing on primary sources, literature, films and secondary texts, the course will track a set of historical themes, including ethnic identity, Catholicism, economic development and migration.", "prerequisites": "HIS290H5"}, {"name": "HIS392H5 • Topics in Global History", "description": "An examination of global historical issues. Content in any given year depends on instructor. See Department of Historical Studies web site athttp://www.utm.utoronto.ca/historical-studiesfor details.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS393H5 • Slavery and the American South", "description": "An examination of the role of slavery in the development of the American South from the early colonial period through the Civil War. Among the topics to be dealt with are: the origins of slavery, the emergence of a plantation economy, the rise of a slaveholding elite, the structure of the slave community, and the origins of the war.", "prerequisites": {"and": [], "or": ["HIS271H5", "HIS272H5", "HIS272Y5"]}}, {"name": "HIS395H5 • Topics in History", "description": "An in-depth examination of historical issues. Content in any given year depends on instructor. See Department of Historical Studies web site atwww.utm.utoronto.ca/historicalstudiesfor details.", "prerequisites": "HIS271H5 or HIS272H5 or HIS272Y5"}, {"name": "HIS396H5 • Modernity and Islam", "description": "The aim of this course is to engage students in the ongoing historiographical debates on modernity and Islam. Students will critically explore recent public discussions concerning \"Islamic Fundamentalism,\" \"Islamic Feminism,\" and \"What Went Wrong\" in the Islamic world.", "prerequisites": {"and": [{"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}, "HIS201H5"], "or": []}}, {"name": "HIS397H5 • Iran's Islamic Revolution", "description": "This course explores the making of the Iranian Revolution of 1978-79 and the subsequent establishment of the Islamic Republic. Framed in a comparative perspective, it explains the cultural and political peculiarities that shaped the Islamist outcome of the Revolution. It examines the staging of the hostage crisis, the Iran-Iraq War, and the secularization of private lives.", "prerequisites": "HIS201H5"}, {"name": "HIS398H5 • South Asia in Motion: Circulation, Mobility, Histories", "description": "This course examines how the movement of peoples, goods and ideas across land and sea has shaped South Asia’s history. In particular it analyses how far-reaching networks based on trade, pilgrimage, patronage, politics and labour that passed through the Indian Ocean, Bay of Bengal, and the Himalayas connected South Asia to Southeast Asia, and East Asia, amongst other spaces. It also foregrounds how these histories of mobility changed under colonial rule and its aftermath. The course focuses on the period from 1200 until the present.", "prerequisites": "HIS282H5"}, {"name": "HIS399Y5 • Research Opportunity Program", "description": "For senior undergraduate students who have developed some knowledge of a discipline and its research methods, this course offers an opportunity to work on the research project of a professor. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. Project descriptions for the following fall-winter session are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of a minimum of 8.0 to 10.0 credits. (Amended)"}, {"name": "HIS401H5 • Missionaries and Colonization in New France", "description": "The relationship between missionaries and colonization in New France was complicated and contested. This course will explore the links between missionary activities and colonial designs through late medieval and early modern European ideas of religion and expansion; early encounters between Indigenous peoples and Europeans; French attempts at settlement; cooperation and conflict between missionaries and the Crown; similarities and differences among different missionary groups; and Indigenous responses to missionary efforts.", "prerequisites": {"and": ["HIS108H5"], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS230H5", "HIS261H5", "HIS262H5", "HIS263Y5."]}}, {"name": "HIS402H5 • Topics in the History of French Canada", "description": "An in-depth examination of historical issues in French Canadian history. Content in any given year depends on the instructor. Details of each year's offering will be on the Department web site.", "prerequisites": {"and": [{"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}, {"and": [], "or": ["HIS261H5", "HIS262H5", "HIS263Y5"]}], "or": []}}, {"name": "HIS405H5 • Microhistory", "description": "Microhistory focuses on a small part of the past to address big questions. By encouraging us to examine evidence up close, it provides a powerful way to investigate the rich texture of earlier societies and think about connections with our own time. This course considers classic microhistorical studies as well as more recent works, balancing theories with examples of the approach.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS407H5 • Imperial Germany 1871-1918", "description": "This course will explore Germany's history beginning with its unification and trace the events that led to the First World War and the end of the Imperial era. We will examine the Imperial period through various different focal points including unification and the legacy of Bismarck and Kaiser Wilhelm II, the Sonderweg debate, gender, nationalism, German Jews and the birth of modern antisemitism, German's brief colonial era, the path to war and the revolution of 1918. By reading historical texts, articles, and novels, and by addressing numerous historiographical debates, we will attempt to understand Germany's foundational period in the context of this country's troubled history.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS409H5 • The Life Cycle in Medieval and Early Modern Europe", "description": "This course examines the daily lives of medieval and early modern Europeans as they moved through birth, infancy, childhood, adolescence, marriage, adulthood, old age and death. Special attention is given to the ways in which gender, social status and local custom shaped thoughts and experiences throughout the life cycle.", "prerequisites": "(HIS101H5 or HIS102H5 or HIS103H5 or HIS104H5 or HIS105H5 or HIS106H5 or HIS107H5 or HIS108H5) and 0.5 credit in medieval or early modern Europe."}, {"name": "HIS410H5 • Doing Digital History", "description": "How have Web 2.0 technologies changed the practice of history? Students learn by doing in this course: researching and writing for the digital medium; learning about the theory and practice of digital history; experimenting with new technologies; and creating a digital history project.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS420H5 • Topics in Medieval History", "description": "Critical evaluation of selected legal, literary and narrative sources. Thematic content will vary from year to year, but there will be an emphasis on social history.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS431H5 • Global China", "description": "A critical examination of the making and remaking of China from the eighteenth century to the present. Emphasis will be given to historical literature on colonialism, nationalism, revolution, and global connections.", "prerequisites": {"and": [{"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}, "HIS284H5"], "or": []}}, {"name": "HIS435H5 • The Viking Age", "description": "A seminar on the history of Europe from the eighth to the eleventh centuries with emphasis upon the Scandinavians and their relations with western European civilization. Readings will be in both primary and secondary sources.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS438H5 • Remembering Atrocity: The Holocaust and Historical Memory in Europe and North America", "description": "This course will examine how Europe and North America confronts the Holocaust through the law, literature, left wing agitation, film, memorials and museums, and political debates. Among the focal points: the Nuremberg and postwar West German trials of Nazis, the fascination with Anne Frank, anti-fascist terror in 1970s Germany, The Berlin Memorial and the US Holocaust Museum, and films such as The Pianist and Schindler's List.", "prerequisites": {"and": [{"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}, {"and": [], "or": ["HIS242H5", "HIS338H5", "HIS339H5"]}], "or": []}}, {"name": "HIS448H5 • Memory, History and South Asia's Contested Pasts", "description": "This course focuses on the relationship between memory and the \"traditions\" of historical writing and remembering in the sub continent from 1200 to the present. It also focuses on the role of politics in mediating the region's multiple, often contesting histories in our period of study.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS453H5 • The Klondike Gold Rush", "description": "This course investigates the Klondike Gold Rush (Alaska-Yukon, 1896-1900) through the lenses of North American borderlands, environmental, and indigenous history. By viewing the gold rush in the context of growing national and imperial expansion, we will see it was an essential component of a much larger historical process centering on settlement, development, and dispossession.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS454H5 • Race, Gender and Nation in Modern Latin America", "description": "This seminar examines the interconnected histories of race, gender and nation in Latin America. It studies the significance of race/racism and gender/patriarchy in the construction of national societies in Latin America during the nineteenth and twentieth centuries. Subtopics include: slavery and Indian servitude; acculturation and eugenics; immigration and urbanization; machismo and marianismo; and current Indian and women's movements.", "prerequisites": {"and": [{"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}, "HIS290H5"], "or": []}}, {"name": "HIS462H5 • Indigenous North America", "description": "This reading and research-based course focuses on the history of Indigenous peoples in Canada and the United States, while also considering Mexico and the Caribbean. It explores a wide variety of methodologies and topics, examining Indigenous social structures, cultures, and economies alongside the influence of colonialism, capitalism, and nation states.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS463H5 • Memory and Memorialization in South African History", "description": "This course examines the histories of South Africa through the lens of memory and memorialization. Major themes include gender and sexuality, race and nationalisms, youth and resistance, violence and trauma, the intersections and disconnections between different forms of memory (historical, collective, social) and their relationship to historical methodology and practice.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS464H5 • Decolonizing Africa", "description": "This research-intensive seminar looks at alternative histories of decolonization in Africa, including revolutionary nationalisms, secessionist movements, and pan-Africanism– as well as ongoing debates over boundaries, citizenship, and sovereignty in postcolonial Africa.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS475H5 • The French Revolution", "description": "A topical survey of the French Revolution dealing with the uprising in France and its repercussions elsewhere by examining such subjects as its causes, its effect on nations, classes and gender, and its relation to nationalism, socialism and democracy.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS479H5 • Cold War America", "description": "An examination of significant political, economic, social and intellectual developments, including Cold War Foreign policies, economic and social reforms, McCarthyism, the Civil Rights movement, women's liberation, the \"counter-culture,\"and the Indochina Wars.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS480H5 • Partition and its Aftermath in South Asia", "description": "This course examines the everyday effects of the partition of 1947, and its aftermath, when British India gained independence and was also crafted into new nation states. Amongst other issues, it engages with sexual violence, nation-making, territoriality, rehabilitation, citizenship, and spatiality. More broadly it connects these issues to space, place and historical memory.", "prerequisites": {"and": ["HIS108H5", "HIS282H5."], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5"]}}, {"name": "HIS483H5 • Colonialism in East Asia", "description": "This course examines the ideologies and practices of colonialisms, both internal and external, in modern East Asia.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS484H5 • Religion and Public Culture in South Asian History", "description": "The course examines the role played by religion in shaping public culture and everyday practice in South Asian history. It studies key themes on the subject against a longue-duree perspective.", "prerequisites": {"and": ["HIS104H5", "HIS282H5"], "or": ["HIS101H5", "HIS102H5", "HIS103H5"]}}, {"name": "HIS489Y5 • History Honours Thesis", "description": "Working closely with a faculty member, students choose a topic, develop a research question, conduct original and independent research using both primary and secondary sources, and write a thesis of approximately 60 pages.", "prerequisites": "Students must obtain a mark of 77% in each of 4.0 History credits and permission of the instructor."}, {"name": "HIS490H5 • Religion and Society in Latin America", "description": "An interdisciplinary seminar that examines religion and its historical role in shaping culture, society, and politics in Latin America. It considers both the formal institutional practice of religion as well as informal and popular religiosities. A framing theme of the course is the complex relationship between Church and State - and more broadly, between religion and politics - in the region.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS493H5 • Advanced Topics in Global History", "description": "An in-depth examination of historical issues. Content in any given year depends on instructor. See Department of Historical Studies website atwww.utm.utoronto.ca/historicalstudiesfor details.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS494H5 • Advanced Topics in the History of the Americas", "description": "An in-depth examination of historical issues. Content in any given year depends on instructor. See Department of Historical Studies website atwww.utm.utoronto.ca/historicalstudiesfor details.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS495H5 • Advanced Topics in European History", "description": "An in-depth examination of historical issues. Content in any given year depends on instructor. See Department of Historical Studies website atwww.utm.utoronto.ca/historicalstudiesfor details.", "prerequisites": {"and": [], "or": ["HIS101H5", "HIS102H5", "HIS103H5", "HIS104H5", "HIS105H5", "HIS106H5", "HIS107H5", "HIS108H5"]}}, {"name": "HIS497Y5 • Independent Reading", "description": "Student-initiated project of reading and research, supervised by a member of the Department. Primarily intended for students in Specialist or Major programs. After obtaining a supervisor, a student must apply to the Department of Historical Studies. A maximum of 1.0 credit in a reading course is permitted.", "prerequisites": "HIS101H5 or HIS102H5 or HIS103H5 or HIS104H5 or HIS105H5 or HIS106H5 or HIS107H5 or HIS108H5"}, {"name": "HIS498Y5 • Internship in History", "description": "Through a part-time, unpaid work placement, a limited number of advanced history students may enrol for field experience relating to expertise they have gained in the program. Placements are made at local libraries, historic sites and foundations, media outlets, public and private institutions. Five previous history courses and a cumulative GPA of 3.0 are required. For application to admission contact the Department of Historical Studies before June 1.", "prerequisites": "(HIS101H5 or HIS102H5 or HIS103H5 or HIS104H5 or HIS105H5 or HIS106H5 or HIS107H5 or HIS108H5) and 5.0 additional HIS credits and a CGPA of 3.0."}, {"name": "HIS499H5 • Independent Reading", "description": "Student-initiated project of reading and research, supervised by a member of the Department. Primarily intended for students in History Specialist, Joint Specialist or Major programs. After obtaining a supervisor, a student must apply to the Department of Historical Studies. A maximum of 2 reading courses, amounting to 1.0 credit, is permitted.", "prerequisites": "(HIS101H5 or HIS102H5 or HIS103H5 or HIS104H5 or HIS105H5 or HIS106H5 or HIS107H5 or HIS108H5) and 5.0 additional HIS credits and a CGPA of 3.0."}, {"name": "HIS499Y5 • Research Opportunity Program", "description": "For senior undergraduate students who have developed some knowledge of a discipline and its research methods, this course offers an opportunity to work on the research project of a professor. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. Project descriptions for the following fall-winter session are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of a minimum of 8.0 to 10.0 credits. (Amended)"}, {"name": "JBH471H5 • Worlds Colliding: The History and Ecology of Exploration, Contact, and Exchange", "description": "An examination of contact in world history through both an ecological and a historical lens. Precise topics will depend on the year, but the focus will be on the creation of global systems and ecological challenges that continue to shape our world. In some years, students may have the option of participating in an international learning experience during Reading Week that will have an additional cost and application process. Students interested in this course will need to be approved for enrollment by the department and course instructors.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}]