[{"name": "GLB201H5 • Global Leadership: Past, Present, Futures", "description": "The evolution and exercise of leadership is examined in the context of globalization. Terminology, case studies, and practical examples are used to consider questions such as: Why did globalization become a dominant frame? How have narratives of globalization changed over time? How does late 20th century globalization differ from earlier processes of colonization? What are expectations going forward? The assumed scale of globalization and how it manifests differently in various geographies, societies, and contexts is assessed. Students reflect on the uneven experiences of globalization in their own lives, communities, and worlds they observe and pass through. Students challenge ideas of how good leadership is conceived, the dynamics that are assumed (e.g., leaders and followers), and who/what might be left out (e.g., gender, race, class), today and in the future.", "prerequisites": "Completion of 4.0 credits."}, {"name": "PUN212Y5 • Introductory Punjabi", "description": "An introduction to the Punjabi language and is designed for students with little or no prior knowledge of Punjabi. Basic grammatical structures and conversational skills will be introduced as well as the gurmukhi script in which Punjabi is most commonly written. Contextual background about the history of Punjabi and the various contexts in which it has been used will also be discussed in class.", "prerequisites": "Completion of 4.0 credits."}, {"name": "SAN291Y5 • Introductory Sanskrit", "description": "This course introduces students to the basic grammar of the classical Sanskrit language. Students will engage with its phonology (including pronunciation, sandhi, and metrics) and morphology (including word formation, nominal declension, and verbal conjugation). Students will apply their grammatical knowledge and analytic skills to the reading of basic Sanskrit texts. By the end of the course, students will be able to read simple, narrative Sanskrit.", "prerequisites": "Completion of 4.0 credits."}, {"name": "SAN392Y5 • Intermediate Sanskrit", "description": "This course is a continuation of Introductory Sanskrit. It deepens students' knowledge of the phonology, morphology, and syntax of classical Sanskrit using both western and Indian linguistic terminology as descriptive devices. Students will apply their deeper grammatical knowledge and sharpened analytic skills to the reading of a variety of Sanskrit genres. This course counts towards LIN Major and Minor programs.", "prerequisites": {"and": [{"and": [], "or": ["SAN291Y5", "RLG260Y1"]}, "RLG260H1", "RLG263H1."], "or": []}}, {"name": "URD212Y5 • Introduction to Urdu", "description": "This course is for students who have no background knowledge in Urdu. The course provides students with basic information about the Urdu language paying particular attention to literacy skills, i.e. reading and writing in Urdu. Students start by learning how to write and pronounce the alphabet and how to connect letters to form new words. Then, they learn basic vocabulary in Urdu in order to express basic ideas orally and in writing. By the end of the course, students should be able to write simple sentences to express basic information, and they should be able to conduct basic conversations in Urdu.All students MUST complete the Urdu Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…) before enrolling in URD course for the FIRST time.", "prerequisites": "All students who are enrolling in an URD language course for the first time MUST complete the Urdu Language Assessment Questionnaire ((https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}, {"name": "URD312Y5 • Intermediate Urdu", "description": "In this course, students will continue developing skills in spoken and written Urdu with the study of more complex grammar. Students will continue to build vocabulary and advance their ability in literary and colloquial forms of the language.Students who have not completed the listed prerequisite ofURD212Y5are REQUIRED to complete the Urdu Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…) by no later than August 29th. Late assessment submissions will not be accepted.", "prerequisites": "URD212Y5 or appropriate language level as indicated by the Urdu Language Assessment Questionnaire ((https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}]