[{"name": "FRE227H5 • Teaching and Learning a Second/Foreign Language", "description": "This course provides an introduction to second language pedagogy with a particular focus on French. Students will learn key concepts in pedagogy and compare the teaching and learning processes and experiences of first and second language learners as well as the roles of classroom teachers and learners via the creation of linguistic portraits and pedagogical materials.", "prerequisites": {"and": [], "or": ["FRE181H5", "FSL305Y5", "FSL306H5"]}}, {"name": "FRE325H5 • Talking like a child: language acquisition of French", "description": "We might not remember how we learned our first language(s)but we knowit/them so well…Or do we? We take the child’sperspective inlanguagelearning, focusingonthe following topics: the acquisition of grammar, the development of communicative skills,the development of a language in a multilingual environment (as a majority language versusa heritage language),the differences and similarities between simultaneous and successive language acquisition.", "prerequisites": "((FRE272H5 or FRE272Y5) and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE352H5 • Teaching French Grammar", "description": "This course examines practical and theoretical issues surrounding grammar in the language curriculum such as various approaches to the implementation of grammar in language curricula, such as in grammar-translation or task-based learning; the role and limitations of descriptive grammar, including pedagogical grammar; form focus versus meaning focus; interference and error analysis; feedback on errors. Students will be asked to critique and create teaching materials.", "prerequisites": "(FRE227H5 and (FRE272H5 or FRE272Y5) and [FRE280Y or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE354H5 • Teaching French in a Plurilingual Context", "description": "This course allows students to explore innovative pedagogical approaches such as the Action Oriented and Plurilingual & Pluricultural Approaches, building on knowledge and skills acquired inFRE227H5Teaching and Learning a Second/Foreign Language. This is accomplished through the examination of the linguistic and cultural diversity observed in French Language classes today, and the discovery of innovative and current teaching approaches followed by the creation of pedagogical materials. Particular emphasis is placed on students’ abilities to transfer knowledge into practice.", "prerequisites": {"and": [], "or": ["FRE227H5", "FRE272Y5"]}}, {"name": "FRE355H5 • Psycholinguistics: multilingual learners in action", "description": "This courseprovides an introduction toreal-time language interaction in multilingual comprehension and production. A primary focus will be on language development, spoken and written language processing, the organisation of multilingual memory, and the main experimental methods in psycholinguistics.", "prerequisites": "((FRE272H5 or FRE272Y5) and [FRE280Y5 or (FRE282H5 and FRE283H5)]) or a minimum grade of 77% in FSL406H5"}, {"name": "FRE453H5 • Teaching French Culture", "description": "This advanced research course deepens students’ theoretical and practical background in language pedagogy, exploring research questions related to issues surrounding the integration of culture in the language curriculum including the relationship between authentic language and culture, and the role of linguistic and cultural diversity in education. Students will learn to critique and create teaching materials and undertake an independent research project.", "prerequisites": "FRE354H5 and 0.5 credit at the 300-level from among the FRE Language Teaching and Learning courses."}, {"name": "ITA493H5 • Senior Project: Teaching and Learning Language", "description": "A close, practical study in which students observe, actively participate in, and reflect on the teaching and learning processes in an Italian language course, under the supervision of a member of the Italian Studies program. Students develop and implement strategies for the successful delivery of lesson plans and grammatical and communicative activities.", "prerequisites": "(1.0 credit from ITA350H5 or ITA351H5 or ITA352H5) or permission from the program coordinator of Italian."}, {"name": "ITA494H5 • Senior Project: Teaching and Learning Cinema, Literature, or Theatre", "description": "A close, practical study in which students observe, actively participate in, and reflect on the teaching and learning processes in an Italian cinema, literature, or theatre course, under the supervision of a member of the Italian Studies program. Students develop and implement strategies for the successful delivery of lesson plans and discussion-based activities.", "prerequisites": "(1.0 credit from ITA350H5 or ITA351H5 or ITA352H5) or permission from the program coordinator of Italian."}, {"name": "LTL100H5 • Introduction to Language Teaching, Learning and Assessment", "description": "This course provides students with foundational knowledge and skills for the study of second language teaching, learning, and assessment. Students will learn to describe language structure and use including among learners, identify major phenomena of non-native language learning, and discuss principles and best practices in second language teaching and assessment.", "prerequisites": "(1.0 credit from ITA350H5 or ITA351H5 or ITA352H5) or permission from the program coordinator of Italian."}, {"name": "LTL227H5 • Teaching and Learning a Second/Foreign Language", "description": "This course provides an introduction to second language pedagogy. Students will learn key concepts in pedagogy and compare the teaching and learning processes and experiences of first and second language learners as well as the roles of classroom teachers and learners via the creation of linguistic portraits and pedagogical materials.", "prerequisites": "LTL100H5"}, {"name": "LTL380H5 • Theoretical Issues In Second Language Teaching and Learning", "description": "This course examines theoretical research on adult second language learning and the resultant implications for second language teaching. Topics include age, affect, communicative competence, and sociolinguistics. Links are drawn to pedagogical practices, including error correction, materials selection, and order and method of presentation. This course is taught in English and is open to students from other disciplines. Written work to be completed in French/Italian for credit towards a Specialist (French or Italian) or Major (French/Italian).", "prerequisites": "FRE227H5 and (FRE282H5 and FRE283H5) or (ITA200Y5 and an additional 0.5 credit in ITA at the 200-level or higher)."}, {"name": "LTL381H5 • Methodologies for Teaching English as a Second Language", "description": "This course provides an overview of classroom teaching methods, techniques and strategies for English as a second language, as well as ways of creating and adapting materials to particular teaching contexts such as English-as-a-second-language (ESL) in Canada, English for Academic Purposes (EAP), English for Specific Purposes (ESP), English-as-a-Foreign-Language (EFL) abroad, and blended teaching. Theoretical issues and classroom implications for teaching and learning with technology will be discussed. Classroom management techniques will also be examined, along with ways to access and work with classroom management and technology-related resources.", "prerequisites": "(LIN101H5 and LIN102H5 and a minimum of 0.5 credit in LIN or LTL at the 200-level or higher) or [(FRE282H5 and FRE283H5) and FRE227H5] or (ITA200Y5 and an additional 0.5 credit in ITA at the 200-level or higher)"}, {"name": "LTL382H5 • Teaching Second Language Speaking and Listening", "description": "This course examines theories and practices related to the teaching and learning of speaking and listening in a second language, particularly with reference to English. The course will focus on the theoretical and research-based underpinnings of second language speaking and listening on the ways in which instruction can facilitate the development of these skills. The relationship of pronunciation to listening and listening skills will be explored, and an overview of teaching pronunciation to second language learners will be provided (particularly with reference to English).", "prerequisites": "(LIN101H5 and LIN102H5 and a minimum of 0.5 credit in LIN or LTL at the 200-level or higher) or [(FRE282H5 and FRE283H5) and FRE227H5) or (ITA200Y5 and an additional 0.5 credit in ITA at the 200-level or higher)"}, {"name": "LTL383H5 • Teaching Second Language Reading and Writing", "description": "This course examines theories and practices related to the teaching and learning of reading and writing in a second language, particularly with reference to English. The course will focus on the theoretical and research-based underpinnings of second language reading and writing and on the ways in which instruction can facilitate the development of these skills. The relationship of vocabulary to second language reading and writing will be examined (particularly with reference to English).", "prerequisites": "(LIN101H5 and LIN102H5 and a minimum of 0.5 credit in LIN or LTL at the 200-level or higher) or [(FRE282H5 and FRE283H5) and FRE227H5] or (ITA200Y5 and an additional 0.5 credit in ITA at the 200-level or higher)"}, {"name": "LTL387H5 • Theoretical Issues in Teaching and Learning Second Language Vocabulary", "description": "This course provides an overview of second language vocabulary acquisition research and the resultant implications for second language teaching. Topics include dimensions of vocabulary knowledge, incidental and intentional vocabulary learning, textbook analysis, learning strategies, and teacher beliefs about vocabulary teaching and learning. Implications are drawn for pedagogical practices, including best vocabulary teaching practices, materials selection, and measuring vocabulary knowledge. This course is taught in English and is open to students from other disciplines. Written work to be completed in French/Italian for credit towards a Specialist (French or French & Italian) or Major (French/Italian).", "prerequisites": "(FRE282H5 and FRE283H5 and FRE227H5) or (ITA200Y5 and an additional 0.5 credit in ITA at the 200-level or higher)"}, {"name": "LTL399H5 • Research Opportunity Program", "description": "This course provides senior undergraduate students who have developed some knowledge of research methods used in the discipline of Language Teaching and Learning to work in the research project of a U of T Mississauga professor for course credit. Enrolled students have the opportunity to become involved in original research, develop their research skills, and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer, fall, or winter sessions are posted on the ROP website in mid-February and students are invited to apply at that time. See Experiential and International Opportunities for more details", "prerequisites": {"and": ["LTL100H5", {"and": [], "or": ["LTL227H5", "EDS200H5", "EDS285H5"]}], "or": []}}, {"name": "LTL456H5 • Sociolinguistics and Second Language Teaching and Learning", "description": "This course considers the impact on variant use by second language learners exerted by linguistic and extra-linguistic factors, such as the surrounding linguistic context, age, sex, style, and curricular and extra-curricular exposure. Implications are drawn for second language teaching, including deciding what registers and variants to teach and what activities to employ. Written work to be completed in French/Italian for credit towards a Specialist (French or Italian) or Major (French/Italian).", "prerequisites": {"and": [{"and": [], "or": ["FRE225Y5", "FRE227H5"]}, {"and": [], "or": ["FRE280Y5", "FRE282H5"]}], "or": []}}, {"name": "LTL486H5 • Teaching and Learning Cross-Cultural Communication", "description": "This course examines cross-cultural language use by second language learners from both a theoretical and pedagogical perspective. Topics addressed include the role of pragmatic transfer between native and target languages, individual differences, learning context, and instruction in the development of second language pragmatic competence. Written work to be completed in French/Italian for credit towards a Specialist (French or Italian) or Major (French/Italian).", "prerequisites": {"and": [{"and": [], "or": ["FRE225Y5", "FRE227H5"]}, {"and": [], "or": ["FRE280Y5", "FRE282H5"]}], "or": []}}, {"name": "LTL487H5 • Second Language Pedagogy", "description": "This course offers a comprehensive survey and analysis of fundamental concepts and issues related to second, bilingual, and foreign language instruction by developing students' knowledge of second language acquisition, approaches to language teaching, computer-assisted teaching, and pedagogical design and implementation in the language classroom. Written work to be completed in French/Italian for credit towards a Specialist (French/Italian) or Major (French/Italian).", "prerequisites": {"and": [{"and": [], "or": ["FRE225Y5", "FRE227H5"]}, {"and": [], "or": ["FRE280Y5", "FRE282H5"]}], "or": []}}, {"name": "LTL488H5 • Principles and Strategies for Online Second Language Course Design", "description": "This course will conduct a critical appraisal of online course materials, and formulate appropriate pedagogical strategies for their exploitation. This course is taught in English and is open to students from other disciplines. Written work to be completed in French/Italian for credit towards a Specialist (French/Italian) or Major (French/Italian).", "prerequisites": {"and": [{"and": [], "or": ["FRE225Y5", "FRE227H5"]}, {"and": [], "or": ["FRE280Y5", "FRE282H5"]}], "or": []}}, {"name": "LTL495Y5 • Individual Project", "description": "A research or reading project undertaken by the student under the supervision of a faculty member. Written work to be completed in French/Italian for credit towards an LTL program in French or Italian.", "prerequisites": "0.5 credit at the 300 or 400 level in LTL"}, {"name": "LTL496H5 • Individual Project", "description": "A research or reading project undertaken by the student under the supervision of a faculty member. Written work to be completed in French/Italian for credit towards an LTL program in French or Italian.", "prerequisites": "0.5 credit at the 300- or 400-level in LTL"}]