[{"name": "JAL253H5 • Language and Society", "description": "This course offers an introduction to the study of the relationship between language and society with the goal of understanding language use through social structures. Working within this socially-informed perspective, topics covered will include language, perception, and identity development; verbal and non-verbal communication; speaking across cultures; language use and social networks; and language and power.This course counts towards only the English Language Linguistics Minor (ERMIN1200); it does NOT count towards the Linguistic Studies Minor (ERMIN0506) nor the Linguistic Studies Major (ERMAJ1850).", "prerequisites": {"and": [], "or": ["LIN101H5", "LIN102H5", "LIN204H5", "ANT206H5"]}}, {"name": "JAL351H5 • Language and Culture: Area study", "description": "This course offers an in-depth study of a particular region or language from a linguistic and anthropological perspective. In some cases this will involve focusing on a particular language or speech community (e.g., Vietnamese) including its historical development and the ways in which its boundaries have been defined. In other cases, it will involve a broader, regional approach (e.g., mainland Southeast Asia). Topics vary from year to year but may include semantic and grammatical structure, language variation and use, language pragmatics, poetry and poetics, literacy and orality, political discourse, historical linguistics and comparative reconstruction, language contact and shift.", "prerequisites": "ANT204H5 or ANT206H5 or JAL253H5 or LIN256H5 or permission of department"}, {"name": "JAL355H5 • Language and Gender", "description": "Ways in which gender influences the use of language and behaviour in conversational interaction: ways in which language reflects cultural beliefs about gender.", "prerequisites": {"and": [], "or": ["LIN256H5", "JAL253H5", "ANT204H5", "WGS200Y5"]}}, {"name": "JAL453H5 • Language and Social Theory", "description": "This seminar course considers the intersection of linguistics and anthropology, bringing ideas from contemporary and classical social theory to bear on questions central to both fields of study. Topics vary from year to year but may include any of the following: linguistic relativity; register formation; language variation; linguistic ideologies; racialization; political discourse; pragmatic and semiotic theory; language reform.", "prerequisites": "ANT204H5 or ANT206H5 or JAL253H5 or LIN256H5 or permission of department"}, {"name": "JFL369H5 • Romance Linguistics", "description": "Have you ever wondered how a single \"mother\" language can give rise to many different \"daughter\" languages? How do closely related languages come to be so different? What unique mix of historical events, social relationships, and language acquisition processes produces each variety?This course takes the Romance language family as a case study in language change within a well-documented language family, examining the major linguistic changes that occurred within the last 2500 years from every-day spoken Latin to the Modern Romance languages. We also consider micro-variations among both well-known and understudied Romance varieties with the aim of finding explanations involving both internal and external forces of change.No prior knowledge of Latin or a Romance language is necessary.For students in either a French Specialist or Major Programs wishing to count this course toward program requirements, must complete written work in French.", "prerequisites": {"and": [{"and": [], "or": ["LIN229H5", "FRE376H5", "FRE377H5"]}, {"and": [], "or": ["LIN232H5", "FRE378H5"]}], "or": []}}, {"name": "JFL388H5 • Bilingualism and Multiple Language Acquisition", "description": "This course examines simultaneous and successive second (and multiple) language acquisition. We will look at topics such as the bilingual brain, the nature of the input, age constraints on language acquisition, language separation and cross-linguistic influences, the status of the heritage language, schooling in a second language (for example French immersion programs), and various methods used in the study of bilingualism in individuals. Bilingual/multilingual corpora will be examined. The language of instruction will be English. Students will have the option to write assignments in either English or French. Written work to be completed in French for credit towards a Specialist (French) or Major (French).", "prerequisites": "[(LIN102H5 or FRE227H5 or FRE225Y5 or FRE272H5 or FRE272Y5) and 0.5 credit from LIN288H5 or LIN231H5 or LIN232H5 or LIN233H5] or 0.5 credit of FRE linguistic at the 300-level."}, {"name": "JFL389H5 • Second Language Assessment", "description": "This course provides an introduction to the principles and frameworks of second language assessment as well as to the practices of standardized testing and classroom assessment. We begin by discussing models of linguistic competence and frameworks for second language assessment as well as test design including language benchmarking. In the second part of the course, the focus turns to best practices in the assessment of vocabulary, grammar, comprehension, production, and socio-pragmatic competence.", "prerequisites": {"and": ["FRE272H5", {"and": [], "or": ["FRE282H5", "FRE283H5"]}], "or": []}}, {"name": "JFL454H5 • Teaching and Learning Varieties of Canadian French", "description": "(Offered in English) This course offers students the opportunity to become familiar with the primary research methods used in sociolinguistic studies, with how sociolinguistics helps to understand the properties of Canadian French, and with the pedagogical implications arising from sociolinguistic research on Canadian French. This course will contain a research-based component. Written work to be completed in French for credit towards a Specialist (French) or Major (French).", "prerequisites": "[(1.0 credit of FRE Linguistics at the 300-level or LIN256H5) and 0.5 credit of LIN at the 300-level and reading ability in French] or permission of instructor."}, {"name": "JLP285H5 • Language, Mind, & Brain", "description": "Language is often described as a quintessentially human trait. What is the mental machinery underlying this ability? In this course, you will explore questions such as: Do animals have language? How do children learn language? How do we understand and produce language in real time? How does bilingualism work? What can neuroscience tell us about language abilities? What is the relationship between language and thinking?", "prerequisites": "(LIN101H5 and LIN102H5) OR PSY100Y5"}, {"name": "JLP315H5 • Language Development", "description": "By three years of age, children have mastered many of the complexities of human language. How do they do this so rapidly, and with such ease? In this course, you will examine language acquisition from a cognitive perspective. Topics include the acquisition of speech sounds, sentence structure, and conversational abilities, as well as patterns of development in special populations. You will also learn about childhood bilingualism and social aspects of language development. Hands-on experience analyzing recordings of children will be provided.", "prerequisites": {"and": [{"and": [], "or": ["PSY201H5/equivalent", "JLP285H5/equivalent"]}, {"and": [], "or": ["PSY210H5", "PSY270H5", {"and": ["LIN101H5", "LIN102H5"], "or": []}]}], "or": []}}, {"name": "JLP383H5 • Language Processing: Words, Sentences, and Discourse", "description": "Language is a key element in our social interactions, our ability to share information, and aspects of human culture. In this course you will engage in an advanced exploration of the cognitive machinery underlying language in adulthood. Key themes include: incremental interpretation and predictive processing; the relationship between language comprehension and production; and the nature of processing in bilinguals and speakers of less-studied languages. Practical activities address experimental methodology and aspects of data analysis.", "prerequisites": "[PSY201H5/equivalent or JLP285H5/equivalent] and [JLP315H5/equivalent or JLP 384H5/equivalent or PSY270H5 or (LIN101H5 and LIN102H5)]"}, {"name": "JLP384H5 • Speech Communication", "description": "Imagine an animal species where one creature can generate thoughts in other creatures' minds simply by causing the air molecules around them to vibrate. Although this sounds exotic, it is what we as humans do every time we speak and listen. In this course, we explore the perception and production of spoken language from an interdisciplinary perspective. Sample topics include perceptual and cognitive aspects of speech communication, speech signal acoustics, audio-visual speech integration, speech sound articulation, artificial speech recognition, multilingualism, and contextual influences on speech communication. Through laboratory exercises, students will replicate classic experimental findings and gain hands-on experience with acoustic and behavioural data analysis", "prerequisites": "[PSY201H5 or LIN228H5] and 0.5 credit from [JLP285H5/equivalent or JLP383H5/equivalent or LIN229H5 or LIN318H5 or PSY270H5 or PSY280H5]"}, {"name": "JLP388H5 • Bilingualism and Multiple Language Acquisition", "description": "What are the linguistic and psychological implications of knowing more than one language? This course will explore topics such as the bilingual brain, the nature of bilingual language input, effects of age-of-acquisition and language similarity, the status of heritage languages, schooling in a second language (for example French Immersion programs), and research methodologies used in the study of bilingualism. Bilingual/multilingual corpora will be examined.", "prerequisites": {"and": [], "or": ["JLP285H5/equivalent", "JLP315H5/equivalent"]}}, {"name": "JLP481H5 • Topics in Developmental Psycholinguistics", "description": "How do children's language comprehension and production abilities differ from adults? What can research on language acquisition tell us about why language looks the way it does? Developmental psycholinguists use experimental techniques to explore a range of topics in the area of child language comprehension and production. Drawing on cutting-edge interdisciplinary research, we will explore contemporary issues and debates in this area.", "prerequisites": "(LIN288H5 or PSY274H5) and 1.0 credit from the following list: LIN318H5 or LIN328H5 or LIN329H5 or LIN332H5 or LIN385H5 or LIN418H5 or LIN421H5 or PSY315H5 or PSY374H5 or PSY384H5 or any JLP course."}, {"name": "JLP483H5 • Topics in Adult Psycholinguistics", "description": "What is the connection between comprehending, producing, and thinking about language? How do the properties of different languages influence the nature of language processing? How is processing affected by differences across individuals? Drawing on a variety of perspective and methodologies, we will explore contemporary issues and debates in these and other topics.", "prerequisites": "(LIN288H5 or PSY274H5 or JLP285H5) and 1.0 credit from the following list: (PSY315H5 or JLP315H5) or (PSY374H5 or JLP383H5) or (PSY384H5 or JFL388H5 or JLP388H5) or (LIN318H5 or LIN418H5) or JLP384H5 or JLP481H5."}, {"name": "LIN101H5 • Introduction to General Linguistics: The Sounds of Language", "description": "Lectures on fundamental principles of phonetics, phonology, and morpho-phonology with illustrations from English and a broad spectrum of other languages. Practice in elementary analytic techniques and applications from acquisition, historical linguistics, psycholinguistics, and sociolinguistics. REQUIRED COURSE FOR ANY PROGRAM IN LINGUISTICS.", "prerequisites": "This course has no prerequisites. It can be taken independently, before, or after LIN102H5."}, {"name": "LIN102H5 • Introduction to General Linguistics: Words, Sentences, their Structure and Meaning", "description": "Lectures on fundamental principles of morpho-syntax, syntax, and semantics with illustrations from English and a broad spectrum of other languages. Practice in elementary analytic techniques and applications from acquisition, historical linguistics, psycholinguistics, and sociolinguistics. REQUIRED COURSE FOR ANY PROGRAM IN LINGUISTICS.", "prerequisites": "This course has no prerequisite. It can be taken independently, before, or after LIN101H5."}, {"name": "LIN204H5 • English Grammar I", "description": "Students will learn about fundamental grammatical concepts, focusing on the major grammatical categories in English and how they interact at the phrase level. They will be introduced to the main constituents of English sentences and learn about the basic relationship between tense, aspect, and modality. Students will learn to apply this knowledge as a tool to think analytically about English, evaluating various registers and styles, and gaining an awareness of their own style of speaking and writing. Depending on the instructor, this course may be delivered fully or partially online. This course counts towards only the English Language Linguistics Minor (ERMIN1200); it does NOT count towards the Linguistic Studies Minor (ERMIN0506) nor the Linguistic Studies Major (ERMAJ1850).", "prerequisites": "This course has no prerequisite. It can be taken independently, before, or after LIN101H5."}, {"name": "LIN205H5 • English Grammar II", "description": "This course examines complex methods of sentence construction that will enable a critical analysis of English sentence structure, word and sentence meanings, and language function in communicative contexts. This course is particularly suitable for students who wish to improve their academic writing skills or who wish to teach English. This course counts towards only the English Language Linguistics Minor (ERMIN1200); it does NOT count towards the Linguistic Studies Minor (ERMIN0506) nor the Linguistic Studies Major (ERMAJ1850).", "prerequisites": "LIN204H5"}, {"name": "LIN208H5 • English Sounds", "description": "A description of the phonetic and phonological systems of varieties of English, as well as discussion of topics including dialectal variation, socio-phonetics, historical developments, and/or prosody. This course counts towards only the English Language Linguistics Minor (ERMIN1200); it does NOT count towards the Linguistic Studies Minor (ERMIN0506) nor the Linguistic Studies Major (ERMAJ1850).", "prerequisites": "LIN101H5"}, {"name": "LIN228H5 • Phonetics", "description": "Investigation of the sounds most commonly used in languages from an articulatory and acoustic point of view, with practice in transcription and analysis.", "prerequisites": "LIN101H5"}, {"name": "LIN229H5 • Phonological Patterns in Language", "description": "This course explores the nature and organization of phonological systems (ie. the sound structure of languages) with practical work in analysis.", "prerequisites": {"and": ["LIN101H5", "LIN228H5"], "or": []}}, {"name": "LIN231H5 • Morphological Patterns in Languages", "description": "This course explores the nature and organization of morphological systems (word formation rules, organization of paradigms, etc.) with practical work in analysis.", "prerequisites": {"and": ["LIN101H5", "LIN102H5"], "or": []}}, {"name": "LIN232H5 • Syntactic Patterns in Language", "description": "This course is an introduction to generative syntax focusing on the Government and Binding framework. Problem sets will be used for practicing argumentation and analytical skills.", "prerequisites": "LIN102H5"}, {"name": "LIN233H5 • English Words through Space and Time", "description": "An analysis of English words, the history of their development and the variation in their use across the English-speaking world. Topics include the history and structure of words, the relation between sound and spelling, dialect variation and the development of dictionaries. This course does not count towards the Linguistic Studies minor or major program. FormerlyLIN203H5.", "prerequisites": "LIN102H5"}, {"name": "LIN237H5 • Semantics", "description": "This course offers an introduction to Semantics, the subfield of linguistics that considers the different ways meaning is encoded in human language and the context within which language is used. The aim of the course is to introduce students to some of the basic concepts and central issues and scholars in the field. The course examines possible ways of describing and formalizing meaning at the level of the word, phrase, and sentence. The course naturally incorporates students’ understanding of syntax and morphology thereby fostering a more holistic understanding of linguistic analysis. It also provides the foundation for more specialised studies in Semantics and Pragmatics. Topics include: sense and reference, compositionality, lexical relations, entailment, presupposition, event types, thematic roles, deixis, implicature, predicate logic, and quantification.", "prerequisites": "LIN102H5"}, {"name": "LIN240H5 • Computer Programming for Linguists", "description": "We live in a world of language technology – who can imagine life without search engines, translation software and automated captioning? At the same time, more and more linguists use computational methods in their research. For example, this methodology can allow us to find all the ways the adverb actually is actually used, or to generate all monosyllabic six-character words for a psycholinguistic experiment. At the heart of this is computer programming: giving precise instructions for your computer to carry out – repeatedly and accurately. This course introduces the basic components of computer programming in Python for linguists.", "prerequisites": {"and": [], "or": ["LIN101H5", "LIN102H5"]}}, {"name": "LIN256H5 • Sociolinguistics", "description": "An introduction to linguistic variation and its social implications, especially the quantitative study of phonological and grammatical features and their correlations with age, sex, ethnicity and other social variables.", "prerequisites": {"and": [], "or": [{"and": ["LIN101H5", "LIN102H5"], "or": []}, "ANT206H5"]}}, {"name": "LIN271Y5 • Introduction to Sanskrit", "description": "This course introduces students to the basic grammar of classical Sanskrit. Students will engage with its phonology (including pronunciation, sandhi, and metrics) and morphology (including word formation, nominal declension and verbal conjugation, and dissolving compounds). Students will apply their grammatical knowledge and analytic skills to the reading of basic Sanskrit texts. By the end of the course, students will be able to read simple, narrative Sanskrit. This course is cross-listed withSAN291Y5and can be used to count toward the Major Program’s Language Requirement.", "prerequisites": "(LIN101H5 and LIN102H5) or ANT206H5"}, {"name": "LIN299H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. See Experiential and International Opportunities for more details.", "prerequisites": "(LIN101H5 and LIN102H5) or ANT206H5"}, {"name": "LIN299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "(LIN101H5 and LIN102H5) or ANT206H5"}, {"name": "LIN310H5 • Contrastive Linguistics", "description": "An introductory survey of the theory and practice of contrastive analysis. How are languages compared with respect to their phonological, morphological, syntactic and semantic structure? How are lexicons compared? Focusing on contrastive procedures, students will examine a number of case studies and will then apply this knowledge to produce their own analysis. Some consideration will be given to the usefulness of contrastive analysis to foreign language teaching.", "prerequisites": "LIN101H5 and (LIN102H5 or LIN205H5) and 1.0 credit in LIN at the 200-level (excluding LIN204H5)."}, {"name": "LIN311H5 • Linguistics and Poetics", "description": "Developments in linguistic theory sprouted diverse approaches to linguistic analysis of literature, from early formalism and structuralism to cognitive linguistics and functional linguistics. Survey of major trends and issues in linguistic poetics includes essential readings, such as works of R. Jakobson, M.A.K. Halliday, R. Barthes, and practice in linguistic analysis of literary texts.", "prerequisites": {"and": ["LIN101H5", "LIN102H5", {"and": [], "or": ["LIN228H5", "LIN229H5"]}], "or": []}}, {"name": "LIN318H5 • Talking Numbers: Interpretation and Presentation of Quantitative Linguistic Data", "description": "Do numbers and statistics make your vision go blurry? Do you avoid making eye contact with charts and tables? From measuring vowel formants to gradient grammaticality judgments to frequencies and patterns in natural language corpora, research in linguistics is becoming increasingly dependent on quantitative data and argumentation... but fear not! In this course, students with no prior background in statistics will learn the fundamentals of quantitative reasoning through hands-on experience with contemporary statistical tools and will be equipped with the basic numeracy skills necessary to critically evaluate quantitative arguments in a range of subfields of linguistics.", "prerequisites": "[LIN256H5 or JLP285H5 (formerly LIN288H5)] and [LIN229H5 or LIN231H5 or LIN232H5 or LIN237H5]."}, {"name": "LIN325H5 • Topics in the Phonetics and Phonology of English", "description": "This course examines current issues in phonetics and/or phonology specific to English. Depending on the instructor, the focus of the course may be oriented towards topics such as socio-phonetics; acquisition; dialectal variation; historical developments. This course counts towards only the English Language Linguistics Minor (ERMIN1200); it does NOT count towards the Linguistic Studies Minor (ERMIN0506) nor the Linguistic Studies Major (ERMAJ1850).", "prerequisites": {"and": [], "or": ["LIN208H5", "LIN228H5"]}}, {"name": "LIN328H5 • Acoustic Phonetics", "description": "This course provides an overview of the fundamentals of acoustics, as well as the acoustic properties of vowels and consonants. Students will gain hands-on experience with primary acoustic data analysis through laboratory work, and will be exposed to classic and current research in the field. Additional topics that may be addressed include speech perception, second-language phonetics, and clinical applications.", "prerequisites": "LIN228H5 and 0.5 credit from (JLP384H5 or LIN229H5 or LIN318H5 or PSY270H5 or PSY274H5)."}, {"name": "LIN329H5 • Phonological Theory", "description": "Basic issues in current phonological theory. Problems focusing on analysis and theory. (Students who want to pursue graduate studies in linguistics are strongly advised to include this course in their program.)", "prerequisites": "LIN229H5"}, {"name": "LIN332H5 • Syntactic Theory", "description": "An introduction to the foundations and formal framework of current generative grammar, concentrating on Chomsky's Minimalist theory. (Students who want to pursue graduate studies in linguistics are strongly advised to include this course in their program.) FormerlyLIN331H5.", "prerequisites": "LIN232H5"}, {"name": "LIN337H5 • Lexical Semantics: What is (or is not) in a Word?", "description": "25,000 is a modest estimate of the number of verbs with distinct meanings in English, but there are more likely upwards of 75,000 verbs. The number of nouns is three to four times this number. But how do we know what they all mean and how to use them appropriately? What is the nature of this knowledge? The meaning of words has been central to the study of language since the Ancient Greek and Sanskrit grammarians and philosophers, and it remains central to contemporary approaches to natural language. In this course, students will investigate basic issues and concepts in the linguistic study of word meaning, with a special focus on the relation between the semantics of words and their syntactic behaviour. Depending on the instructor, topics discussed in the course may include componential analysis; Lexical Conceptual Semantics; Cognitive Semantics; lexicalization patterns and differences cross-linguistically; categorization; compositionality; child language acquisition; computational applications.", "prerequisites": {"and": ["LIN237H5", "LIN232H5"], "or": []}}, {"name": "LIN338H5 • Pragmatics", "description": "This course examines the sub-field of linguistics known as pragmatics, an area concerned not only with what is said but, more importantly, with what is meant. Depending on the instructor, topics in this course may include implicature, reference, presupposition, speech acts, information structure, inferential relations, and static versus dynamic approaches to meaning. The course objectives are to i) explore in depth the concepts necessary to understand the theory of pragmatics, ii) define key terms used by linguists carrying out research in this area, and iii) connect theoretical and methodological concepts to every-day experiences of language in use.", "prerequisites": {"and": ["LIN237H5", {"and": [], "or": ["LIN256H5", "LIN232H5"]}], "or": []}}, {"name": "LIN340H5 • Computing with Natural Language", "description": "How is a search engine able to answer so many of your questions? Why does your phone know which word you're about to type next in your message? Such technologies rely on computational linguistics, the intersection of Linguistics and the Computing Sciences. In this course, students with a background in either discipline will be introduced to this field. The course has a practical focus: how to get computers to analyze and process natural language? Through lectures and scaffolded programming assignments, students will be introduced to the tools and resources of Computational Linguistics (and their limitations). We will look at techniques used by computational linguists to process large amounts of text to answer practical and theoretical research questions. Topics may include part of speech tagging, parsing, machine translation, sentiment analysis, visualization, and corpus linguistics. While no programming skills are required at the outset, students should expect to develop them through the practicums of the course.", "prerequisites": "[LIN101H5 and LIN102H5 and LIN240H5] or [CSC108H5 and CSC148H5 and 0.5 credit in 200-level CSC course]"}, {"name": "LIN341H5 • Linguistics and Computation", "description": "How can you get a computer to tell grammatical and ungrammatical sentences apart? How does it know whether 'cricket' refers to the game or the insect in a sentence like \"The cricket jumped over the fence\"? This course is designed to introduce students with either a background in Linguistics or in the Computing Sciences to the intersection of linguistics and computing, with a focus on the question of how computational algorithms and data structures can be used as a formal model of language. Topics may include finite-state automata for phonology and morphology, context-free grammars, semantic parsing, vector space semantics, computational cognitive modelling, and computational sociolinguistics. No programming skills are required to take the course.", "prerequisites": "[(LIN101H5 and LIN102H5) and any 200-level LIN course] or [(CSC108H5 and CSC148H5) and any 200-level CSC course]"}, {"name": "LIN352H5 • English Language Linguistics in the Public Sphere", "description": "This course prepares students to engage with English language linguistics in public settings. Students will critically analyze what role the English language has in society, and learn how linguists can help answer the public’s questions about the English language. Topics may include: what common misconceptions the general public has about language; the disconnect between what linguistics is and what the public wants to know about language, and how to bridge between this gap; dismantling English-supremacist attittudes and linguistic prejudices around the world; designing research to assess public attitudes about language.", "prerequisites": {"and": ["LIN204H5", "LIN205H5"], "or": []}}, {"name": "LIN353H5 • Discourse Analysis", "description": "This course introduces students to the nature and uses of discourse analysis, notably the types of data on which it draws and its descriptive and critical goals. Topics addressed include discourse structures, participants in discourse, links across texts, the role of medium, and the importance of intention and interpretation.", "prerequisites": {"and": [], "or": ["LIN256H5", "JAL253H5", "ANT206H5", "LIN237H5"]}}, {"name": "LIN357H5 • English Worldwide", "description": "The best estimate of linguists suggests that English is spoken (natively and non-natively) by around one billion people today. This makes it the most widely spoken language in the world. Within this language exists a high degree of global dialect diversity. In this course, we will examine the structure and history of Englishes around the world including British, North American, Antipodean, Caribbean, African, and Asian varieties. Students will also consider structural and sociolinguistic issues associated with English as a global language including creolization, post-creolization, the diffusion of innovation, language policy, and the linguistic effects of colonialism.", "prerequisites": {"and": ["LIN101H5", {"and": [], "or": ["LIN102H5", "LIN205H5"]}, {"and": [], "or": ["LIN256H5", "JAL253H5"]}], "or": []}}, {"name": "LIN360H5 • Historical Linguistics", "description": "The grammars of living languages are constantly changing, never so obviously than when we compare different stages of a language over a long period of time: words change form and are sometimes repurposed; new words enter and others are lost; morphology rises and falls; syntactic possibilities can change dramatically. How do such changes arise, and what does it mean for a language to change? The aim of this course is to introduce students to the field of diachronic linguistics: its relationship to general linguistics, its primary research methods, and its major achievements. Students will gain practical experience solving classic language change problems, performing their own analyses, and reading contemporary literature in the field.", "prerequisites": "LIN229H5 and (one of LIN231H5 or LIN232H5 or LIN237H5)"}, {"name": "LIN366H5 • Contact Languages: Pidgins, Creoles and Mixed Languages", "description": "This course examines languages recently created bymeans of contact between languages of differentsocio-economical status. Analysis of these new languagesis of particular interest to linguistic theory since it offersinsight on the construction of linguistic systems, languageevolution and on how language is acquired in such acontext. Emphasis is given to the description and analysisof French-based pidgins and Creoles spoken in theCaribbean and Indian Ocean region.", "prerequisites": "1.0 credit from any of the following: LIN228H5 or LIN229H5 or LIN231H5 or LIN232H5 or LIN237H5 or (LIN256H5 or JAL253H5) or JLP285H5 (formerly LIN288H5)"}, {"name": "LIN372H5 • The Great Debates: Critical Reading and Writing in Linguistics", "description": "Students develop critical reading and writing skills through the analysis of influential articles that broach broad and controversial topics in linguistics. One goal of the course is to develop skill in understanding how a text “works”, to form a reasoned evaluation of it, and to appreciate its place in a larger debate. Another goal is to develop skill in communicating complex ideas through a variety of means relevant to the academic community.", "prerequisites": "LIN101H5 and LIN102H5 and 1.0 credit of LIN at the 200-level"}, {"name": "LIN374H5 • African Linguistics", "description": "This course explores the linguistic features and characteristics of African languages. Attention will be given to the phonetic, phonological, morphological, and syntactic components of the languages to be studied, with emphasis on examining under-represented and under-studied languages. No prior knowledge of an African language is necessary.", "prerequisites": {"and": ["LIN229H5", {"and": [], "or": ["LIN231H5", "LIN232H5"]}], "or": []}}, {"name": "LIN375H5 • Chinese Linguistics", "description": "This course offers a linguistic introduction to the features and characteristics of the Chinese languages. Attention will be given to the phonological, morphological and syntactic patterns of the language family, set against the backdrop of its linguistic and sociolinguistic history. The course not only examines the characteristics of Mandarin but also various other varieties of Chinese. No prior knowledge of a Chinese language is necessary.", "prerequisites": {"and": ["LIN229H5", "LIN232H5"], "or": []}}, {"name": "LIN376H5 • Linguistic Phenomena in the World’s Languages", "description": "Have you ever wondered why some languages have no word forthe? What happens when a language has no tense? Why some languages have tone and others don’t? And what on earth doeseh?mean, eh?If so, this course is for you! In this course, we will consider linguistic phenomena that you might not find in your intro textbooks, but which are important typologically and commonly found across the world’s languages. And we will study them in-depth, in a scientifically informed way: building on your foundation in modern linguistics, you will be introduced to key concepts and theoretical tools that linguists use to analyze these phenomena. In short, the goal is to show you how your foundational theoretical toolbox can be extended to systematically understand a broader set of linguistic properties.Topics will vary from year to year but may include: nouns and classifiers, verbs and event structure, tonogenesis, speech acts and speech act-level phenomena. Year to year, instructors may focus on phenomena common to a particular region of the world.", "prerequisites": {"and": ["LIN229H5", "LIN232H5"], "or": []}}, {"name": "LIN380H5 • Theoretical Issues in Second Language Teaching and Learning", "description": "This course examines theoretical research on adult second language learning and the resultant implications for second language teaching. Topics include learning styles and strategies, age, affect, communicative competence, and sociolinguistics. Links are drawn to teaching practices, including error correction, materials selection, and order and method of presentation.", "prerequisites": "1.0 credit of any of the following: LIN228H5 or LIN229H5 or LIN231H5 or LIN232H5 or LIN237H5 or (LIN256H5 or JAL253H5) or JLP285H5 (formerly LIN288H5)."}, {"name": "LIN385H5 • The Acquisition of Grammar in Different Contexts", "description": "This course examines language acquisition by different populations: first language acquisition by normal, deaf and impaired children; first language re-acquisition by aphasic patients; second language acquisition by children and adults. The question that we will ask is the following: what are the similarities and differences across acquisition contexts? Comparative theoretical approaches will be examined in order to gain an insight into the following topics: evidence for innate linguistic endowment, the stages in the development of grammar, the role of input. An important component will be the analysis of both spontaneous corpora and experimental work.", "prerequisites": "LIN101H5 and LIN102H5 and [0.5 credit from JLP285H5 (formerly LIN288H5) or LIN229H5 or LIN231H5 or LIN232H5 or LIN237H5 or LIN256H5 or 300-level PSY course]."}, {"name": "LIN387H5 • Theoretical Issues in Teaching and Learning Second Language Vocabulary", "description": "This course provides an overview of second language vocabulary acquisition research and the resultant implications for second language teaching. Topics include dimensions of vocabulary knowledge, incidental and intentional vocabulary learning, textbook analysis, learning strategies, and teacher beliefs about vocabulary teaching and learning. Implications are drawn for pedagogical practices, including best vocabulary teaching practices, materials selection, and measuring vocabulary knowledge.", "prerequisites": "1.0 credit from LIN228H5 or LIN229H5 or LIN231H5 or LIN232H5 or LIN237H5 or (LIN256H5 or JAL253H5) or JLP285H5 (formerly LIN288H5)."}, {"name": "LIN399H5 • Research Opportunity Program", "description": "This course provides senior undergraduate students who have developed some knowledge of research methods used in the discipline of Linguistics to work in the research project of a U of T Mississauga professor for course credit. Enrolled students have the opportunity to become involved in original research, develop their research skills, and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer and fall/winter sessions are posted on the ROP website in mid-February; students are invited to apply at that time. See Experiential and International Opportunities for more details.", "prerequisites": "LIN101H5 and LIN102H5 and [1.0 credit from JAL253H5 or LIN228H5 or LIN229H5 or LIN231H5 or LIN232H5 or LIN237H5 or LIN256H5 or JLP285H5 (formerly LIN288H5)]"}, {"name": "LIN399Y5 • Research Opportunity Program", "description": "This course provides senior undergraduate students who have developed some knowledge of research methods used in the discipline of Linguistics to work in the research project of a U of T Mississauga professor for course credit. Enrolled students have the opportunity to become involved in original research, develop their research skills, and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer and fall/winter sessions are posted on the ROP website in mid-February; students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "LIN101H5 and LIN102H5 and [1.0 credit from JAL253H5 or JLP285H5 (formerly LIN288H5) or LIN228H5 or LIN229H5 or LIN231H5 or LIN232H5 or LIN237H5 or LIN256H5]"}, {"name": "LIN411H5 • Introduction to Analysis and Argumentation in Linguistics", "description": "This course examines topics which have created controversy in linguistics, topics about which scholars have expressed opposing views through published articles. By reading and discussing these debates, students will galvanize their knowledge base in linguistics and develop skills in identifying the authors' assumptions, assessing their argumentation and recognizing how linguists build arguments to present an opposing view. The topics may range from big picture questions like the validity of Universal Grammar to more specific questions about a linguistic phenomenon. By the end of the course, students will have developed more acute reading skills, thereby also improving their academic writing skills. The title of the course might sound scary, but the course itself is not at all!", "prerequisites": "LIN229H5 and LIN232H5 and 0.5 credit from [JLP285H5 (formerly LIN288H5) or JLP288H5 or LIN231H5 or LIN237H5 or LIN256H5 or LIN258H5] and 0.5 credit from [LIN310H5 or LIN327H5 or LIN328H5 or LIN329H5 or LIN332H5 or LIN337H5 or LIN338H5 or LIN360H5 or LIN366H5 or LIN369H5 or LIN374H5 or LIN375H5 or LIN376H5 or LIN419H5 or LIN476H5 or LIN479H5]."}, {"name": "LIN418H5 • Research Methods in Linguistics", "description": "Introduction to the main methods, tools and techniques used in the analysis, interpretation and presentation of linguistic data. Topics may include research in the areas of general linguistics, language acquisition, psycholinguistics, sociolinguistics and dialectology. This course involves a practical component where students will apply skills learned in order to carry out their own study. Note that a background in statistics is NOT required for this course.", "prerequisites": "[LIN256H5 or JLP285H5 (formerly LIN288H5)] and 0.5 credit in a 300-level LIN course"}, {"name": "LIN419H5 • Field Methods: A Language Unlocked", "description": "This course provides experience in language analysis based on elicited data from a native speaker of an understudied language. It emphasizes procedures and techniques and provides an opportunity for first-hand appreciation of linguistic unity and diversity.", "prerequisites": "LIN229H5 and LIN232H5 and [0.5 credit from (JLP384H5 or LIN328H5 or LIN329H5 or LIN332H5 or LIN337H5 or LIN338H5 or LIN360H5 or LIN366H5 or LIN369H5 or LIN374H5 or LIN375H5 or LIN376H5 or LIN411H5 or LIN418H5 or LIN476H5 or LIN479H5) or permission of the instructor]. "}, {"name": "LIN421H5 • Speaking and Hearing with an Accent", "description": "Much of linguistic theory assumes the existence of an “ideal speaker/hearer” of a given language. However, in the real world, particularly in linguistically diverse communities such as the GTA, there is an enormous amount of variability driven by differences in language background, regional affiliation, and social factors. This course examines the many factors contributing to accentedness, and how listeners adapt their perception when confronted with different accents. It also explores how models of language development, processing, and production account for accent-related variability.", "prerequisites": {"and": [], "or": ["JLP384H5", "LIN328H5"]}}, {"name": "LIN441H5 • Computing Meaning", "description": "How can we get a computer system to carry out meaningful tasks, such as determining if a restaurant review is positive ? How can computational experiments help linguists understand meaning and its use better ? This course will introduce students to computational linguistic concepts and techniques pertaining to meaning, such as vector space semantics and sentiment analysis. The course combines a theoretical perspective on meaning and computation with hands-on lab work.", "prerequisites": {"and": ["LIN237H5", "LIN340H5"], "or": []}}, {"name": "LIN447H5 • Topics in Computational Linguistics", "description": "In this course, students will develop a computational understanding of text and language. This course is cross-disciplinary, tools and project based; it teams Linguistics and Computer Science students in projects exploring novel applications of Natural Language Processing. Example topics include text summarization, bias detection, and sentiment analysis using Python and text processing and machine learning libraries. Topics and applications will vary by instructor.", "prerequisites": "For LIN program students: (LIN340H5 or LIN341H5) plus 1.0 additional credit at the 300 level. For CS program students: CSC207H5 and STA256H5 and/or permission from the instructor."}, {"name": "LIN452H5 • Communicating English Language Linguistics", "description": "This course teaches students advanced skills for engaging with English language linguistics in public settings. Topics may include: how to talk to a general audience about linguistics; navigating common public myths about language; presentation skills to make complex topics accessible; incorporating linguistics in language courses; public outreach and interview skills in linguistics; designing research to answer public questions about English. In this capstone course, students will output innovative projects for educating the public about English language linguistics. This course includes an experiential learning component where students will get hands-on experience talking to various audiences about linguistics.", "prerequisites": "LIN352H5"}, {"name": "LIN456H5 • Sociolinguistics and Second Language Teaching and Learning", "description": "This course considers the impact on variant use by second language learners exerted by linguistic and extra-linguistic factors, such as the surrounding linguistic context, age, sex, style, and curricular and extra-curricular exposure. Implications are drawn for second language teaching, including deciding what registers and variants to teach and what activities to employ.", "prerequisites": "LIN256H5 (or permission from instructor), plus 0.5 credit in a 300-level LIN course."}, {"name": "LIN458H5 • Analyzing Sociolinguistic Variation", "description": "All languages, in all linguistic domains, exhibit variation - more than one way of saying the same thing. This variation is not random but dependent on various linguistic, social, and cognitive conditioning factors. This course explores the theory and practice of analyzing such sociolinguistic variation. Students will receive hands-on instruction in fieldwork methods for collecting natural speech data and quantitative methods for analyzing patterns in that data.", "prerequisites": "LIN256H5, plus 0.5 credit in a 300-level LIN course"}, {"name": "LIN460H5 • Special Topics in Language Change", "description": "This course examines current issues of theoretical and/or empirical relevance in linguistics with special reference to phenomena involving language change. Depending on the instructor, the focus of the course may be more oriented towards phonology, morpho-syntax, semantics, or the lexicon. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "LIN229H5 and LIN232H5 and LIN256H5 and 0.5 credit from (JFL454H5 or JLP384H5 or LIN310H5 or LIN318H5 or LIN328H5 or LIN329H5 or LIN332H5 or LIN337H5 or LIN338H5 or LIN357H5 or LIN360H5 or LIN366H5 or LIN369H5 or LIN374H5 or LIN375H5 LIN376H5 or LIN411H5 or LIN419H5 or LIN458H5 or LIN476H5 or LIN479H5)"}, {"name": "LIN466H5 • Topics in Creole Linguistics", "description": "An advanced seminar on current issues of theoretical relevance in linguistics with special reference to Creole languages, in particular their emergence and their linguistic properties compared to those of the contributing languages. Depending on the instructor, the course may emphasize on French-based, English-based or Portuguese-based Creoles.", "prerequisites": "LIN229H5 and (LIN231H5 or LIN232H5 or LIN366H5), plus 0.5 credit in a 300-level LIN course."}, {"name": "LIN469H5 • Topics in Romance Linguistics", "description": "We examine current issues of theoretical and/or empirical relevance in linguistics with special reference to the Romance family, including both well-known and understudied varieties. In this course, student can engage deeply with specific properties of the Romance family from the point of view of micro-comparative analysis, sociolinguistic variation, and/or diachronic change depending on student interests and the expertise of the instructor. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "LIN229H5 and LIN232H5 and LIN256H5 and 0.5 credit from (JFL454H5 or JLP384H5 or LIN310H5 or LIN318H5 or LIN328H5 or LIN329H5 or LIN332H5 or LIN337H5 or LIN338H5 or LIN357H5 or LIN360H5 or LIN366H5 or LIN369H5 or LIN375H5 or LIN411H5 or LIN419H5 or LIN458H5 or LIN476H5 or LIN479H5)"}, {"name": "LIN475H5 • Topics in Chinese Linguistics", "description": "An advanced seminar that explores topics and issues concerning the Chinese languages. Depending on the instructor, focus of the course may be oriented toward structural properties, language and society, bilingualism, the languages of China, or historical issues.", "prerequisites": "LIN375H5 or permission of the instructor."}, {"name": "LIN476H5 • Language Diversity and Language Universals", "description": "This course examines cross-linguistic typological features found in the languages of the world. Special attention is given to investigating the remarkable range of phonological, morphological and syntactic diversity found in the world’s languages. One of the primary goals of the course is to examine the notion of language universals in light of such diversity.", "prerequisites": "LIN232H5 and LIN231H5 and 0.5 credit from (JLP384H5 or LIN310H5 or LIN328H5 or LIN329H5 or LIN332H5 or LIN337H5 or LIN338H5 or LIN360H5 or LIN366H5 or LIN369H5 or LIN374H5 or LIN375H5 or LIN376H5 or LIN411H5 or LIN419H5 or LIN479H5)"}, {"name": "LIN479H5 • The Structure of a Specific Language", "description": "An introduction to the structure of a featured language other than English. Topics of analysis may include the phonological, morphological, syntactic, or semantic systems; the writing system; historical aspects; variation. Students will use the tools of linguistic analysis learned in prior courses to examine the structural properties of this language. No prior knowledge of the language is necessary.", "prerequisites": "LIN228H5 and LIN229H5 and LIN232H5, plus 0.5 credit in a 300-level LIN course."}, {"name": "LIN486H5 • Teaching and Learning Cross-cultural Communication", "description": "This course examines cross-cultural language use by second language learners from both a theoretical and pedagogical perspective. Topics addressed include the role of pragmatic transfer between native and target languages, individual differences, learning context, and instruction in the development of second language pragmatic competence.", "prerequisites": "JAL253H5 or JLP285H5 (formerly LIN288H5) or LIN256H5 or LIN258H5"}, {"name": "LIN487H5 • Second Language Pedagogy", "description": "This course offers a comprehensive survey and analysis of fundamental concepts and issues related to second, bilingual, and foreign language instruction by developing students' knowledge of second language acquisition, approaches to language teaching, computer-assisted teaching, and pedagogical design and implementation in the language classroom.", "prerequisites": "LIN101H5 and LIN102H5 and 0.5 credit at the 300-level in a LIN course."}, {"name": "LIN495Y5 • Individual Project", "description": "A research or reading project undertaken by the student under the supervision of a staff member. Open only when a faculty member is willing and available to supervise.", "prerequisites": "One half course at the 300 level in LIN."}, {"name": "LIN496H5 • Individual Project", "description": "A research or reading project undertaken by the student under the supervision of a staff member.", "prerequisites": "One half course at the 300 level in LIN."}, {"name": "LIN498H5 • Individual Project", "description": "A research or reading project undertaken by the student under the supervision of a staff member.", "prerequisites": "One half course at the 300 level in LIN."}]