[{"name": "MGM320H5 • Financial Statement Analysis and Interpretation", "description": "This course will provide an understanding of financial reports, and their use for investment and management decisions. Cases will be used to enhance problem-solving skills and will integrate ideas from finance, management and financial accounting and other areas of study. The course focuses on the interpretation and use of financial statement data for the purpose of assessing the financial performance of a business operation, not on the technical details of accounting rules.", "prerequisites": {"and": ["MGT231H5", {"and": [], "or": ["MGT120H5", "MGM221H5"]}], "or": []}}, {"name": "MGM360H5 • Compensation", "description": "This course explores the theory and process of developing compensation systems as part of an organization’s larger system for managing human potential. The course focuses on the major components of compensation strategy design such as legislation, principles of equity and fairness, job analysis, job evaluation, compensation surveys, benefits and incentives. Current events in relation to compensation are explored. Students will also acquire hands-on experience in building a compensation strategy.", "prerequisites": "MGT260H5"}, {"name": "MGM364H5 • Labour Relations", "description": "The role, structure, and performance of industrial relations within the framework of Canada's socio-economic-political system. Growth and history of the Canadian Labour movement: its philosophy and structure. Management's strategies and tactics in collective bargaining; public policy in the field of industrial relations; strikes in so-called emergency situations: the role of unions and collective bargaining in inflation.", "prerequisites": "MGT260H5"}, {"name": "MGM365H5 • HR Planning", "description": "During Human Resource Planning, organizations identify changes in human resources required to meet their future goals. In this course, students will learn about the steps involved in HR Planning including labour market forecasting, goal setting and strategic planning, and program implementation and evaluation.", "prerequisites": "MGT260H5"}, {"name": "MGM390H5 • Business Law", "description": "(FormerlyMGM290H5). This course provides an overview of the public institutions, laws and regulations that affect the structure and management of Canadian organizations.", "prerequisites": {"and": ["MGM101H5", "MGM102H5"], "or": []}}, {"name": "MGM464H5 • Recruitment and Selection", "description": "An organization's success depends on its ability to recruit and select top talent. This course is designed to provide students with a deep understanding of the methods and application of various recruitment and selection techniques within organizations. Students will learn to recognize and create effective, resource-efficient recruitment programs, and how to identify the most qualified individuals from a pool of applicants.", "prerequisites": "MGT260H5"}, {"name": "MGM465H5 • Occupational Health & Safety", "description": "As individuals spend more and more time at work, it becomes increasingly important for organizations to protect their employees from harm and to support their physical, psychological, emotional, and social welfare. Students in this course will gain the knowledge and skills necessary to design and foster healthy and safe working environments.", "prerequisites": "MGT260H5"}, {"name": "MGM466H5 • Training & Development", "description": "The goal of training and development is to grow the potential of employees within an organization. This course is designed to provide students with an understanding of how to improve job-related competencies through training and how to prepare employees for future job responsibilities through development. Topics covered include needs assessment, design, implementation, and evaluation of training and development programs.", "prerequisites": "MGT260H5"}, {"name": "MGT010H5 • Effective Business Practices and Leadership Skills Capstone", "description": "This culminating course offers students in the Effective Business Practices and Leadership Skills Certificate an opportunity to integrate and synthesize their academic learning with their work-integrated learning experience. Students will engage with other students in the certificate program to share their experiences, complete their final workplace reflection exercises, produce a written report of their workplace experience, and exhibit their experience in the form of a final poster presentation. This course is required for all students in the Certificate in Effective Business Practices and Leadership Skills. No credit is awarded for this course.", "prerequisites": "Admission to the Certificate in Effective Business Practices and Leadership Skills"}, {"name": "MGT120H5 • Introduction to Financial Accounting", "description": "Introduction to the theory and concepts of financial accounting. Students learn how to construct and interpret financial statements. Topics include an introductory understanding of accounting and the context within which accounting occurs.", "prerequisites": "Admission to the Certificate in Effective Business Practices and Leadership Skills"}, {"name": "MGT150H5 • Financial Planning for Individuals", "description": "This course will cover personal finance topics for individuals at all stages of life. Topics include budgeting, borrowing, investing, insurance and retirement planning. Tax issues associated with these topics is also covered including the basics of personal income tax. Case studies are used extensively to illustrate the material.", "prerequisites": "Admission to the Certificate in Effective Business Practices and Leadership Skills"}, {"name": "MGT201H5 • Coding for Business", "description": "Targeted to business students with little or no programming experience, the course provides an understanding of the role computation has in solving business problems and to help students be able to write small programs to accomplish practical tasks in the business world.", "prerequisites": "Admission to the Certificate in Effective Business Practices and Leadership Skills"}, {"name": "MGT211H5 • Special Topics for Management", "description": "Topics and issues in Management. Content in any given year will depend on the instructor. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Admission to the Certificate in Effective Business Practices and Leadership Skills"}, {"name": "MGT212H5 • Special Topics for Management", "description": "Topics and issues in Management. Content in any given year will depend on the instructor. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Admission to the Certificate in Effective Business Practices and Leadership Skills"}, {"name": "MGT218H5 • Quantitative Analysis for Management", "description": "Acquaints students with the statistical principles that managers need in order to extract information from numerical data, and to understand the formal principles of decision-making under conditions of uncertainty. Covers descriptive statistics, elementary probability, expected values, sampling distributions, point and interval estimation, hypothesis testing for normal and binomial data.", "prerequisites": {"and": ["MGM101H5", "MGM102H5"], "or": []}}, {"name": "MGT220H5 • Intermediate Accounting I", "description": "Expands the analysis of financial accounting beyondMGT120H5. Cases are used to develop critical thinking and communication skills. Topics include accounting's conceptual framework, analysis of business and financial statements, accounting for assets, and valuation of bonds.", "prerequisites": "At least a \"C\" in MGT120H5"}, {"name": "MGT223H5 • Managerial Accounting I", "description": "Covers conceptual and analytical foundations of cost accounting and uses of accounting by management. Cost concepts for product costing and decision making provide an understanding of the uses of accounting information by management. Costing and control concepts are analyzed to equip students with tools for establishing costing systems and to make decisions.", "prerequisites": "MGT120H5"}, {"name": "MGT225H5 • Intermediate Accounting II", "description": "Expands the analysis of financial accounting beyondMGT220H5. Technical topics include liabilities, shareholders’ equity, complex financial instruments, accounting for leases, measuring and reporting pensions and earnings per share. The emphasis is on analysis and developing judgment.", "prerequisites": "MGT220H5"}, {"name": "MGT231H5 • Business Finance I", "description": "(FormerlyMGT338H5) This course analyzes the financial investment decision-making process of individuals and firms. It provides an introduction to present-value techniques, capital budgeting decision-rules, the problem of investment under uncertainty, and portfolio theory.", "prerequisites": "MGT220H5"}, {"name": "MGT232H5 • Business Finance II", "description": "(FormerlyMGT339H5) This course extends material learned inMGT231H5, which is a prerequisite. Topics include the concept of efficiency of financial markets, the optimal financing decisions of firms, and the characteristics of debt, equity and other financial instruments such as options.", "prerequisites": "MGT231H5"}, {"name": "MGT252H5 • Principles of Marketing", "description": "An introduction to the basic concepts of market definition, consumer behaviour, and the principal marketing functions: product line development, pricing, distribution, promotion, salesforce management, advertising, research, and planning.", "prerequisites": "MGT231H5"}, {"name": "MGT260H5 • Managing Human Potential", "description": "(FormerlyMGT460H5) Human resource management is studied from the perspective of the manager/practitioner. The course focuses on current theory and practices in the major functions of human resource management. Class exercises and projects are used to provide students with some practical HR experience.", "prerequisites": "MGT231H5"}, {"name": "MGT262H5 • Psychology at Work", "description": "Theoretical ideas and practical applications concerning individual and group behaviour in organizations. We explore relevant problems confronting management: motivation, influence, communication, supervision, decision-making, and work force diversity.", "prerequisites": "MGT231H5"}, {"name": "MGT270H5 • Data Analytics for Management", "description": "This course introduces the analytical mindset and data analytics skills that business professionals need to analyze and evaluate a variety of data to create insights for making decisions. In particular, you will learn to ask the right questions, prepare relevant data, apply appropriate data analytics methods, and interpret results to answer questions. You will also learn to use common data analytics tools, such as Excel, Access (SQL), and Tableau/Power BI to prepare, analyze, and model financial data. Finally, you will apply the analytical mindset and data analytics skills to address various business problems using financial and general business data.", "prerequisites": {"and": ["MGM101H5", {"and": [], "or": ["MGM102H5", "MGT120H5"]}], "or": []}}, {"name": "MGT299H5 • Research Opportunity Program", "description": "This course provides second year undergraduate students, who have developed some knowledge of a discipline and its research methods, an opportunity to work in the research project of a professor in return for course credit. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer and fall/winter sessions are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "MGM101H5 and (MGM102H5 or MGT120H5)"}, {"name": "MGT299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "MGM101H5 and (MGM102H5 or MGT120H5)"}, {"name": "MGT300H5 • Presentation Skills for Management", "description": "The ability to verbally communicate effectively is an important skill in both business and life. Through various avenues such as impromptu speeches, group presentations and debates, students will work on improving their communication and networking skills as well as reflect on opportunities for further improvement via journaling and self-reflection.", "prerequisites": "MGM101H5"}, {"name": "MGT301H5 • Coding and Data Mining for Business Analytics", "description": "Targeted to business students with some programming experience, the course provides the foundation to take more advanced courses in the Department of Management that require programming knowledge and data mining skills. Topics in this accelerated course will include data structures, algorithms, analytics (i.e.descriptive, predictive, and prescriptive) including data visualization. Students will be expected to integrate concepts from statistics as well.", "prerequisites": "MGT201H5"}, {"name": "MGT311H5 • Special Topics for Management", "description": "Topics and issues in Management. Content in any given year will depend on the instructor. This course may include 24 practical hours. See timetable for schedule. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "MGT201H5"}, {"name": "MGT312H5 • Special Topics for Management", "description": "Topics and issues in Management. Content in any given year will depend on the instructor. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "MGT201H5"}, {"name": "MGT321H5 • Audit & Assurance", "description": "A study of the concepts and theory underlying audit practice. Students are introduced to the CICA Handbook recommendations and guidelines for assurance. Practical examples are used to help students develop skills in exercising professional judgment.", "prerequisites": {"and": [], "or": ["MGT224H5", "MGT225H5"]}}, {"name": "MGT322H5 • Financial Accounting Theory and Policy II", "description": "Examines several current measurement and disclosure issues in financial reporting, within a \"quality of earnings\" framework. Topics include: financial instruments, measuring and reporting pensions, financial reporting of corporate income taxes, corporate reporting via the Internet, etc. The emphasis is on developing judgment.  Please note: This course will be phased out as of Summer 2022. Students admitted to the Accounting program in Fall 2020 and onward should enrol inMGT225H5Intermediate Accounting II.", "prerequisites": "MGT224H5"}, {"name": "MGT323H5 • Managerial Accounting II", "description": "Introduction to the different contexts in which costs need to be determined for goods sold internally, externally, domestically, and internationally. Other topics include appropriate cost structures for centralized, decentralized, and matrix forms of organizations and costs for long-term capital projects. Cases are used to promote understanding of the theories.", "prerequisites": {"and": ["MGT223H5"], "or": ["ECO220Y5", "ECO227Y5", {"and": ["STA256H5", "STA258H5"], "or": []}, {"and": ["STA256H5", "STA260H5"], "or": []}]}}, {"name": "MGT324H5 • Equity Valuation and Analysis", "description": "This course will provide a framework for analyzing a firm’s past performance, estimating its future performance, and valuing its equity.You will understand how to interpret financial statements, analyze cash flows, make judgments about earnings quality and uncover hidden assets and liabilities. It helps you become a sophisticated user of financial accounting data.", "prerequisites": {"and": ["MGT220H5", "MGT231H5"], "or": []}}, {"name": "MGT325H5 • Critical Thinking, Analysis and Decision Making I", "description": "(FormerlyMGT320H5) This course introduces students to integration of different areas of studies, stressing the pervasive competencies and critical thinking skills required from business school graduates, future professional accountants and advisors. This course focuses on developing students' decision-making and written communication skills.", "prerequisites": {"and": ["MGT220H5", "MGT223H5", {"and": [], "or": ["MGT224H5", "MGT225H5"]}, "MGT231H5", "MGT232H5"], "or": []}}, {"name": "MGT326H5 • Advanced Accounting", "description": "The emphasis in this course is on accounting issues and practices relating to intercompany investments, foreign currency transactions and investments, agriculture, cryptocurrencies, and not-for-profit organizations. Assigned material includes cases to ensure that the user impact of accounting choices is appreciated.", "prerequisites": {"and": [], "or": ["MGT322H5", "MGT225H5"]}}, {"name": "MGT330H5 • Investments", "description": "Security analysis and portfolio management. Emphasis is placed on an analysis of bonds and common stocks.", "prerequisites": {"and": ["MGT231H5", "MGT232H5"], "or": []}}, {"name": "MGT336H5 • Business Valuation", "description": "This is a rigorous course on valuing securities, primarily equities, targeted at students interested in careers involving the analysis of financial statements. We will discuss how managerial discretion and accounting rules influence financial statements and how to analyze financial information to reveal a firm's true performance accurately. We will discuss the mechanics of forecasting and how to become adept at it. We will discuss the intricacies of different valuation models and understand the nuances that link them. Learning will be through lectures, case analyses, in-class exercises, and homework assignments. Almost all classes will involve an Excel-based activity, case discussion, and real-time data. At the end of the course, students can expect to gain significant expertise in all facets of valuation.", "prerequisites": {"and": ["MGT220H5", "MGT231H5"], "or": []}}, {"name": "MGT341H5 • Financial Modeling and Data Analytics", "description": "This course studies applications in corporate finance, investments and risk management. Finance lab software tools will be used to work through problems on topics such as Capital Budgeting and Valuation, Portfolio Analysis, Firm Valuation, Valuing Securities and Risk Management.", "prerequisites": {"and": ["MGT231H5", "MGT232H5"], "or": []}}, {"name": "MGT353H5 • Introduction to Marketing Management", "description": "An applications-oriented course intended to develop the analytic skills required of marketing managers. The course is designed to improve skills in analyzing marketing situations, identifying market opportunities, developing marketing strategies, making concise recommendations, and defending these recommendations.", "prerequisites": {"and": [], "or": ["MGT252H5", "MGM252H5"]}}, {"name": "MGT354H5 • Consumer Behaviour", "description": "Formulating successful marketing strategies requires an understanding of consumers' cultures, motivations, cognitions, and emotions. Students will learn how to use theoretical perspectives from psychology, economics, anthropology, and other disciplines to generate predictions about consumers, interpret consumer reactions to marketing stimuli, and develop rigorous skills in marketing analysis.", "prerequisites": "MGT252H5"}, {"name": "MGT355H5 • Pricing", "description": "Approaches pricing decision as an intersection of economics and psychology. Using product categories as diverse as financial services, healthcare, industrial products and consumer packaged goods, students study dynamic pricing, value pricing, price customization, price bundling and multi-part tariffs, menu costs and price stickiness, sales promotions, and pricing in two-sided markets.", "prerequisites": "MGT252H5"}, {"name": "MGT363H5 • Designing Effective Organizations", "description": "The course covers the relationship between design and effectiveness; the impact and determinants (environment, technology, competitiveness, size, life-cycle, communication needs) of an organization's form as well as the difficulties of re-framing organizations.", "prerequisites": "MGT252H5"}, {"name": "MGT371H5 • Business Technology Management", "description": "This course covers key management decisions based on the impact of sustainable and disruptive technology and their role in strategy, profitable growth, and modern work environments. Unlike programming courses, the focus is on knowledge to help students contribute to technology based decisions in the organizations that they join.", "prerequisites": "MGT252H5"}, {"name": "MGT373H5 • Predictive Analytics", "description": "Delve into machine learning and its technical applications, obtain a conceptual understanding of prediction problems and algorithms, learn to interpret results using statistical software, and complete a challenging prediction project using real data that will put your knowledge to the test.This course will introduce students to a diverse collection of big data and machine learning techniques. These techniques are often aimed at identifying and quantifying various structures in data to answer business problems and provide managerial insights.", "prerequisites": "MGT201H5 and [ECO220Y5 or MGT218H5 or STA218H5 or (1.0 credit from STA256H5 or STA258H5 or STA260H5)]"}, {"name": "MGT374H5 • Operations Management", "description": "Operations management is concerned with the facilities and their operation to deliver the goods and services of the organization. The course develops this theme and gives a theoretical framework for managing operations. Some of the major themes include aggregate planning, materials management, and inventory control. This course introduces students to modern quantitative and computing tools necessary for in-depth operational analysis and planning.", "prerequisites": {"and": [], "or": ["ECO220Y5", "ECO227Y5", {"and": ["STA256H5", "STA260H5"], "or": []}, {"and": ["STA256H5", "STA258H5"], "or": []}]}}, {"name": "MGT393H5 • Legal Environment of Business I", "description": "An introduction for commerce students to the Canadian legal system focusing on business entities, the structure of the Canadian court system, the various elements of contract law and the law of negligence.", "prerequisites": "ECO220Y5 or ECO227Y5 or (STA256H5 and STA260H5) or (STA256H5 and STA258H5)"}, {"name": "MGT394H5 • Legal Environment of Business II", "description": "This course builds on the legal principles developed in Legal I and canvasses other areas of law that impact a business entity. The course deals with the Sales of Goods Act and relevant consumer protection legislation, employment law, environmental law, the Personal Property Security Act and the rights of the secured creditor.", "prerequisites": {"and": [], "or": ["MGM390H5", "MGT393H5"]}}, {"name": "MGT399H5 • Research Opportunity Program", "description": "This course provides senior undergraduate students who have developed some knowledge of a discipline and its research methods an opportunity to work in the research project of a professor in return for course credit. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer and fall/winter sessions are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "A minimum of 10.0 credits"}, {"name": "MGT399Y5 • Research Opportunity Program", "description": "This course provides senior undergraduate students who have developed some knowledge of a discipline and its research methods an opportunity to work in the research project of a professor in return for course credit. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. Project descriptions for participating faculty members for the following summer and fall/winter sessions are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "A minimum of 10.0 credits"}, {"name": "MGT401H5 • Supervised Reading Course on an Approved Subject", "description": "Open when a faculty member is willing and able to supervise. Students must obtain the approval of the Director of Commerce and the supervising faculty member before enrolling.", "prerequisites": "Cumulative GPA of at least 2.70"}, {"name": "MGT402H5 • Supervised Reading Course on an Approved Subject", "description": "Open when a faculty member is willing and able to supervise. Students must obtain the approval of the Director of Commerce and the supervising faculty member before enrolling.", "prerequisites": "Cumulative GPA of at least 2.70"}, {"name": "MGT411H5 • Special Topics in Management", "description": "Topics and issues in Management. Content in any given year will depend on the instructor. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Cumulative GPA of at least 2.70"}, {"name": "MGT412H5 • Special Topics in Management", "description": "Topics and issues in Management. Content in any given year will depend on the instructor. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Cumulative GPA of at least 2.70"}, {"name": "MGT414H5 • Special Topics in Management", "description": "Topics and issues in Management. Content in any given year will depend on the instructor. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Cumulative GPA of at least 2.70"}, {"name": "MGT415H5 • Special Topics in Management", "description": "Topics and issues in Management. Content in any given year will depend on the instructor. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Cumulative GPA of at least 2.70"}, {"name": "MGT416H5 • Special Topics in Management", "description": "Topics and issues in Management. Content in any given year will depend on the instructor. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Cumulative GPA of at least 2.70"}, {"name": "MGT417H5 • Special Topics in Management", "description": "Topics and issues in Management. Content in any given year will depend on the instructor. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "Cumulative GPA of at least 2.70"}, {"name": "MGT420H5 • Critical Thinking, Analysis and Decision Making II", "description": "(FormerlyMGT419H5) This is a capstone case course stressing the pervasive competencies and critical thinking skills required from business school graduates, future professional accountants and advisors. This course provides students with an opportunity to integrate the technical and practical knowledge obtained in the prerequisite and other University courses and to apply this knowledge to case type situations. Because of the integrative nature and content of the course, the course will be directed towards students who have completed most of their required courses and who are seeking an accounting designation.", "prerequisites": "MGT321H5 and (MGT322H5 or MGT225H5) and MGT323H5 and MGT325H5 and MGT423H5. Open only to 4th year Commerce students."}, {"name": "MGT421H5 • Advanced Audit & Assurance", "description": "The course focuses on the reasoning and evidence theory underlying audit decision making. Coverage includes professional judgement, statistical auditing, assurance engagements, and public sector auditing.", "prerequisites": "MGT321H5"}, {"name": "MGT422H5 • Advanced IT Audit and Data Analytics", "description": "This course is an extension of the study of areas covered in the introductory audit course and will include the application of risk and materiality to more advanced topic areas with a focus on digitized information. Other topics include special reports, future-oriented financial information and prospectuses. The course will incorporate the use of data analytics in auditing and will explore how to analyze financial data in order to assist in audit engagements.", "prerequisites": "MGT321H5"}, {"name": "MGT423H5 • Canadian Income Taxation I", "description": "This is the first of two courses in federal income tax law. It is designed to give the student a basic understanding of the Income Tax Act and its administration. This is achieved by applying the law to practical problems and cases. Topics covered include administration of the tax system, employment income, business and property income, capital gains, other income and deductions, computation of taxable income and taxes payable for individuals. The GST/HST implications, where relevant, will also be discussed. The two course sequence (MGT423H5andMGT429H5) have been designed to provide participants with coverage of the tax content required by the professional accounting bodies.", "prerequisites": {"and": ["MGT120H5", "MGT220H5"], "or": []}}, {"name": "MGT428H5 • Management Control", "description": "Management control includes all the processes and systems, many accounting-based, by which key managers allegedly ensure that resources are acquired and used effectively and efficiently in the accomplishment of an organization's goals. The case method is used to provide an understanding of the issues and environment of management control.", "prerequisites": "MGT323H5"}, {"name": "MGT429H5 • Canadian Income Taxation II", "description": "This is the second of two courses in federal income tax law. It is designed to give the student an understanding of more complex issues of Canadian Income Tax law and tax planning. This is achieved through a combination of lectures and the application of the law to practical problems and case settings. Topics include computation of corporate taxes, integration, corporate reorganizations, surplus distributions, partnerships and trusts.", "prerequisites": "MGT423H5"}, {"name": "MGT430H5 • Behavioural Finance", "description": "This interdisciplinary course considers the ways in which human psychology influences financial decision making. Topics may include prospect theory, overconfidence, mental accounting, emotions, and neurofinance.", "prerequisites": {"and": ["MGT231H5", "MGT232H5"], "or": []}}, {"name": "MGT431H5 • Advanced Topics in Corporate Finance", "description": "Application and development of the ideas inMGT231H5,MGT232H5to corporate finance problems such as initial public offerings and project evaluation.", "prerequisites": {"and": ["MGT231H5", "MGT232H5"], "or": []}}, {"name": "MGT434H5 • Mergers and Acquisitions", "description": "The main focus is to develop a solid understanding of the valuation of mergers and acquisitions from the perspective of a variety of stakeholders including: acquiring and target firm management, directors, and shareholders; financiers; consumers, and; competition regulators and policymakers. Themes to be explored include M&A and corporate strategy, motivations for M&A, corporate restructuring and divestitures, financing of M&A activity, dealing with competition authorities, and M&A 'waves' over the past century.", "prerequisites": {"and": ["MGT231H5", "MGT232H5"], "or": []}}, {"name": "MGT435H5 • Financial Market Trading", "description": "This Li Koon Chun Finance Learning Centre (FLC) lab-based course will provide a hands-on introduction to the functioning of security markets and the trading of financial instruments. Students will learn how the market prices financial securities, how to use the Python programming language and finance theory to develop trading strategies, and how to identify and manage risks of trading strategies. Cases will cover various securities, such as fixed income securities, equities, futures and options. Students will further learn how to deal with various kinds of risks, such as liquidity risk, market risk, downside risk, crash risk, and credit risk.", "prerequisites": {"and": ["MGT231H5", "MGT232H5", "MGT330H5"], "or": []}}, {"name": "MGT437H5 • Strategy and Governance", "description": "This course covers concepts in strategic management and focuses on the role of corporate governance in formulating, implementing and monitoring a firm's strategic objectives. Although the course will cover economic foundations of strategy, market, industry and competitive analysis, the main focus will be on the internal operations of an organization. Corporate governance will be examined in the broad sense of the term and will include an overview of country-level legal environment, regulatory agencies, stock market, and the firm's board of directors. The objective of the course is to enhance students' understanding the operating tensions facing firms and the means of addressing such tensions through country-level and firm-level corporate governance systems.", "prerequisites": {"and": [{"and": [], "or": ["MGT322H5", "MGT225H5"]}, "MGT231H5"], "or": []}}, {"name": "MGT438H5 • Futures and Options Markets", "description": "Analysis of derivative instruments such as futures contracts, put and call options and swaps. Emphasis is placed on the valuation of these instruments as a foundation for valuing complex securities.", "prerequisites": "a minimum of 63% in both MGT231H5 and MGT232H5"}, {"name": "MGT440H5 • Fixed Income Markets", "description": "This is a capital markets course that describes important fixed income securities and markets. It will emphasize traditional bond and term structure concepts as well as current events and/or securities affecting the functioning of these markets.", "prerequisites": {"and": ["MGT231H5", "MGT232H5"], "or": []}}, {"name": "MGT442H5 • Financial Distress and Insolvency", "description": "Traditional business courses often deal with financially healthy firms. However, failure is an inevitable reality for many businesses. The problems currently being witnessed by the retail sector are a case in point. According to official Canadian government statistics, 3580 businesses filed for insolvency in 2018 alone, with more than a quarter of these businesses being from Ontario. This course aims to study the reasons why some firms find themselves in financial distress, alternative courses of action (including legal options) in response to financial distress, and the role of various stakeholders in the process.", "prerequisites": "MGT231H5 and 0.5 credit in MGT/MGM at the 300/400 level"}, {"name": "MGT443H5 • Quantitative Finance", "description": "This course represents a hands-on introduction to modern quantitative finance and risk-management models. The course will enable students to build computer algorithms tailored to financial problems. Emphasis is placed on high-frequency trading data,  portfolio optimization and factor models for security pricing, machine learning and prediction, risk quantification and management, and option pricing algorithms.", "prerequisites": {"and": [], "or": ["ECO220Y5", "STA256H5"]}}, {"name": "MGT444H5 • FinTech, Blockchain, & Decentralized Finance", "description": "This course provides students with a solid understanding of the technologies, tools, and applications that will transform and define the financial industry over the next decade. Students will study the technological and economic mechanisms that make blockchain work, the services it hosts, how it disrupts the financial industry, the risks, how a decentralized protocol can be governed and regulated, and what problems Decentralized Finance (DeFi) solves. Students will also learn about smart contracts, types of tokens and their uses, digital money, oracles, stablecoins, DeFi-lending and DeFi-trading, crypto-regulation, and central-bank-issued digital currencies. This course is geared to Commerce and Management students and does not require engineering or computer science knowledge.", "prerequisites": {"and": ["MGT120H5", {"and": [], "or": ["ECO200Y5", "ECO204Y5", "ECO206Y5"]}, "MGT330H5"], "or": []}}, {"name": "MGT445H5 • Enterprise Risk Management and Analytics", "description": "This course studies risk management from a holistic perspective for various institutions (i.e. non-financial and financial). Various risk categories will be considered such as investment risk, financial risk, cyber risk, operational risk, market risk, energy risk, technology risk, etc. Cases, models, and frameworks will be integrated into the course. Depending on current market issues, the data and cases may cover various areas from energy (i.e. weather), sports, accounting, finance, government (public), arts/entertainment, health, technology, etc. Special topics may also be considered such as environmental, social, and corporate governance (ESG) issues.", "prerequisites": {"and": ["ECO220Y5", "STA218H5", "MGT231H5", "MGT232H5"], "or": []}}, {"name": "MGT450H5 • Digital Marketing", "description": "This course explores various digital marketing strategies in the context of online and mobile advertising platforms, and will provide a comprehensive understanding of both existing marketing strategies and emerging trends. Various domains will be covered in this course (search, display, mobile, social, etc.) to enable students to explore how emerging technologies are used to facilitate B2B and B2C transactions. This class will explore the strengths and weaknesses of different approaches to digital marketing while helping students develop a better understanding of various elements of marketing campaigns from formulation to integration and assessment.", "prerequisites": "MGT252H5"}, {"name": "MGT451H5 • Business Strategy for the Digital Economy", "description": "Learn about the fastest growing sector of the economy and develop tools to analyze strategic problems within a business, and train rigorously, using theory and data, to think about new strategic opportunities for businesses in the digital age.", "prerequisites": {"and": ["MGT120H5", {"and": [], "or": ["ECO200Y5", "ECO204Y5", "ECO206Y5"]}], "or": []}}, {"name": "MGT452H5 • Marketing and Behavioural Economics", "description": "The emphasis in this course is on marketing decision making in a dynamic environment using behavioural economics and insights. The course focuses on the major decisions facing individuals in many different contexts in marketing, as well as economics, finance, and other areas of management. In turn, these insights help us to understand how managers can make more behaviourally informed decisions and create behaviourally informed organizations.", "prerequisites": "MGT252H5 and 1.0 credit in MGT or MGM credit at the 300 or 400 level."}, {"name": "MGT453H5 • Marketing Research", "description": "Marketing research is studied from the perspective of the marketing manager. The course focuses on the initiation, design, and interpretation of research as an aid to marketing decision making. Case studies and projects are used to provide students with some practical research experiences.", "prerequisites": {"and": ["MGT353H5", {"and": [], "or": ["MGT218H5", "ECO220Y5", "ECO227Y5", "STA218H5", {"and": ["STA256H5", "STA260H5"], "or": []}, {"and": ["STA256H5", "STA258H5"], "or": []}]}], "or": []}}, {"name": "MGT454H5 • Special Topics in Marketing", "description": "This course focuses on a specific theoretical or functional area of marketing. The area of concentration depends on the instructor. Examples of areas that may be covered include current issues in consumer behaviour, advertising, industrial marketing, or retailing. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "MGT353H5"}, {"name": "MGT455H5 • Marketing Consulting:  Models for Analysis", "description": "This course reviews the science side of marketing by studying multiple models used by companies and consulting firms in the different steps of the marketing process. The marketing consulting approach provides a deeper understanding of the process that supports marketing management decisions. This is of benefit not only for students following a marketing consulting path, but also for students joining marketing departments of Canadian firms. To enhance the learning experience the course will be strongly based on software applications that offer hands on exposure to real life corporate applications.", "prerequisites": {"and": [{"and": [], "or": ["MGT252H5", "MGM252H5"]}, {"and": [], "or": ["MGT218H5", "ECO220Y5", "STA221H5", "STA218H5"]}], "or": []}}, {"name": "MGT456H5 • Marketing Ethics", "description": "There is a growing public awareness of (and interest in) the ethics of marketing. Therefore, it is increasingly important for marketing practitioners to be attuned to the many ethical challenges that they will inevitably confront. This class explores these issues from a managerial perspective by reviewing relevant conceptual frameworks for ethics-based decision-making and extending them to real-world examples faced by marketers. In particular, we will explore ethical issues in pricing, product development, promotions, market segmentation, targeting, and market research, with an emphasis on how technological advancements have brought new considerations to the forefront of marketing ethics.", "prerequisites": "MGT353H5"}, {"name": "MGT457H5 • Business to Business Marketing", "description": "Business to business (B2B) marketing dwarfs business to consumer (B2C) marketing in terms of total transaction value. In this course we will focus on how B2B marketing is different from B2C marketing and how demand in the business market is derived from demand in the consumer market. We will also discuss customer and supplier relationships, supply chain development, and the impact of globalization on B2B marketing.", "prerequisites": "MGT353H5"}, {"name": "MGT458H5 • Big Data and Marketing Analysis", "description": "Recent advances in computer technology have led to an explosion in the amount of data available for companies to use for market research. In order to be effective as a marketing manager today, it is necessary to understand how to apply cutting edge statistical models to large databases, such as scanner data, loyalty program data, or internet marketing data, and to be able to obtain managerial insights from model results. This course will introduce students to marketing analytics driven by big data, using applications from real world business problems.", "prerequisites": "1.0 credit in MGT or MGM at the 300 or 400 level."}, {"name": "MGT461H5 • Negotiations", "description": "We negotiate every day - with potential employers, coworkers, roommates, landlords, parents, bosses, merchants, service providers, and even our friends and romantic partners. Negotiation is the art and science of securing agreements between two or more interdependent parties. It is a craft that must hold cooperation and competition in creative tension. It can be very difficult to do well. Even the most experienced negotiators often fall prey to common biases and errors in judgment. This course is highly experiential - students will practice, reflect, analyze, and practice again - and draws its insights from research in the cognitive, behavioral and social sciences.", "prerequisites": "3.0 credits of MGM or MGT at the 200-level"}, {"name": "MGT463H5 • Managing Global Organizations", "description": "Understanding the global context of organizations is essential to surviving the competitive business environment while creating value in a sustainable and responsible way. This course provides a broad overview of the global environment and introduce critical perspectives in international business, as well as the key management challenges of operating across nations and cultures. It will also consider ways in which management theories and practices should be adapted to transcend as well as be responsive to diverse business, social, and governmental settings. The course weaves together conceptual and practical considerations to create a balanced and exciting learning experience. It also includes an optional International Learning Experience component that involves travel to a country(s) outside of Canada to gain firsthand exposure to management practices in a different setting.", "prerequisites": "MGT262H5 or 1.0 credit in MGM/MGT at the 300 or 400-level"}, {"name": "MGT480H5 • Internship", "description": "Students will be provided with an opportunity to apply, in a practical business setting, the management knowledge they have gained through previous course work. This is accomplished through part-time unpaid work placements, or \"internships.\" The internship will provide students with a valuable opportunity to make personal contacts in the public or private sector. The course is also intended to help students acquire practical skills that will serve them well in the workplace. An application is required.", "prerequisites": "1.0 credit in MGT at the 300/400 level and 2.5 CGPA and 14.0 credits."}, {"name": "MGT491H5 • Introduction to International Business", "description": "Focuses on developing an understanding of the fundamentals of doing business in an international environment. Based on the application of management theory, (trade theory, modes of entry, foreign direct investment, theory of the multinational) to the strategic management problems of organizing business in the international arena.", "prerequisites": "1.0 credit in MGT/MGM at the 300/400 level"}, {"name": "MGT492H5 • Introduction to Strategic Management", "description": "Focuses on industry analysis and different models of the firm. The key questions addressed are: \"why do some firms succeed where others fail?\" and \"what strategy should a firm employ to reach its goals?\"", "prerequisites": "1.0 credit in MGT/MGM at 300/400 level"}, {"name": "MGT493H5 • Small Business Management", "description": "Skills needed to set up and run a small business. Development of a business plan. Securing financing. Finding and keeping customers. Operations management. Aspects of legal, financial and taxation concerns of smaller businesses.", "prerequisites": "MGT231H5 and MGT232H5 and 1.0 credit of MGT/MGM at the 300/400 level"}, {"name": "MGT494H5 • Entrepreneurial Strategy", "description": "This course introduces students to the challenges an entrepreneur faces when starting a business: assessing his/her goals and ability, attracting financial and human resources, competing in the marketplace, and dealing with laws and regulations. Readings and discussion material will include actual business cases as well as academic articles and book chapters. The class is of relevance to students interested in starting new businesses, working in consulting or finance, and pursuing research and graduate studies.", "prerequisites": "Open to 3rd and 4th year Commerce and Management students."}, {"name": "MGT495H5 • Entrepreneurial Finance and Venture Capital", "description": "This course examines the elements of entrepreneurial finance, focusing on technology-based start-up ventures and the early stages of company development. The course addresses key questions which challenge all entrepreneurs: how much money can and should be raised; when should it be raised and from whom; what is a reasonable valuation of the company; how should funding, employment contracts and exit decisions be structured. It aims to prepare students for these decisions, both as entrepreneurs and venture capitalists. It also aims to create awareness to the specific issues faced by minorities in the entrepreneurship field. In addition, the course includes an in-depth analysis of the structure of the private equity industry.", "prerequisites": {"and": ["MGT231H5", "MGT232H5"], "or": []}}]