[{"name": "IMI301H5 • Essentials of Finance", "description": "The two main fields of finance are investments and the financing of corporations. In the investments segment, students first learn how individual investors decide on their investments based on the time value of money and risk and return trade-offs. In the corporate finance segment students will build on the insights from the investments segment to understand the financing of firms within the context of capital markets.", "prerequisites": "IMI203H5"}, {"name": "IMI302H5 • Managing Projects, Operations & Preparing a Business Plan", "description": "Every business needs to formulate the strategies by which it will compete successfully in the market place, and plan for the implementation of these strategies, which may include joint ventures, strategic alliances, etc. This requires operational capabilities, the preparation of business plans and project management skills.", "prerequisites": "IMI203H5"}, {"name": "IMI303H5 • Technology Strategy", "description": "Businesses typically want to grow and compete. Science oriented businesses rely on innovation, protected by intellectual property rights and patents, to gain and sustain competitive advantage. Entrepreneurial science-based start-up ventures especially need a strong intellectual foundation, and they need to raise capital.", "prerequisites": {"and": [], "or": ["ECO101H5", "ECO100Y5"]}}, {"name": "IMI399H5 • Research Opportunity Program", "description": "This course provides a rewarding opportunity for students in their third or fourth year to undertake relatively advanced work in the research project of a professor in return forIMI399H5course credit. Based on the nature of the project, projects may satisfy the Social Sciences or Sciences distribution requirement. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "8.0 credits and permission of instructor"}, {"name": "IMI400H5 • Innovation and Entrepreneurship", "description": "Students in this course will analyze business cases, read academic studies, and interact with guest lecturers to gain familiarity with the major challenges that entrepreneurs encounter in successfully bringing innovations to market. Topics to be addressed include market and industry analysis, managing value chains, competing and positioning in the marketplace, negotiating for and obtaining financial resources, defining a business model, writing a business plan, and growth and exit strategies. In addition to more \"traditional\" lectures, there will be a number of guest lectures, especially in the second half of the course, provided from practitioners in different areas of interest, including current entrepreneurs, technologists, early-stage investors, and IP lawyers. The course is open to 2nd-, 3rd- and 4th-year students in all programs and does not require any prerequisites.", "prerequisites": "8.0 credits and permission of instructor"}, {"name": "IMI499H5 • Research Opportunity Program", "description": "This course provides a rewarding opportunity for students in their fourth year to undertake relatively advanced work in the research project of a professor in return forIMI499H5course credit. Based on the nature of the project, projects may satisfy the Social Sciences or Sciences distribution requirement. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "14.0 credits and permission of instructor"}]