[{"name": "MAT102H5 • Introduction to Mathematical Proofs", "description": "Understanding, using and developing precise expressions of mathematical ideas, including definitions and theorems. Set theory, logical statements and proofs, induction, topics chosen from combinatorics, elementary number theory, Euclidean geometry.", "prerequisites": "Minimum 70% in Grade 12 Advanced Functions (MHF4U)"}, {"name": "MAT132H5 • Differential Calculus for Life Sciences", "description": "Review of functions and their graphs, trigonometry, exponentials and logarithms. Limits and continuity of functions of a single variable. Derivatives and differentiation techniques. Applications of differentiation, including extreme values, related rates and optimization. Life science applications are emphasized.", "prerequisites": "Minimum 70% in Grade 12 Advanced Functions (MHF4U)"}, {"name": "MAT133Y5 • Calculus and Linear Algebra for Commerce", "description": "Mathematics of finance, matrices and linear equations. Review of differential calculus; applications. Integration and fundamental theorem; applications. Introduction to partial differentiation; applications. NOTE: This course cannot be used as the calculus prerequisite for any 200-level MAT or STA course, except in combination withMAT233H5.", "prerequisites": "Minimum 70% in Grade 12 Advanced Functions (MHF4U)."}, {"name": "MAT134H5 • Integral Calculus for Life Sciences", "description": "Continuation ofMAT132H5. Antiderivatives and indefinite integrals in one variable, definite integrals and the fundamental theorem of calculus. Integration techniques and applications of integration. Infinite sequences, series and convergence tests. Power series, Taylor and Maclaurin series. Life science applications are emphasized.", "prerequisites": {"and": [], "or": ["MAT132H5", "MAT135H5", "MAT137H5", "MAT157H5", "MAT135H1", "MATA29H3", "MATA30H3", "MATA31H3"]}}, {"name": "MAT135H5 • Differential Calculus", "description": "Review of functions and their graphs, trigonometry, exponentials and logarithms. Limits and continuity of functions of a single variable. Derivatives and differentiation techniques. Applications of differentiation, including extreme values, related rates and optimization. A wide range of applications from the sciences will be discussed.", "prerequisites": "Minimum 70% in Grade 12 Advanced Functions (MHF4U)"}, {"name": "MAT136H5 • Integral Calculus", "description": "Continuation ofMAT135H5. Antiderivatives and indefinite integrals in one variable, definite integrals and the fundamental theorem of calculus. Integration techniques and applications of integration. Infinite sequences, series and convergence tests. Power series, Taylor and Maclaurin series. A wide range of applications from the sciences will be discussed.", "prerequisites": {"and": [], "or": ["MAT132H5", "MAT135H5", "MAT137H5", "MAT157H5", "MAT135H1", "MATA29H3", "MATA30H3", "MATA31H3"]}}, {"name": "MAT137H5 • Differential Calculus for Mathematical Sciences", "description": "A conceptual approach to calculus. A focus on theoretical foundations and proofs as well as some emphasis on geometric and physical intuition. Limits and continuity, differentiation, the mean value, extreme value and inverse function theorems. Applications typically include related rates and optimization.", "prerequisites": "Minimum 70% in Grade 12 Advanced Functions (MHF4U) and Minimum 70% in Grade 12 Calculus and Vectors (MCV4U)."}, {"name": "MAT139H5 • Integral Calculus for Mathematical Sciences", "description": "Continuation ofMAT137H5. A conceptual sequel toMAT137H5. Integration, the fundamental theorem of calculus, sequences and series, power series and Taylor’s theorem. Applications typically include approximation, integration techniques, areas and volumes.", "prerequisites": {"and": [], "or": ["MAT137H5", "MAT157H5"]}}, {"name": "MAT157H5 • Analysis I", "description": "A rigorous and proof-intensive introduction to the analysis of single variable real-valued functions for students with a serious interest in mathematics. Topics typically include the construction of the real numbers, the epsilon-delta definition of the limit, continuity, and differentiation.", "prerequisites": "[Minimum 70% in Grade 12 Advanced Functions (MHF4U)] and [Minimum 70% in Grade 12 Calculus and Vectors (MCV4U)]"}, {"name": "MAT159H5 • Analysis II", "description": "Continuation ofMAT157H5. A rigorous and proof-intensive sequel toMAT157H5for students with a serious interest in mathematics. Topics typically include sequences, series, and integration of single variable real-valued functions.", "prerequisites": "MAT157H5"}, {"name": "MAT202H5 • Introduction to Discrete Mathematics", "description": "Mathematics derives its great power from its ability to formulate abstract concepts and techniques. In this course, students will be introduced to abstraction and its power through a study of topics from discrete mathematics. The topics covered will include: Sets, relations and functions; Basic counting techniques: subsets, permutations, finite sequences, inclusion-exclusion; Discrete probability: random variables paradoxes and surprises; Basic number theory: properties of the integers and the primes. The course will emphasize active participation of the students in discussion and written assignments.", "prerequisites": {"and": ["MAT102H5", {"and": [], "or": ["MAT134H5", "MAT136H5", "MAT137Y5", "MAT139H5", "MAT157Y5", "MAT159H5", "MAT233H5"]}], "or": []}}, {"name": "MAT223H5 • Linear Algebra I", "description": "Systems of linear equations, matrix algebra, determinants. Vector geometry in R2 and R3. Complex numbers. Rn: subspaces, linear independence, bases, dimension, column spaces, null spaces, rank and dimension formula. Orthogonality, orthonormal sets, Gram-Schmidt orthogonalization process, least square approximation. Linear transformations from Rn to Rm. The determinant, classical adjoint, Cramer's rule. Eigenvalues, eigenvectors, eigenspaces, diagonalization. Function spaces and applications to a system of linear differential equations. The real and complex number fields.", "prerequisites": "Grade 12 Advanced Functions (MHF4U) and Grade 12 Calculus and Vectors (MCV4U or MAT102H5)."}, {"name": "MAT224H5 • Linear Algebra II", "description": "Abstract vector spaces: subspaces, dimension theory. Linear mappings: kernel, image, dimension theorem, isomorphisms, matrix of a linear transformation. Change of basis, invariant subspaces, direct sums, cyclic subspaces, Cayley-Hamilton theorem. Inner product spaces, orthogonal transformations, orthogonal diagonalization, quadratic forms, positive definite matrices. Complex operators: Hermitian, unitary and normal. Spectral Theorem. Isometries of R2 and R3.", "prerequisites": {"and": ["MAT102H5", "MAT223H5"], "or": []}}, {"name": "MAT232H5 • Calculus of Several Variables", "description": "Differential and integral calculus of several variables: partial differentiation, chain rule, extremal problems, Lagrange multipliers, classification of critical points. Multiple integrals, Green's theorem and related topics.", "prerequisites": {"and": [], "or": ["MAT134H5", "MAT136H5", "MAT137Y5", "MAT139H5", "MAT157Y5", "MAT159H5"]}}, {"name": "MAT233H5 • Calculus of Several Variables", "description": "\"Bridging Course\"; accepted as prerequisite for upper level courses in replacement ofMAT232H5. Limited Enrolment. Sequences and series, power series, Taylor series, trigonometric and inverse trigonometric functions and their use in integrations. Differential and integral calculus of several variables; partial differentiation, chain rule, extremal problems, Lagrange multipliers, classification of critical points. Multiple integrals, Green's theorem and related topics.", "prerequisites": "MAT134H5 or MAT136H5 or MAT137Y5 or MAT139H5 or MAT157Y5 or MAT159H5 or 65% in MAT133Y5"}, {"name": "MAT236H5 • Vector Calculus", "description": "The implicit function theorem, vector fields. Transformations. Parametrized integrals. Line, surface and volume integrals. Theorems of Gauss and Stokes with applications.", "prerequisites": {"and": ["MAT102H5", {"and": [], "or": ["MAT223H5", "MAT240H5"]}, {"and": [], "or": ["MAT232H5", "MAT233H5"]}], "or": []}}, {"name": "MAT240H5 • Algebra I", "description": "A theoretical approach to Linear Algebra and its foundations, aimed at students with a serious interest in Mathematics. Topics to be covered: Vector spaces over arbitrary fields (including C and finite fields), linear equations and matrices, bases and linear independence, linear transformations, determinants, eigenvalues and eigenvectors, similarity, change of basis, diagonalization, the characteristic and minimal polynomials, the Cayley-Hamilton theorem.", "prerequisites": "(65% in MAT102H5) or MAT157H5 or MAT157Y1"}, {"name": "MAT244H5 • Differential Equations I", "description": "Ordinary differential equations of the first and second order, existence and uniqueness; solutions by series and integrals; linear systems of first order; linearization of non-linear systems. Applications in life and physical sciences. Power series solutions, boundary value problems, Fourier series solutions, numerical methods.", "prerequisites": "(MAT134H5 or MAT136H5 or MAT137Y5 or MAT139H5 or MAT157Y5 or MAT159H5 or MAT233H5) and (MAT223H5 or MAT240H5)."}, {"name": "MAT247H5 • Algebra II", "description": "Continuation ofMAT240H5. A theoretical approach to real and complex inner product spaces, isometries, orthogonal and unitary matrices and transformations. The adjoint. Hermitian and symmetric transformations. Spectral theorem for symmetric and normal transformations. Polar representation theorem. Primary decomposition theorem. Rational and Jordan canonical forms. Additional topics including dual spaces, quotient spaces, bilinear forms, quadratic surfaces, multilinear algebra.", "prerequisites": {"and": [], "or": ["MAT240H5", "MAT240H1"]}}, {"name": "MAT257Y5 • Analysis III", "description": "A rigorous and proof-intensive course in multivariable calculus for students with a serious interest in mathematics.  Topology of metric spaces; compactness, functions and continuity, the extreme value theorem. Derivatives; inverse and implicit function theorems, maxima and minima. Integration; Fubini's theorem, partitions of unity, change of variables. Integration on manifolds; Stokes' theorem.", "prerequisites": {"and": [{"and": [], "or": ["MAT157Y5", "MAT159H5"]}, "MAT240H5"], "or": []}}, {"name": "MAT264H5 • Introduction to Numerical Analysis", "description": "Most applications of Mathematics involve the use of a computer. Numerical analysis studies how formulas can be transformed into computations. The topics covered may include: numerical methods in Calculus, such as series expansions and rates of convergence, numerical integration and differentiation, finite interpolation methods, splines; and numerical methods for ordinary differential equations, such as root-finding methods, Fourier series and Fourier transform, least-squares approximation, regression, and principal component analysis.", "prerequisites": {"and": [], "or": ["MAT244H5", "MAT244H1", "MAT267H1", "MATB44H3"]}}, {"name": "MAT299H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeResearch Opportunity Program (ROP)for more details.", "prerequisites": "MAT244H5 or MAT244H1 or MAT267H1 or MATB44H3"}, {"name": "MAT299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Departmental permission."}, {"name": "MAT301H5 • Groups and Symmetries", "description": "Permutations and permutation groups. Linear groups. Abstract groups, homomorphisms, subgroups. Symmetry groups of regular polygons and platonic solids, wallpaper groups. Group actions, class formula. Cosets, Lagrange's theorem. Normal subgroups, quotient groups. Classification of finitely generated Abelian Groups. Emphasis on examples and calculations.", "prerequisites": {"and": ["MAT102H5", {"and": [], "or": ["MAT202H5", "MAT224H5", "MAT240H5"]}], "or": []}}, {"name": "MAT302H5 • Introduction to Algebraic Cryptography", "description": "(Cross list withCSC322H5) The course will take students on a journey through the methods of algebra and number theory in cryptography, from Euclid to Zero Knowledge Proofs. Topics include: block ciphers and the Advanced Encryption Standard (AES); algebraic and number-theoretic techniques and algorithms in cryptography, including methods for primality testing and factoring large numbers; encryption and digital signature systems based on RSA, factoring, elliptic curves and integer lattices; and zero-knowledge proofs.", "prerequisites": {"and": [{"and": [], "or": ["MAT224H5", "MAT240H5"]}, "MAT301H5"], "or": []}}, {"name": "MAT305H5 • Elementary Lie Theory", "description": "This course is an introduction to the theory of matrix groups with a particular emphasis on applications and examples. This course will cover orthogonal transformations in two and three dimensions, quaternions, isometries of Euclidean space, Lie algebras and matrix exponentials.", "prerequisites": {"and": [], "or": [{"and": [{"and": [], "or": ["MAT224H5", "MAT240H5"]}, "MAT236H5"], "or": []}, "MAT257Y5"]}}, {"name": "MAT307H5 • Curves and Surfaces", "description": "This course is an introduction to the theory of curves and surfaces with a particular emphasis on applications and computational techniques. This course will cover curves in R2 and R3, curvature, torsion, differential of maps, First Fundamental Form, Parallel transport, Bishop Frames, Geodesics, Gauss-Bonnet Theorem, and Gaussian curvature.", "prerequisites": {"and": [], "or": [{"and": [{"and": [], "or": ["MAT224H5", "MAT240H5"]}, {"and": [], "or": ["MAT232H5", "MAT233H5"]}], "or": []}, "MAT257Y5"]}}, {"name": "MAT309H5 • Introduction to Mathematical Logic", "description": "The relationships among axioms, proofs, consistency and truth in mathematics. Soundness and Completeness. Introductions to model theory, set theory, and computability; arithmetic as a central example. Gödel's incompleteness theorems; outlines of their proofs. This course emphasizes rigour.", "prerequisites": "MAT257Y5 or [MAT236H5 and (MAT202H5 or MAT224H5 or MAT240H5) and 0.5 additional credit of MAT at the 300+ level]"}, {"name": "MAT311H5 • Partial Differential Equations", "description": "Partial differential equations of applied mathematics, mathematical models of physical phenomena, basic methodology.", "prerequisites": {"and": [], "or": ["MAT257Y5", {"and": ["MAT236H5", "MAT244H5"], "or": []}]}}, {"name": "MAT315H5 • Introduction to Number Theory", "description": "Elementary topics in number theory such as: prime numbers; arithmetic with residues; Gaussian integers, quadratic reciprocity law, representation of numbers as sums of squares. (This course emphasizes rigour).", "prerequisites": {"and": ["MAT102H5", {"and": [], "or": ["MAT134H5", "MAT136H5", "MAT137Y5", "MAT139H5", "MAT157Y5", "MAT159H5", "MAT233H5"]}, {"and": [], "or": ["MAT224H5", "MAT240H5"]}, "MAT301H5"], "or": []}}, {"name": "MAT322H5 • Mathematical Modelling in Biology", "description": "The course will serve as an introduction to mathematical modelling of biological processes. It will cover a selection of the following topics: Difference equations and applications. Linear differential equations and systems; phase plane analysis; nonlinear systems of differential equations and linearization; Poincaré-Bendixson Theorem. Applications of differential equations to biology, including a logistic population with harvesting; predator-prey model; competing species; epidemic models. Examples of partial differential equations; reaction-diffusion equation; pattern formation.", "prerequisites": {"and": ["MAT102H5", {"and": [], "or": ["MAT134H5", "MAT136H5", "MAT137Y5", "MAT139H5", "MAT157Y5", "MAT159H5", "MAT233H5"]}, {"and": [], "or": ["MAT223H5", "MAT240H5"]}], "or": []}}, {"name": "MAT332H5 • Introduction to Nonlinear Dynamics and Chaos", "description": "Stability in nonlinear systems of differential equations, bifurcation theory, chaos, strange attractors, iteration of nonlinear mappings and fractals. This course will be geared towards students with interest in sciences.", "prerequisites": {"and": [], "or": ["MAT257Y5", {"and": ["MAT236H5", {"and": [], "or": ["MAT223H5", "MAT240H5"]}, "MAT244H5"], "or": []}]}}, {"name": "MAT334H5 • Complex Variables", "description": "Theory of functions of one complex variable: analytic and meromorphic functions; Cauchy's theorem, residue calculus. Topics from: conformal mappings, analytic continuation, harmonic functions.", "prerequisites": "MAT257Y5 or [(MAT232H5 or MAT233H5) and (MAT202H5 or MAT240H5 or 0.5 additional credit of MAT at the 300+ level with a mark of at least 60%)]"}, {"name": "MAT337H5 • Introduction to Real Analysis", "description": "The real numbers; Sequences and series; Functional limits; Topology in R^n; Differentiation and Integration; Power Series; Metric Spaces; Integrability and sets of measure zero. The course emphasizes rigour and theory.", "prerequisites": {"and": [], "or": ["MAT257Y5", {"and": [{"and": [], "or": ["MAT224H5", "MAT240H5"]}, "MAT236H5", "MAT244H5"], "or": []}]}}, {"name": "MAT344H5 • Introduction to Combinatorics", "description": "Basic counting principles, generating functions, permutations with restrictions. Fundamentals of graph theory with algorithms; applications (including network flows).", "prerequisites": {"and": ["MAT102H5", {"and": [], "or": ["MAT223H5", "MAT240H5"]}], "or": []}}, {"name": "MAT354H5 • Complex Analysis", "description": "Complex numbers, the complex plane and Riemann sphere, Möbius transformations, elementary functions and their mapping properties, conformal mapping, holomorphic functions, Cauchy's theorem and integral formula. Taylor and Laurent series, maximum modulus principle, Schwarz' lemma, residue theorem and residue calculus.", "prerequisites": {"and": [], "or": ["MAT257Y5", {"and": [{"and": [], "or": ["MAT137Y5", "MAT139H5", "MAT157Y5", "MAT159H5"]}, {"and": [], "or": ["MAT202H5", "MAT240H5", "MAT337H5"]}, {"and": [], "or": ["MAT232H5", "MAT233H5"]}], "or": []}]}}, {"name": "MAT382H5 • Mathematics for Teachers", "description": "The course discusses the Mathematics curriculum (K-12) from the following aspects: the strands of the curriculum and their place in the world of Mathematics, the nature of the proofs, applications of Mathematics, and the connection of Mathematics to other subjects. Restricted to students in the MAT major and specialist programs.", "prerequisites": "(Minimum 60% in MAT134H5 or MAT136H5 or MAT137Y5 or MAT139H5 or MAT157Y5 or MAT159H5 or MAT233H5) and [minimum 60% in MAT102H5 and (MAT223H5 or MAT240H5)] and 0.5 additional credit of MAT at the 200+ level."}, {"name": "MAT386H5 • Topics in Applied Mathematics", "description": "Introduction to a topic of current interest in applied mathematics. Content will vary from year to year. The contact hours for this course may vary in terms of contact type (L, T) from year to year, but will be between 36-48 contact hours in total. See the UTM Timetable.", "prerequisites": "Appropriate prerequisite requirement(s) will be available on the UTM timetable along with the topic title prior to course registration."}, {"name": "MAT387H5 • Topics in Mathematics", "description": "Introduction to a topic of current interest in mathematics. Content will vary from year to year. The contact hours for this course may vary in terms of contact type (L, T) from year to year, but will be between 36-60 contact hours in total. See the UTM Timetable.", "prerequisites": "Appropriate prerequisite requirement(s) will be available on the UTM timetable along with the topic title prior to course registration."}, {"name": "MAT388H5 • Topics in Mathematics", "description": "Introduction to a topic of current interest in mathematics. Content will vary from year to year. This course may include a tutorial and/or practical section in some years. The contact hours for this course may vary in terms of contact type (L, T) from year to year, but will be between 36-60 contact hours in total. See the UTM Timetable.", "prerequisites": "Appropriate prerequisite requirement(s) will be available on the UTM timetable along with the topic title prior to course registration."}, {"name": "MAT392H5 • Ideas of Mathematics", "description": "This is a one-term course to give students extensive practice in the writing of mathematics. The format will be to study excellent expositions of important ideas of mathematics and then to assign short writing assignments based on them.", "prerequisites": {"and": ["MAT202H5", "MAT244H5", {"and": [], "or": ["MAT236H5", "MAT257Y5"]}, {"and": [], "or": ["MAT224H5", "MAT247H5"]}], "or": []}}, {"name": "MAT397H5 • Further Studies in Mathematics", "description": "Students explore a topic in mathematics under the supervision of a faculty member.", "prerequisites": "Permission of instructor and department, a minimum CGPA of 3.5 and completion of at least 4.0 credits of MAT courses."}, {"name": "MAT398H5 • Further Studies in Mathematics", "description": "Students explore a topic in mathematics under the supervision of a faculty member.", "prerequisites": "Permission of instructor and department, a minimum CGPA of 3.5 and completion of at least 4.0 credits of MAT courses."}, {"name": "MAT399H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third or fourth year to work in the research project of a professor in return for 399H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeResearch Opportunity Program (ROP)for more details.", "prerequisites": "Permission of instructor and department, a minimum CGPA of 3.5 and completion of at least 4.0 credits of MAT courses."}, {"name": "MAT399Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third or fourth year to work in the research project of a professor in return for 399Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeResearch Opportunity Program (ROP)for more details.", "prerequisites": "Permission of instructor and department, a minimum CGPA of 3.5 and completion of at least 4.0 credits of MAT courses."}, {"name": "MAT401H5 • Polynomial Equations and Fields", "description": "Commutative rings; quotient rings. Construction of the rationals. Polynomial algebra. Fields and Galois theory: Field extentions, adjunction of roots of a polynomial. Constructibiliy, trisection of angles, construction of regular polygons. Galois groups of polynomials, in particular cubics, quartics. Insolvability of quintics by radicals.", "prerequisites": {"and": [{"and": [], "or": ["MAT224H5", "MAT240H5"]}, {"and": [], "or": ["MAT236H5", "MAT257Y5"]}, "MAT301H5"], "or": []}}, {"name": "MAT402H5 • Classical Geometries", "description": "Euclidean and non-Euclidean plane and space geometries. Real and complex projective space. Models of the hyperbolic plane. Connections with the geometry of surfaces.", "prerequisites": "MAT102H5 and (MAT232H5 or MAT233H5 or MAT257Y5) and (MAT224H5 or MAT240H5) and 0.5 additional credit of MAT at the 300+ level."}, {"name": "MAT405H5 • Introduction to Topology", "description": "Sets and functions; Topology in R^n; Topological spaces; Open and closed sets; Closure and interior; Continuous functions; Quotient spaces; Connectedness and compactness; Separation axioms and related theorems.", "prerequisites": "MAT257Y5 or [(MAT224H5 or MAT240H5) and MAT236H5 and at least 0.5 additional credit of MAT at the 300+ level with a mark of at least 65%]"}, {"name": "MAT406H5 • Mathematical Introduction to Game Theory", "description": "Combinatorial games: Nim and other impartial games; Sprague-Grundy value; existence of a winning strategy in partisan games. Two-player (matrix) games: zero-sum games and Von-Neuman's minimax theorem; general sum-matrix games, prisoner's dilemma, Nash equilibrium, cooperative games, asymmetric information. Multi-player games: coalitions and the Shapley value. Possible additional topics: repeated (stochastic) games; auctions; voting schemes and Arrow's paradox. Mathematical tools that may be introduced include hyperplane separation of convex sets and Brouwer's fixed point theorem. Numerous examples will be analyzed in depth, to offer insight to the mathematical theory and its relation with real life situations.", "prerequisites": {"and": ["MAT102H5", {"and": [], "or": ["MAT223H5", "MAT240H5"]}, {"and": [], "or": ["STA246H5", "STA256H5"]}], "or": []}}, {"name": "MAT478H5 • Topics in Mathematics", "description": "Introduction to a topic of current interest in mathematics. Content will vary from year to year. This course may include a tutorial and/or practical section in some years. The contact hours for this course may vary in terms of contact type (L, T) from year to year, but will be between 36-60 contact hours in total. See the UTM Timetable.", "prerequisites": "Appropriate prerequisite requirement(s) will be available on the UTM timetable along with the topic title prior to course registration."}, {"name": "MAT486H5 • Topics in Applied Mathematics", "description": "Introduction to a topic of current interest in applied mathematics. Content will vary from year to year. The contact hours for this course may vary in terms of contact type (L, T) from year to year, but will be between 36-48 contact hours in total. See the UTM Timetable.", "prerequisites": "Appropriate prerequisite requirement(s) will be available on the UTM timetable along with the topic title prior to course registration."}, {"name": "MAT488H5 • Topics in Mathematics", "description": "Introduction to a topic of current interest in mathematics. Content will vary from year to year. This course may include a tutorial and/or practical section in some years. The contact hours for this course may vary in terms of contact type (L, T) from year to year, but will be between 36-60 contact hours in total. See the UTM Timetable.", "prerequisites": "Appropriate prerequisite requirement(s) will be available on the UTM timetable along with the topic title prior to course registration."}, {"name": "MAT492H5 • Senior Thesis", "description": "An exposition on a topic in mathematics written under the supervision of a faculty member. Open to students in Mathematical Sciences Specialist program.", "prerequisites": "MAT392H5 and 2.0 additional credits in MAT at the 300 level and a minimum CGPA of 2.5"}, {"name": "MAT497H5 • Further Studies in Mathematics", "description": "Students explore a topic in mathematics under the supervision of a faculty member.", "prerequisites": "Permission of instructor and department, a minimum CGPA of 3.5 and completion of at least 6.0 credits of MAT courses."}, {"name": "MAT498H5 • Further Studies in Mathematics", "description": "Students explore a topic in mathematics under the supervision of a faculty member.", "prerequisites": "Permission of instructor and department, a minimum CGPA of 3.5 and completion of at least 6.0 credits of MAT courses."}, {"name": "MAT499H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third or fourth year to work in the research project of a professor in return for 499H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeResearch Opportunity Program (ROP)for more details.", "prerequisites": "Permission of instructor and department, a minimum CGPA of 3.5 and completion of at least 6.0 credits of MAT courses."}, {"name": "MAT499Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third or fourth year to work in the research project of a professor in return for 499Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeResearch Opportunity Program (ROP)for more details.", "prerequisites": "Permission of instructor and department, a minimum CGPA of 3.5 and completion of at least 6.0 credits of MAT courses."}]