[{"name": "PHL200H5 • Ancient Philosophy", "description": "Some core texts of ancient philosophy, concentrating on the work of Plato and Aristotle. Topics include the good life, the soul, knowledge, virtue and the nature of reality.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL204H5 • Philosophy in Everyday Life", "description": "This one-semester course covers philosophical topics that most people talk about, or at least think about, in their everyday lives,—e.g., during conversations with friends, or while watching the news, or when deciding how to vote in an election. Such topics include, for example, the difference between art and pornography, the possibility of life after death, the evolution vs. creationism debate, the ethics of abortion and doctor-assisted suicide, and the possibility of intelligent robots. Each topic will be introduced via relevant public media (e.g., articles from the New York Times series “The Stone” and similar pieces from The Guardian, CBC news, NPR) and other popular sources (e.g., Ted Talks, youtube videos)) and then pursued in several accessible readings from the philosophical literature. A shared “library” of readings for the course will be built up (e.g., on Blackboard) by the instructors and students and updated as new issues of popular interest arise.Note:PHL204H5does not count for credit toward any minor, major, or specialist program in philosophy, but can be taken to fulfill the Humanities breadth/ distribution requirement.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL210Y5 • 17th and 18th Century Philosophy", "description": "17th and 18th century discussions of topics like causation, knowledge, mind-body dualism in philosophers like René Descartes, Baruch Spinoza, John Locke, Anne Conway, Gottfried Wilhelm Leibniz, Émilie du Chatelêt, David Hume, Immanuel Kant.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL220H5 • Existentialism", "description": "Human perception and knowledge of reality; freedom and the meaning of human life; sexuality and the body. Authors include Heidegger, Buber, Marcel, Camus, Sartre, de Beauvoir, Merleau-Ponty.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL221H5 • Philosophy at the Movies", "description": "This course considers fundamental philosophical themes - the meaning of life and death, the nature of responsibility, fate and agency, knowledge and illusion, personal identity, alienation and belonging, love and sex, politics, ethics, and morality, among others - through film. The course also considers some questions about film as a philosophical genre: of the medium of film as an alternative medium (an alternative to language and explicit argument) of philosophical expression; of whether and how film may convey philosophical insight otherwise unavailable; and of the role of interpretation in understanding film philosophically.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL233H5 • Philosophy for Scientists", "description": "An introduction to philosophy tailored for students with backgrounds in mathematics and science. Topics include causation, explanation, the relation between scientific and mathematical theories and reality, the role of mathematics in scientific theories, the relevance of scientific and mathematical discoveries to ‘big’ traditional philosophical questions such as the nature of consciousness, whether we have free will, and the meaning of life.", "prerequisites": "PHL103H5 or PHL113H5 or 4.0 credits."}, {"name": "PHL235H5 • Philosophy of Religion", "description": "A philosophical analysis of some basic theological questions; the nature of religious belief and experience, the relationship between religion and morality, or religion and science, the role of religion in a pluralistic society.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL237H5 • Introduction to East Asian Philosophy", "description": "An introduction to the main systems of East Asian philosophy, including Confucianism, Taoism, Buddhism, Shintoism, and Neo-Confucianism; the challenge of Western thought; the development of modern East Asian Philosophy.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL113H5 or 4.0 credits"}, {"name": "PHL238H5 • Introduction to South Asian Philosophy", "description": "An introduction to the main philosophical traditions of South Asia, focusing on their historical development and treatment of topics such as devotion, duty, ethics, consciousness, selfhood, suffering, meditation, enlightenment, knowledge, and reality. Readings may include the early Rig Veda, the Upanishads, early Buddhist thought, Jainism, Samkhya-Yoga Philosophy, and Classical Vedanta, among others.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL113H5 or 4.0 credits"}, {"name": "PHL239H5 • Critical Reasoning", "description": "The course covers the area of informal logic--the logic of ordinary language. Topics include: criteria for the critical assessment of arguments as strong or merely persuasive; different types of argument and techniques of refutation; their use and abuse.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL113H5 or 4.0 credits"}, {"name": "PHL240H5 • Minds and Machines", "description": "Can machines think and feel? Are human beings simply very complicated organic machines? These questions are discussed in the light of recent work on the simulation of intelligence and purposive behaviour.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits. ."}, {"name": "PHL242H5 • Science Fiction and Philosophy", "description": "Science fiction is a rich resource for philosophical thinking. Are we in a matrix? Are there alternative realities? Is teleportation, or telepathy, or telekinesis, or time travel, possible? In addition, philosophical thought experiments often include elements of science fiction, like twin-earths, zombies, swamp people, inverted spectra, brain-splitting, eternal recurrences, and evil demons. This course considers these topics -- both some philosophy of science fiction and some science fiction in philosophy.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL243H5 • Philosophy of Human Sexuality", "description": "Philosophical issues about sex and sexual identity in the light of biological, psychological, and ethical theories of sex and gender. The concept of gender; male and female sex roles; theories of psycho-sexual development; sexual morality; \"natural,\" \"normal,\" and \"perverse\" sex; sexual liberation; love and sexuality.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL244H5 • Human Nature", "description": "Theories of human nature, e.g., psychoanalysis, behaviourism, sociobiology. Current issues, e.g., egoism and altruism, instincts, I.Q., rationality, sanity and mental illness.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL245H5 • Modern Symbolic Logic", "description": "An introduction to formal deductive logic. Semantics, symbolization, and techniques of natural deduction in sentential logic. Symbolization, natural deduction, and models in monadic predicate logic. Symbolization and natural deduction with polyadic predicates. Introduction to advanced concepts in first-order logic, such as operations, identity, and models.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL246H5 • Probability and Inductive Logic", "description": "The elements of axiomatic probability theory, and its main interpretations (frequency, logical, subjective). Reasoning with probabilities in decision making and science.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL255H5 • Philosophy of Science", "description": "The nature of science and its development. Topics may include: the contrast between science and religion, between science and pseudo-science; the nature of scientific reasoning; scientific reality; science and objectivity; scientific revolutions; and the interaction between science, society, and values.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL258H5 • Puzzles and Paradoxes", "description": "Philosophy often begins with a puzzle or paradox. Zeno once convincingly argued that motion was impossible, but people continue to move. The \"liar's paradox\" seems to show that everything is both true and false, but that cannot be right. In this course, we will examine these and related issues.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL265H5 • Social and Political Philosophy", "description": "A survey of the major political theorists/theories of the Western philosophical tradition. Questions to be addressed include: Why obey the law? What is justice? What is the best form of government?", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL267H5 • Feminism", "description": "Main types of feminist theory: liberal, Marxist, Existential and \"Radical.\" A number of ethical, political and psychological issues are considered.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL271H5 • Ethics and the Law", "description": "Moral issues in the law, such as civil liberties and police powers, censorship, civil disobedience, the death penalty, inequality, paternalism and the constitutional protection of human rights. Case studies from Canadian law.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL272H5 • Philosophy of Education", "description": "The nature, aims, and content of education; learning theory; education and indoctrination; the teaching of morals and the morality of teaching; the role and justification of educational institutions, their relation to society and to individual goals; authority and freedom in the school.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL273H5 • Environmental Ethics", "description": "Environmental ethics is a relatively new development in philosophical thinking which focuses on the ethical and value questions arising from our relation to nature. Focal question of the area asks: Is the non-human world of ethical significance only insofar as it is connected with human well-being, or is ethically significant in itself? This course investigates and evaluates anthropocentrim, ecofeminism and radical biocentric theories of the deep ecologists.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL274H5 • Ethics and Society", "description": "The course explores ethical problems posed by social issues such as inequality, poverty, war, corporate responsibility, the treatment of animals, and social media, against the background of major ethical and political theories.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL275H5 • Ethics and Moral Philosophy", "description": "A survey of the major moral theorists/theories of the Western philosophical tradition. Questions to be addressed include: Why be moral? What makes certain actions right or wrong? Can we know what is morally right or wrong?", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL277Y5 • Moral, Social and Political Philosophy Through Its History", "description": "Classics in moral, social and political philosophy from Plato to the present. Likely readings include Plato on justice in the state and in the individual, Aristotle's ethics, Hume's moral psychology, Hobbes on the social contract, Kant on the fundamental principle of morality, Mill's utilitarianism, Locke on rights, Marx on Capitalism, Nietzsche on the origins of modern morality, and Rawls and Nozick on distributive justice.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL282H5 • Ethics:  Death and Dying", "description": "(FormerlyPHL382H5) An intermediate-level study of moral and legal problems, including the philosophical significance of death, the high-tech prolongation of life, definition and determination of death, suicide, active and passive euthanasia, the withholding of treatment, palliative care and the control of pain, living wills; recent judicial decisions.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL113H5 or PHL105Y5 or 4.0 credits."}, {"name": "PHL283H5 • Bioethics", "description": "Moral implications of recent developments in medicine and the life sciences; related legal and social issues. Euthanasia, health care priorities, abortion, fertility control, against the background of some major ethical theories.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL284H5 • Ethics of Eating", "description": "What obligations do we have in light of the effects of our food choices? Do we have any obligations to non-human animals; are we obliged to spare them painful lives and deaths? Are we obligated to spare their lives altogether? What about our obligations to our fellow humans, and to the environment that future humans will live in? Are we obligated to choose foods that minimize harm to the environment and to other communities? We will explore these questions at both the individual and the social-policy levels. For example, should we as a society have laws that ban certain foods, or certain treatments of animals? Or do such laws trample the freedom of individual choice? Whatever laws we do have, are we as individuals obliged to take responsibility for what we eat? Or are the effects of our choices just an insignificant drop in the bucket, since they make no real difference given what everyone else is doing?", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL113H5 or PHL105Y5 or 4.0 credits"}, {"name": "PHL285H5 • Philosophy of Art", "description": "A study of some of the most important philosophical questions about art. For example, what exactly is a work of art? Can any object whatsoever be, or become, an artwork? Who or what determines whether something is art? Does each person decide for themselves, or does a certain community (the \"art world\") decide? Can one interpretation or evaluation of a work be better, or more justified, than another? If so, how do we tell which one is better?", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL290H5 • Philosophical Issues in Psychoanalysis", "description": "An introduction to dream psychology, the psychology of errors, instinct theory, mechanisms of defence, the structure of personality. Philosophical topics include: freedom and determinism, consciousness, the nature of conscience, the status of psychoanalysis.", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL105Y5 or PHL113H5 or 4.0 credits."}, {"name": "PHL293H5 • Special Topics in Philosophy", "description": "Topic to vary from year to year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "PHL103H5 or PHL113H5 or 4.0 credits"}, {"name": "PHL295H5 • Philosophy of Business", "description": "Philosophical issues in ethics, social theory, and theories of human nature insofar as they bear on contemporary conduct of business. Issues include: Does business have moral responsibilities? Can social costs and benefits be calculated? Does modern business life determine human nature of the other way around? Do political ideas and institutions such as democracy have a role within business?", "prerequisites": "PHL101H5 or PHL102H5 or PHL103H5 or PHL113H5 or PHL105Y5 or 4.0 credits."}, {"name": "PHL299Y5 • Research Opportunity Program", "description": "This course provides a rewarding opportunity for students intheir second year to work in the research project of aprofessor in return for 299Y course credit. Students enrolledhave an opportunity to become involved in originalresearch, learn research methods and share in theexcitement and discovery of acquiring new knowledge.Participating faculty members post their project descriptionsfor the following summer and fall/winter sessions in earlyFebruary and students are invited to apply in early March.SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "(PHL101H5 or PHL102H5 or PHL103H5 orPHL105Y5 or PHL113H5) (may be taken as a corequisite) or 4.0 credits"}, {"name": "PHL300H5 • Topics in Ancient Philosophy", "description": "A study of some topic or thinker in the ancient period.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL301H5 • The Philosophy of Plato", "description": "This course explores major themes in Plato’s philosophy through a selective reading of his dialogues. Among the areas tackled are the human good, the nature of the soul, knowledge, and the ultimate constitution of reality. Readings may include, though will not necessarily be confined to, the Euthyphro, Protagoras, Euthydemus, Meno, Gorgias, Republic, Phaedo, Phaedrus and Theaetetus.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL302H5 • The Philosophy of Aristotle", "description": "This course explores major themes in Aristotle’s philosophy belonging to the fields of natural philosophy, metaphysics, ethics and epistemology. Readings may include, though are not necessarily confined to the Ethics, Physics, Metaphysics, Categories, On the soul and Analytics.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL307H5 • Topics in Mediaeval Philosophy", "description": "A study of some of the principal figures and intellectual problems in the period from the first century to the sixteenth. Figures such as Philo, Augustine, Abelard, Avicenna, Maimonides, Aquinas, Duns Scotus, Ockham and Suarez will be studied on topics in metaphysics, epistemology, ethics and philosophy of nature.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL310H5 • Topics in 17th and 18th Century Philosophy", "description": "A study of a topic or thinker in the 17th or 18th century.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL311H5 • South Asian Philosophy", "description": "An intermediate-level course on one or more philosophical traditions from the South Asian world, including orthodox Indian schools (Nyaya, Vaisheshika, Samkhya, Yoga, Mimamsa, and Vedanta) and non-orthodox schools such as Buddhism and Jainism, with a focus on their theories of religion, ethics, epistemology, or metaphysics.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL314H5 • Kant", "description": "A systematic study of The Critique of Pure Reason.", "prerequisites": "PHL210Y5 and 1.5 additional credits in PHL"}, {"name": "PHL315H5 • Topics in Nineteenth Century Philosophy", "description": "A study of some topic or thinker in the 19th century.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL324H5 • The Continental Tradition", "description": "A study of recent traditions of continental philosophy such as phenomenology, existentialism, hermeneutics, critical theory, structuralism and post-structuralism. Figures such as Husserl, Heidegger, Sartre, the Frankfurt school, Lacan, Foucault, Deleuze and Derrida.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL325H5 • Early Analytic Philosophy", "description": "An examination of some of the classic texts of early analytic philosophy, concentrating on the work of Frege, Russell and Wittgenstein. Central topics to be covered include: the development of logic and its relation to arithmetic; the nature of language and meaning; truth and objectivity; the distinction between sense and reference; logical analysis; the relation between language and thought; and the bounds of intelligibility.", "prerequisites": "PHL245H5 and 1.5 additional credits in PHL"}, {"name": "PHL327H5 • Later Analytic Philosophy", "description": "An examination of the later analytic tradition from logical positivism to Kripke. The course will cover some of the following topics: meaning and verifiability; the relation between science and philosophy; ordinary language and philosophy; the nature and status of the analytic-synthetic distinction; meaning and theories of meaning; theories of truth; the nature of necessity; and reference and identity.", "prerequisites": "PHL 245H5 and 1.5 additional credits in PHL"}, {"name": "PHL332H5 • Metaphysics", "description": "Typical topics: ontological categories; ontological commitment; the objectivity of space and time: causality and determinism; mind and body.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL333H5 • Epistemology", "description": "Typical topics: knowledge and belief, perception, the analytic-synthetic distinction, theories of truth, necessity and the a priori.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL340H5 • Philosophy of Mind", "description": "Typical topics: the brain-mind identity theory; consciousness intentionality and the mental; personal identity; the nature of human action.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL341H5 • Practical Reason and Human Action", "description": "(Formerly: Freedom, Responsibility, and Human Action) The course will cover various topics in action theory and the nature of practical reason, such as the nature of intentional action and intentional explanations, the relation between morality and practical reason, the distinction between theoretical and practical reasoning, and the relation between motivation and evaluation.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL343H5 • Freedom and Determinism", "description": "This course will examine the question of whether determinism is true, and to which extent and whether, determinism is compatible with the possibility that our will is free as well as the relation between freedom and responsibility. In particular, we will look at the plausibility of views such as compatibilism, hard determinism and libertarianism.", "prerequisites": "1.5 credits in PHL."}, {"name": "PHL345H5 • Intermediate Logic", "description": "A continuation of PHL245, requiring no other prior knowledge of philosophy or mathematics. Symbolization, natural deduction, and models in polyadic predicate logic with operations and identity. Symbolization, natural deduction, and models for theories of descriptions. Introduction to metatheory, such as soundness and completeness.", "prerequisites": "PHL245H5 and 1.0 credits on PHL"}, {"name": "PHL346H5 • Choice and Chance", "description": "An intermediate level look at reasoning and decision making in the face of uncertainty. Topics may include: decision theory, game theory, social choice theory, confirmation theory, foundations of probability and statistics, puzzles of infinity and self-location, and the relationship between knowledge and uncertainty.", "prerequisites": "1.5 PHL credits"}, {"name": "PHL347H5 • Modality in Logic and Philosophy", "description": "Study of the concepts of necessity and possibility using extensions of classical logic: modal sentential logic, modal quantification logic, possible-world semantics, the metaphysics of modality. Other possible topics include: counterfactuals, epistemic logic, temporal logic, deontic logic, many-valued logic, and supervaluations.", "prerequisites": "PHL245H5 and 1.0 credit in PHL"}, {"name": "PHL350H5 • Philosophy of Language", "description": "Topics may include: Different approaches to the study of language; the analysis of central theoretical notions in the descriptions of language; the relation between thought and language; the relation between philosophy of language and metaphysics.", "prerequisites": "PHL245H5 and 1.5 additional credits in PHL"}, {"name": "PHL354H5 • Philosophy of Mathematics", "description": "Platonism versus nominalism, the relation between logic and mathematics, implications of Godel's and Church's theorems, formalism and intuitionism.", "prerequisites": "PHL103H5 and PHL245H5 and (0.5 credit in PHL or CSC or MAT)"}, {"name": "PHL355H5 • Issues in Philosophy of Science", "description": "Central problems and contemporary issues. Topics may include: scientific inference and method; explanation; under-determination; the pessimistic induction; constructive empiricism; entity realism; structural realism; laws of nature.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL357H5 • Philosophy of Biology", "description": "Conceptual issues in modern biology. Topics may include natural selection, biological kinds, the role of evolution in explaining human attributes such as rationality, cooperation, and communication, reductionism in molecular biology, and functional explanation in biology.", "prerequisites": "PHL255H5 or PHL355H5 and 1.5 PHL credits"}, {"name": "PHL358H5 • Philosophical Issues in Cognitive Science", "description": "An examination of philosophical issues that arise in cognitive science, such as: the nature of consciousness, alternative models of computation in theories of cognition, the nature and function of perception and the emotions, the evolution of mind and language, and the relation among various fields of cognitive science such as psychology, linguistics, and neuroscience.", "prerequisites": "(PHL340H5 or PHL345H5 or PHL350H5) and 1.5 additional credits in PHL"}, {"name": "PHL360H5 • Philosophy of Artificial Intelligence", "description": "This course examines contemporary artificial intelligence from a philosophical perspective. Topics include: the nature of intelligence, comparisons between biological and artificial learning, linguistic understanding and grounding in foundation models, moral guidance for AI systems, and the moral status of artificial agents.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL365H5 • Issues in Political Philosophy", "description": "A study of work by political philosophers, typically both historical and contemporary, on topics such as justice, rights, welfare, and political authority.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL366H5 • The Ethics of Borders and Immigration", "description": "In this class we will consider the moral standards that govern states rights (if any) to enforce restrictions on immigration, residency, and citizenship and peoples rights (if any) to immigrate and emigrate. Questions to be considered include: Do people have a right to move wherever they want? Do the citizens of a state have a right to choose who will be their co-nationals? Do they have a right to prefer people of particular religious, cultural, ethnic, or political persuasions? Do people have a right to leave the country in which they are born? Do countries have special obligations to refugees who are the victims of human rights violations? Are economic migrants due the same rights? Is it morally permissible to grant lesser rights to would-be migrants than native born citizens? Is it acceptable to sell the right to citizenship or permanent residency?", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL367H5 • Issues in Philosophy and Feminism", "description": "This course will examine selected philosophical topics in feminism, such as multiculturalism and women's rights, feminist epistemologies, ethics of care, the intersection between sexism and other forms of oppression, pornography.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL370H5 • Issues in Philosophy of Law", "description": "A study of major issues in the philosophy of law such as the nature of law, responsibility and punishment, the obligation to obey the law, and the moral underpinnings of particular areas of law (e.g. criminal, tort, contract).", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL374H5 • Issues in Normative Ethics", "description": "Normative Ethics concerns general questions about what makes actions right or wrong. Topics include, among others, the plausibility of various ethical theories such as consequentialism, deontology, and virtue ethics, and questions about the moral significance of distinctions such as doing vs allowing and intending vs foreseeing.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL376H5 • Issues in Metaethics", "description": "Metaethics concerns the place of values in the world, and the status of ethics as a field of inquiry. Topics may include: the objectivity of morality; moral psychology; the possibility of ethical knowledge; and meanings of ethical concepts.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL390H5 • Special Topics in Philosophy", "description": "A course primarily for Specialists and Majors in Philosophy. Topic to vary from year to year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "1.5 credits in PHL"}, {"name": "PHL400H5 • Seminar in Ancient and Medieval Philosophy", "description": "Advanced discussion of principal figures and themes in ancient or medieval philosophy.", "prerequisites": "(PHL200H5 and 3.0 credits of PHL) or by permission of the Instructor or Department."}, {"name": "PHL410H5 • Seminar in 17th and 18th Century Philosophy", "description": "Advanced discussion of philosophers and themes in the 17th and 18th century.", "prerequisites": "(PHL210Y5 and 2.5 credits of PHL) or by permission of the Instructor or Department."}, {"name": "PHL420H5 • Seminar in 19th and 20th Century Philosophy", "description": "Advanced discussion of principal figures and themes in 19th and 20th century philosophy.", "prerequisites": "3.5 credits of PHL or by permission of the Instructor or Department."}, {"name": "PHL432H5 • Seminar in Metaphysics", "description": "Advanced topics in metaphysics.", "prerequisites": "3.5 credits of PHL or by permission of the Instructor or Department."}, {"name": "PHL433H5 • Seminar in Epistemology", "description": "Advanced topics in epistemology.", "prerequisites": "3.5 credits of PHL or by permission of the Instructor or Department."}, {"name": "PHL440H5 • Seminar in the Philosophy of Mind", "description": "Advanced topics in Philosophy of Mind.", "prerequisites": "3.5 credits of PHL or by permission of the Instructor or Department."}, {"name": "PHL445H5 • Metalogic", "description": "A continuation ofPHL345H5, this is a course in the mathematical study of logic, also known as meta-logic. We will investigate and prove theorems about logical systems. Topics covered will include: basic set theory and recursion theory, completeness, compactness, and the Loewenheim-Skolem theorems for first-order logic, and Gödel's incompleteness theorems.", "prerequisites": "(PHL345H5 or MAT309H5) and 1.0 credit in PHL"}, {"name": "PHL447H5 • Seminar in Philosophy of Logic", "description": "Study of advanced topics in logic or the philosophy of logic.", "prerequisites": "(PHL345H5 and 3.0 credits of PHL) or by permission of the Instructor or Department."}, {"name": "PHL450H5 • Seminar in Philosophy of Language", "description": "Study of advanced topics in philosophy of language.", "prerequisites": "(PHL245H5 and 3.0 credits of PHL) or by permission of the Instructor or Department."}, {"name": "PHL455H5 • Seminar in Philosophy of Science", "description": "Study of advanced topics in the philosophy of science.", "prerequisites": "[(PHL355H5 or PHL357H5) and 3.0 credits of PHL] or by permission of the Instructor or Department."}, {"name": "PHL475H5 • Seminar in Moral and Political Philosophy", "description": "Advanced topics in moral, social, or political philosophy.", "prerequisites": "3.5 credits of PHL or by permission of the Instructor or Department."}, {"name": "PHL489Y5 • The Socrates Project", "description": "The Socrates Project (PHL489Y) is a full-year course with 3 components. First, you will serve as a TA for a section of PHL103H/PHL113H during the Fall and Winter terms. During the Fall semester, you will attend two 1-hour PHL103H/PHL113H lectures each week, and teach one tutorial of 20-25 students, meeting with them for 1 hour each week. You will grade their papers, hold office hours, and meet with the relevant professor as needed. You will be paid for approximately 100 hours of work each semester, for a total of 200 hours, at the current hourly wage for CUPE Unit 1. The second component of the course is a seminar that meets once per week for 3 hours each time, during the fall term. Most of the seminar will be devoted to more in-depth study of the topics taken up in the PHL103H/PHL113H; but you will also discuss the methods and challenges of teaching philosophy-grading papers, prompting and guiding discussion, and so forth. Third, during the winter term you will write a seminar paper, on a topic of your choosing, under the supervision of a UTM Philosophy faculty member working in the relevant area. You will also present your work orally at an undergraduate research conference held jointly with the Socrates students from the St. George campus. Admittance to the Socrates Project is by application only. Instructions and the application form are available on the web at:http://philosophy.utoronto.ca/employment/cupe-3902-unit-1", "prerequisites": "3.5 credits of PHL or by permission of the Instructor or Department."}, {"name": "PHL495H5 • Special Seminar:  Philosophical Problems", "description": "A seminar for advanced students in Specialist and Major Programs in Philosophy. Topic to vary from year to year.", "prerequisites": "3.5 credits of PHL or by permission of the Instructor or Department."}, {"name": "PHL496H5 • Individual Studies", "description": "Contact Undergraduate Advisor. Individual study courses are aimed at highly motivated students. They are not intended to duplicate course offerings already available. A student seeking to do an independent course must secure a faculty supervisor. Regular meetings between student and supervisor are required, and the workload should be the same as a fourth-year philosophy seminar.", "prerequisites": "Permission of Instructor"}, {"name": "PHL497H5 • Individual Studies", "description": "Contact Undergraduate Advisor. Individual study courses are aimed at highly motivated students. They are not intended to duplicate course offerings already available. A student seeking to do an independent course must secure a faculty supervisor. Regular meetings between student and supervisor are required, and the workload should be the same as a fourth-year philosophy seminar.", "prerequisites": "Permission of Instructor"}, {"name": "PHL498H5 • Individual Studies", "description": "Contact Undergraduate Advisor. Individual study courses are aimed at highly motivated students. They are not intended to duplicate course offerings already available. A student seeking to do an independent course must secure a faculty supervisor. Regular meetings between student and supervisor are required, and the workload should be the same as a fourth-year philosophy seminar.", "prerequisites": "Permission of Instructor"}, {"name": "PHL499Y5 • Individual Studies", "description": "Contact Undergraduate Advisor. Individual study courses are aimed at highly motivated students. They are not intended to duplicate course offerings already available. A student seeking to do an independent course must secure a faculty supervisor. Regular meetings between student and supervisor are required, and the workload should be the same as a fourth-year philosophy seminar.", "prerequisites": "Permission of Instructor"}]