[{"name": "ARA212Y5 • Introductory Arabic", "description": "This introductory course is designed for beginners, i.e., students with NO prior knowledge of the Arabic language. The course provides a basic proficiency in Modern Standard Arabic. The students will have ample practice of reading and writing the Arabic alphabet and will master the Arabic sounds and their phono-syntactic features. A foundation of grammar will familiarize the students with word formation, word order, and sentence structures. By the end of the course, the students should be able to fully read Arabic, comprehend simple reading, produce complete sentences to express basic information orally and in writing, and to conduct basic conversations in Modern Standard Arabic.All students are REQUIRED to complete the Arabic Language Assessment Questionnaire before enrolling in this course.Please visithttps://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnairesand complete the Arabic Language Assessment Questionnaire by no later than August 29th. Late assessment submissions will not be accepted.", "prerequisites": "All students who are enrolling in an ARA language course for the FIRST time are required to complete a language assessment questionnaire. Please visit https://www.utm.utoronto.ca/language-studies/language-course-assessment…"}, {"name": "ARA300Y5 • Intermediate Arabic for Heritage Learners", "description": "This is an Arabic language course for heritage students, i.e. of Arab origins, who may have had passive exposure to Arabic but have never formally studied the reading and writing of Arabic. This course is also designed to help students with interest in Islamic studies who may have been exposed to elementary Qur’anic teaching but were never taught the alphabet, and who cannot communicate in spoken or written Arabic. In this course, students will begin by learning how to sound, read and write the Arabic alphabet. They will study Arabic grammar, develop reading comprehension, and practice writing skills that advance gradually throughout the course. Each unit of the course is fully supported by a range of comprehension, vocabulary-building, grammar reinforcement activities, and reading & writing exercises. Language analysis will be based on the reading of excerpts of authentic Arabic texts from contemporary literature, magazines and newspapers. By the end of this course, students will have completed the prerequisites to take Arabic reading, literature, and advanced language courses. Please visithttps://www.utm.utoronto.ca/language-studies/language-course-assessment…and complete the Arabic Language Assessment Questionnaire by no later than August 29th. Late assessment submissions will not be accepted.", "prerequisites": "As determined by assessment questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}, {"name": "ARA305Y5 • Introductory Egyptian Colloquial Arabic", "description": "This is an introductory course designed for high beginner level students, who desire to acquire fluency in spoken Egyptian Arabic, commonly known as Egyptian or Cairene Arabic. The course follows a teaching approach that places emphasis on the development of the listening and speaking skills of spoken Egyptian Arabic. This course develops communicative skills in Egyptian colloquial Arabic along parallel tracks of vocabulary and grammar. Therefore, student must be independently comfortable with the Arabic alphabet and must have developed elementary reading ability. The course is designed for students who have completed the beginner level of modern Standard ArabicARA212Y5Y, and are now ready to branch out into their first experience of a major spoken dialect.", "prerequisites": "ARA212Y5"}, {"name": "ARA312Y5 • Intermediate Arabic", "description": "This course is for students who have basic background information in formal Arabic. To study this course, students should be able to write and speak simple sentences to express basic information in formal Arabic. The course builds on the skills that students have learned inARA212Y5. By the end of this course, students should be able to use formal Arabic at an intermediate low level using ACTFL guidelines. Everyday language in the Egyptian and Levantine accents will be provided occasionally as supplementary materials for students' information only. However, students' skills will be assessed using formal Arabic only, which is the focus of this course.", "prerequisites": "ARA212Y5"}, {"name": "ARA400Y5 • Advanced Arabic for Heritage Learners", "description": "This course develops the student's communication skills in grammar, writing, reading, and formal registers of speaking, into an advanced level. It caters to the students who have completed the intermediate high level: ARA300, or whose language assessment reflects an intermediate level of proficiency of Arabic as a heritage language. The teaching of this course will also focus on error analysis to develop the student’s ability to distinguish between their version of heritage spoken language and that of the erudite Arabic, الفُصْحى, as used formally across the Arab world. By the end of the course, the student will be able to write in a formal academic register, sustain oral expressions and deliver oral presentations in formal Arabic.", "prerequisites": "ARA300Y5 or appropriate language level as indicated by the Arabic Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnaires)."}, {"name": "ARA408H5 • Arabs in Western Literature and Arts: Reception and Interpretation", "description": "(Offered in English).This survey course examines representative fiction and non-fiction texts, painting, films, operas, comics and video games to explore salient incidences of encounter, impact, and reception of the Arabs in medieval and modern Western thought. Examples of topics of analysis are Islamic imagery in Dante’s Inferno, motifs of storytelling and narrative structures from the One Thousand and One night in Boccaccio’s Decameron and Chaucer’s Canterbury Tales…From the Moors in Spain, to the Arabs in Sicily, from Shakespeare’s Othello to the Victorian Gothic Vathek, the course will move on to explore the extension of the French Orientalists’ influence beyond European painting to operas, and later in cinema, exploring works such as Il Seraglio, Lawrence Arabia, Casablanca and others. Current representations of the Arabs in Western films, TV shows, comics, and video games will be analyzed to trace continuity and discontinuity of the earlier reception. Students who take this course to be counted towards the Language Citation must complete written course work in Arabic.", "prerequisites": "Open to all students who have completed 9.0 credits."}, {"name": "ARA410H5 • Advanced Arabic Reading I: Reading the Sacred and the Legendary", "description": "This is the first of two intensive advanced reading courses in the Arabic language. Throughout this course, the students will also be familiar with different sacred texts such as Tafsīr (Quranic exegesis) and Qiṣas al-Anbiyā’ (Tales of the Prophets) to the fables focused on the description of amazing and mythological creatures such as Qazvīni’s ‘Ajā’ib al-Makhlūqāt wa Gharā’ib alMawjūdāt (Marvels of Creatures and Strange things existing) and Kalīla wa Dimna as well as the epic of the legendary Arabic heroin Dhāt al-Himma in Sīrat Dhāt al-Himma.", "prerequisites": {"and": [], "or": ["ARA311H5", "ARA312Y5"]}}, {"name": "ARA411H5 • Advanced Arabic Reading II: Literary Journeys into the Past", "description": "This is the second of two intensive advanced reading courses in the Arabic language. This course will concentrate on works relating to history which includes universal histories in the world from creation up to their own eras; biographies of individuals and biographical dictionaries, advice literature that guide rulers to govern efficiently; poetry by poets and poetesses; maqãmãt or works of rhymed prose; mystical texts; travelogues that describe the adventures and observations of travelers to faraway lands; annalistic chronicles that record events from year to year; and chancery documents that shed light on the way medieval administrations worked.", "prerequisites": {"and": [], "or": ["ARA311H5", "ARA312Y5"]}}, {"name": "ARA412Y5 • Advanced Arabic", "description": "This course uses differentiated instruction and assessment methods to provide Arabic language instruction to two groups of students: 1) advanced learners of Arabic as a foreign language, and 2) heritage students who may have native or native-like proficiency in the Arabic language. Both groups of learners will have customized study materials and assessment schemes that provide for their specific learning needs and language abilities.", "prerequisites": "(ARA312Y5 or ARA311H5). Students who have not completed ARA312Y5 or ARA311H5 must obtain permission from the department before enrolling."}]