[{"name": "AST221H5 • Astrophysics I – Planets, Sun and Stars", "description": "This course explores the astrophysics of planets, Sun and stars, including their observed variety, structure, formation and evolution.", "prerequisites": {"and": [], "or": [{"and": ["MAT135H5", "MAT136H5"], "or": []}, {"and": ["MAT137H5", "MAT139H5"], "or": []}, {"and": ["MAT157H5", "MAT159H5"], "or": []}, "MAT137Y5", "MAT157Y5"]}}, {"name": "AST222H5 • Astrophysics II – Stellar Systems, Galaxies and the Universe", "description": "This course explores the astrophysics of the Milky Way, other galaxies, and the Universe.", "prerequisites": "AST221H5"}, {"name": "AST252H5 • Life in the Universe", "description": "This course addresses the question of life beyond Earth. Starting with our current understanding of how life began and evolved on Earth, the course explores possibility that life might have developed elsewhere in the Universe. It summarizes the evidence that the conditions necessary for life might exist today or existed in the past on other planets in our solar system. This search for evidence of life is then extended to the thousands of planets that have been discovered orbiting other stars.", "prerequisites": "AST221H5"}, {"name": "AST299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity forstudents in their second year to work in the research projectof a professor in return for 299Y course credit. Studentsenrolled have an opportunity to become involved in originalresearch, learn research methods and share in theexcitement and discovery of acquiring new knowledge.Participating faculty members post their project descriptionsfor the following summer and fall/winter sessions in earlyFebruary and students are invited to apply in early March.SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "AST221H5"}, {"name": "AST320H5 • Astrophysics III – Unsolved Problems in Astrophysics", "description": "This course explores the formation, equilibrium, and evolution of structure on various astronomical scales through the investigation of major open questions in modern astrophysics. Topics may include exoplanet formation and evolution, supermassive black holes, the progenitors of type Ia supernovae, galaxy evolution, and the nature of dark matter.", "prerequisites": "AST222H5"}, {"name": "AST325H5 • Observational Astronomy", "description": "This course will guide students to develop the core skills to collect, reduce, and interpret astronomical data. Through a series of projects and observing labs, students will develop their skillset for the usage of telescopes, instruments, and detectors; reduction and statistical analysis methods; simulations and model fitting; and data and error analysis.", "prerequisites": {"and": ["AST221H5", "AST222H5"], "or": []}}, {"name": "AST399Y5 • Research Opportunity Program", "description": "This course provides third-year undergraduate students (after completing at least 9.0 credits) who have developed some knowledge of astronomical research with an opportunity to assist in a research project of a professor in return for course credit. Students enrolled in this course have the opportunity to enhance their research skills and share in the excitement of acquiring new knowledge and in the discovery process of science. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February, and students are invited to apply in early March.SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "AST221H5 and AST222H5"}, {"name": "CPS489Y5 • Introduction to Research in the Chemical and Physical Sciences", "description": "Students will work toward the completion of an experimental or theoretical research project in an area of study within the chemical and physical sciences, namely, astronomy, chemistry, earth sciences or physics. Projects will be based on current trends in research and students will work to complete their projects with guidance provided by a team of facilitators and faculty advisors consisting of course coordinators and a researcher from the Department of Chemical and Physical Sciences. In addition to the rigorous development of research skills, the course will also provide students with training and practical experience in project management techniques and practical research, literary and communications skills development.CPS489Y5requires submitting an application to the department Application forms may be found athttp://uoft.me/cpsforms. Applications should be submitted to the CPS Undergraduate Assistant.", "prerequisites": "(2.0 credits at the 300 level from BIO or CHM or JBC or JCP or ERS or ESS or PHY) and (1.0 credit from BIO206H5 or BIO314H5 or CHM372H5 or CHM373H5 or CHM394H5 or CHM395H5 or CHM396H5 or CHM397H5 or ERS201H5 or ERS202H5 or PHY324H5 or PHY347H5 or JCP321H5 or JCP322H5 or PHY325H5 or PHY332H5 or PHY333H5 or PHY343H5 or PHY351H5)"}, {"name": "JCB487Y5 • Advanced Interdisciplinary Research Laboratory", "description": "Students will work together as members of a multidisciplinary team toward the completion of an interdisciplinary experimental or theoretical research project. Teams will be comprised of at least three students, with representation from at least three areas of specialization, namely, astronomy, biology, chemistry, earth sciences or physics. The interdisciplinary projects will be based on current trends in research and student teams will work to complete their projects with guidance provided by a team of faculty advisors from the Biology Department and the Department of Chemical and Physical Sciences. In addition to the rigorous development of research skills, the course will also provide students with training and practical experience in project management techniques and teamwork skills development.JCB487Y5requires submitting an application to the department before the end of June for Fall enrolment. Application forms may be found athttp://uoft.me/cpsforms. Application should be submitted to the CPS Undergraduate Assistant. Registration on ACORN is also required.", "prerequisites": "(2.0 credits at the 300 level from BIO or CHM or JBC or JCP or ERS or ESS(G) or PHY) and (1.0 credit from BIO206H5 or BIO314H5 or CHM372H5 or CHM373H5 or CHM394H5 or CHM395H5 or CHM396H5 or CHM397H5 or ERS201H5 or ERS202H5 or PHY324H5 or PHY347H5). Normally taken in 4th year. Students must obtain approval from the faculty member(s) who will serve as the supervisor(s) in advance of the start of the course."}]