[{"name": "CLA299Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early February. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of at least 4.0 and not more than 9.0 credits."}, {"name": "CLA300H5 • Greek Tragedy and Comedy", "description": "Greek drama from the origins of tragedy in the sixth century B.C. to New Comedy, with close study of selected plays of Aeschylus, Sophocles, Euripides, Aristophanes, and Menander, and attention to Aristotle's Poetics.", "prerequisites": "Completion of at least 4.0 and not more than 9.0 credits."}, {"name": "CLA301H5 • Greek Epic", "description": "The Iliad and the Odyssey, with comparative study of related texts.", "prerequisites": {"and": [], "or": ["CLA204H5", "CLA230H5", "CLA237H5"]}}, {"name": "CLA302H5 • Roman Epic", "description": "The Aeneid of Virgil and/or other Roman epics with comparative study of related texts.", "prerequisites": {"and": [], "or": ["CLA204H5", "CLA231H5", "CLA233H5"]}}, {"name": "CLA303H5 • The Ancient Novel", "description": "The human and social climate in which prose fiction arose; the Greek romances of love and adventure (Heliodorus, Longus, Chariton), and the more ironical and socially conscious works of the Roman writers (Petronius, The Satyricon, and Apuleius, The Golden Ass).", "prerequisites": {"and": [], "or": ["CLA204H5", "CLA230H5", "CLA231H5", "CLA233H5", "CLA237H5"]}}, {"name": "CLA307H5 • Greek and Roman Lyric Poetry", "description": "This course discusses Greek and Roman lyric poetry in its wider literary, cultural and political contexts. Poets who will be discussed include, among others, Sappho, Theocritus, Catullus and Horace. Some of the poems featured in this course belong to the best and most beautiful literature written in Graeco-Roman antiquity.", "prerequisites": "CLA207H5"}, {"name": "CLA308H5 • Religion in the Ancient Greek World", "description": "A study of the religious cults and forms of worship current in the ancient Greek world. The course will consider religion in the ancient Greek city-states, but attention will also be paid to the so-called 'mystery religions', Greek beliefs about the afterlife, and intellectual reflection on religion in Greek literature.", "prerequisites": "Prerequisite for CLA students: (CLA204H5 or CLA230H5 or CLA237H5) and for RLG students: any pertinent RLG course at the 200+ level."}, {"name": "CLA310H5 • Religion in the Roman Empire", "description": "A close study of the religious cults and forms of worship current in the Roman Empire during the first four centuries C.E. The course will concentrate on the so-called 'pagan' cults, but their interaction with Jews and the early Christians, as well as the rise of Christianity, will also be considered. Attention will also be paid to the imperial cult (\"emperor worship\"); the so-called 'mystery religions' and 'oriental religions'; the diversity of local religion across the empire; oracles, private religiosity and intellectual reflection on religion in the ancient Greek and Roman writers.", "prerequisites": "Prerequisite for CLA students: (CLA231H5 or CLA233H5) and for RLG students: any pertinent RLG course at the 200+ level."}, {"name": "CLA319H5 • Women and Gender in Antiquity", "description": "A study of gender in the ancient Mediterranean, with a focus on female and male sexuality and socialization; their economic, religious, and political roles; and aspects of daily life.", "prerequisites": {"and": [], "or": ["CLA204H5", "CLA230H5", "CLA231H5", "CLA233H5", "CLA237H5"]}}, {"name": "CLA320H5 • The Etruscans", "description": "A close study of the history, culture, society, religion, art and archaeology of the Etruscans (1000–100 BCE) and of their contacts with Greek and Roman society and culture.", "prerequisites": {"and": [], "or": ["CLA230H5", "CLA231H5", "CLA233H5", "CLA237H5"]}}, {"name": "CLA337H5 • Pompeii and Herculaneum: Everyday Life and Death in Roman Cities", "description": "Focusing on Roman Pompeii and Herculaneum, this course studies the experiences of townspeople: the freeborn (male and female), freed persons, and slaves; the demography of a Roman town and its public infrastructure; the interior design of Roman houses; local politics; leisure activities; economy; and religious beliefs and funerary practices.", "prerequisites": {"and": [], "or": ["CLA231H5", "CLA233H5"]}}, {"name": "CLA350H5 • The Trojan War: Archaeology and Myth", "description": "This course studies the unique place Troy and the Trojan War hold in Greek and Roman literary and historical imagination, archaeology, mythology, and art. The course also considers the afterlife of the Trojan War in post-Classical European culture, and its reception in modern film and fiction.", "prerequisites": {"and": [], "or": ["CLA220H5", "CLA230H5", "CLA237H5"]}}, {"name": "CLA355H5 • Greek Sanctuaries: Archaeology and Ritual", "description": "This course explores the development and function of Greek sanctuaries, paying special attention to the archaeological evidence and the roles of sanctuaries in society. It studies major sanctuaries and their festivals and rituals (Delphi, Olympia, Athenian Acropolis, Eleusis, Samos, Ephesos), but also considers smaller sites in the Greek world.", "prerequisites": {"and": [], "or": ["CLA204H5", "CLA220H5", "CLA230H5", "CLA237H5"]}}, {"name": "CLA359H5 • The Persian Empire: 559-331 BCE", "description": "This course offers an examination of the history and culture of the first multicultural superstate of the ancient world, the Achaemenid Empire. Through a close analysis of ancient sources, this course not only investigates governmental structures but also the daily life in the Eastern Mediterranean from the sixth to the fourth centuries BCE.", "prerequisites": {"and": [], "or": ["CLA230H5", "CLA231H5", "CLA233H5", "CLA237H5"]}}, {"name": "CLA360H5 • Early Greece", "description": "This course offers an exploration into the early Greek world, tracing political, economical, and social developments from a world of local rulers in the second millennium BCE until the Persian Wars in the early fifth century BCE. An in-depth study of the many forms of available ancient sources will create a vivid picture of early Greek communities, of state organization, and society.", "prerequisites": {"and": [], "or": ["CLA230H5", "CLA237H5"]}}, {"name": "CLA361H5 • Classical Greece", "description": "A close study of the Greek Mediterranean world during the period, which already in antiquity, was described as 'Classical'. Through an in-depth study of ancient sources, this course explores the political, economic, social, religious and cultural developments of the Greek states in the time period from the Persian Wars in the early 5th century to the rise of Macedon in the second half of the fourth century BCE.", "prerequisites": {"and": [], "or": ["CLA230H5", "CLA237H5"]}}, {"name": "CLA362H5 • Alexander the Great and the Hellenistic World", "description": "This course offers an in-depth study of the Hellenistic World from the reign of Alexander the Great in the fourth century BCE to a Greek world under Roman dominance in the first century CE, spanning geographically from the Mediterranean basin via the Levant and Mesopotamia to modern-day Afghanistan. A close examination of different types of ancient sources will trace the political, cultural, economic and social developments of kings, regions and cities that shaped this period.", "prerequisites": {"and": [], "or": ["CLA230H5", "CLA237H5"]}}, {"name": "CLA365H5 • Trade in the Ancient Mediterranean", "description": "This course explores questions of trade and exchange in the ancient Mediterranean. A close study of ancient primary material examines aspects of the ancient economy, trade goods, ships and shipwrecks, ports and harbours, and cross-cultural interaction.", "prerequisites": {"and": [], "or": ["CLA230H5", "CLA231H5", "CLA233H5", "CLA237H5"]}}, {"name": "CLA367H5 • The Roman Republic", "description": "A survey of the salient political, constitutional, social, economic, military, religious, and cultural developments in the Roman Republic, from the late sixth century to the final decades of the first century BC.", "prerequisites": {"and": [], "or": ["CLA231H5", "CLA233H5"]}}, {"name": "CLA368H5 • Augustus and the Julio-Claudians", "description": "A survey of the salient political, constitutional, social, economic, military, religious and cultural developments in the Roman Empire in the age of Augustus and during the reigns of the Julio-Claudian emperors (ca. 44 BCE- 68CE).", "prerequisites": {"and": [], "or": ["CLA231H5", "CLA233H5"]}}, {"name": "CLA369H5 • The High Roman Empire, 68-305 CE", "description": "A survey of the salient political, constitutional, social, economic, military, religious and cultural developments in the Roman Empire, from the 'year of the four emperors' (68 CE) to the fourth century CE.", "prerequisites": {"and": [], "or": ["CLA231H5", "CLA233H5"]}}, {"name": "CLA370H5 • Late Antiquity", "description": "A survey of the salient political, constitutional, social, economic, military, religious and cultural developments in the Roman Empire from the fourth century to the age of Justinian.", "prerequisites": {"and": [], "or": ["CLA231H5", "CLA233H5"]}}, {"name": "CLA390H5 • Topics in Greek History & Culture", "description": "A detailed study of a topic of Greek history, literature, or material culture. Topics will vary from year to year. See Department of Historical Studies web site athttps://www.utm.utoronto.ca/historical-studies/students/courses/topic-c…for more details.", "prerequisites": {"and": [], "or": ["CLA230H5", "CLA237H5"]}}, {"name": "CLA391H5 • Topics in Roman History & Culture", "description": "A detailed study of a topic of Roman history, literature, or material culture. Topics will vary from year to year. See Department of Historical Studies web site athttps://www.utm.utoronto.ca/historical-studies/students/courses/topic-c…for more details.", "prerequisites": {"and": [], "or": ["CLA231H5", "CLA233H5"]}}, {"name": "CLA395H5 • Topics in Classics", "description": "An in-depth examination of historical issues. Content in any given year depends on instructor. See Department of Historical Studies web site athttps://www.utm.utoronto.ca/historical-studies/students/courses/topic-c…for more details.", "prerequisites": "At least 0.5 200 level credits in Classical Civilization."}, {"name": "CLA396H5 • The Ancient Mediterranean in Context", "description": "An in-depth examination of the historical issues and their relationships with specific regions in the ancient world and their monuments. Content in any given year depends on instructor. As part of this course, students will have the option of participating in an international learning experience that will have an additional cost and application process. See the Department of Historical Studies website athttps://www.utm.utoronto.ca/historical-studies/undergraduate-programs/classical-civilization/classical-civilization-topic-coursesfor more details.", "prerequisites": {"and": [], "or": ["CLA230H5", "CLA231H5", "CLA233H5", "CLA237H5"]}}, {"name": "CLA399Y5 • Research Opportunity Program", "description": "For senior undergraduate students who have developed some knowledge of a discipline and its research methods, this course offers an opportunity to work on the research project of a professor. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. Project descriptions for the following fall-winter session are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of at least 8.0, and not more than 10.0, credits."}, {"name": "CLA404H5 • Advanced Topics in Classics", "description": "A critical exploration of selected topics of Greek or Roman history, literature, philosophy, or material culture. Topics will vary from year to year.", "prerequisites": "At least 2.5 credits in Classics, including at least 1.5 credits at the 300 level."}, {"name": "CLA497Y5 • Independent Reading", "description": "Student-initiated project of reading and research, supervised by a member of the Department. Primarily intended for students in a Major program. After obtaining a supervisor, a student must apply to the Department of Historical Studies. A maximum of 1.0 credit in a reading course is permitted.", "prerequisites": "At least 2.5 credits in Classics, including at least 1.5 credits at the 300 level."}, {"name": "CLA499H5 • Independent Reading", "description": "Student-initiated project of reading and research, supervised by a member of the Department. Primarily intended for Majors. After obtaining a supervisor, a student must apply to the Department of Historical Studies. A maximum of two reading courses, amounting to 1.0 credit, is permitted.", "prerequisites": "At least 2.5 credits in Classics, including at least 1.5 credits at the 300 level."}, {"name": "CLA499Y5 • Research Opportunity Program", "description": "For senior undergraduate students who have developed some knowledge of a discipline and its research methods, this course offers an opportunity to work on the research project of a professor. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. Project descriptions for the following fall-winter session are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of at least 8.0, and not more than 10.0 credits."}, {"name": "GRK101H5 • Introductory Ancient Greek I", "description": "An introduction to Ancient Greek for students who have no knowledge of the language. This course also serves as a preparation for Intermediate Greek courses.", "prerequisites": "Completion of at least 8.0, and not more than 10.0 credits."}, {"name": "GRK102H5 • Introductory Ancient Greek II", "description": "An introduction to Ancient Greek for students who have no knowledge of the language. This course also serves as a preparation for Intermediate Greek courses.", "prerequisites": {"and": [], "or": ["GRK101H5", "GRK211H5", "GRK101H1"]}}, {"name": "GRK213H5 • Introductory Ancient Greek III", "description": "The final course of the introduction to Ancient Greek for students who have some training in the language. This course also serves as a preparation for Intermediate Greek courses.", "prerequisites": {"and": [], "or": ["GRK102H5", "GRK212H5", "GRK102H1"]}}, {"name": "GRK221H5 • Intermediate Ancient Greek", "description": "Reading of selections of Ancient Greek prose and verse with a systematic study of the Greek Language.", "prerequisites": {"and": [], "or": ["GRK213H5", "GRK201H1"]}}, {"name": "LAT101H5 • Introductory Latin I", "description": "An introduction to Latin for students who have no knowledge of the language. This course also serves as a preparation for Intermediate Language courses.", "prerequisites": "GRK213H5 or GRK201H1"}, {"name": "LAT102H5 • Introductory Latin II", "description": "A continuation of the introduction to Latin for students who have some training in the language, but have not completed a whole credit course at university or a final-year (Grade 12) course in secondary school. This course also serves as a preparation for Intermediate Language courses.", "prerequisites": {"and": [], "or": ["LAT101H5", "LAT211H5", "LAT101H1"]}}, {"name": "LAT213H5 • Introductory Latin III", "description": "The final course of the introduction to Latin for students who have some training in the language. This course also serves as a preparation for Intermediate Latin courses.", "prerequisites": {"and": [], "or": ["LAT102H5", "LAT212H5", "LAT102H1"]}}, {"name": "LAT221H5 • Intermediate Latin", "description": "Reading of selections of Latin prose and verse with a systematic study of the Latin Language.", "prerequisites": "LAT213H5 or LAT201H1 or Grade 12 Latin (with permission of instructor)"}]