[{"name": "ENV201H5 • Environmental Management", "description": "(FormerlyGGR234H5) Environmental management builds on topics discussed in ENV100 and GGR111/112, by focusing on conceptual frameworks and specific tools that can be used to formulate environmental management goals and support decision-making. Case studies will be used throughout to highlight different approaches, focusing primarily on Canadian examples. Topics include ecosystem and adaptive management, environment impact assessments, and the role of stakeholders.", "prerequisites": "GGR111H5 and GGR112H5 (formerly GGR117Y5) or ENV100Y5"}, {"name": "ENV210H5 • Sustainability", "description": "The United Nations Commission on Environment and Development popularized the term sustainable development in its 1987 report, Our Common Future. How far have we come since then, as a global community, in implementing sustainability as a model for development? In this course we will examine the history, measurement, and present-day models and applications of sustainability and sustainable development in both the public and private spheres. Sustainability is an integrative concept that addresses social, cultural, political, and economic factors within the constraints of the biophysical environment.", "prerequisites": "9.0 credits"}, {"name": "ENV299Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work on a research project with a professor in return for course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Based on the nature of the project, projects may satisfy the Sciences or Social Sciences distribution requirement. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "9.0 credits"}, {"name": "ENV305H5 • Sustainable Tourism", "description": "Tourism has long been an important industry around the world, but increasingly questions are being raised regarding the social and environmental sustainability of tourism. This course will look at the impacts (both negative and positive) that tourism has on the natural environment, society, and local economies. It will explore how tourism relates to mobility, globalization, recreation and outdoor activity, planning, the environment, cultural identities, protected areas, and wildlife conservation. This course begins with an introduction to tourism more generally and then focuses in on critical perspectives and the development of eco-tourism, cultural tourism, and volunteer tourism. As part of this course, students may have the option of participating in an international learning experience that will have an additional cost and application process.", "prerequisites": "9.0 credits"}, {"name": "ENV311H5 • Environmental Issues in the Developing World", "description": "The Earth is one, but the world is not. We all depend on one biosphere for sustaining our lives. Yet each community, each country, strives for survival and prosperity with little regard for its impact on others. These are the opening words from the report of the UN World Commission on Environment and Development, which first popularized the concept of sustainable development. In this course we examine 'environment' and 'development' and 'human well-being' as inseparable challenges. We consider global, regional, and local environmental problems from the perspectives of developing nations, and investigate the economic, social, and political roots of these problems.", "prerequisites": "Any 9.0 credits"}, {"name": "ENV320H5 • Managing Our Waste", "description": "Garbage archaeologist William Rathje once said, \"Garbage isn't generic junk. It's elements of our behavior all thrown together.\" The history of human civilization is reflected in what societies have thrown away over the ages. But in recent decades both the quantity and types of waste generated by human activities have changed radically. In this course we will address the philosophical, social, and management challenges associated with waste in Canadian and international contexts, as well as examining some of the technological and scientific aspects of specific waste management problems.", "prerequisites": "9.0 credits including ENV100Y5 or (GGR111H5 and GGR112H5)"}, {"name": "ENV330H5 • Experimental Design in Environmental Science", "description": "This hands-on course introduces students to field methods and integrative problem solving in environmental sciences. Topics will include sampling methods and protocols employed in terrestrial, aquatic and atmospheric assessment and monitoring, as well as experimental design, data analysis and presentation. Practical sessions will involve outdoor field experiences on campus and neighboring areas.", "prerequisites": "9.0 credits, including the completion of a 100-level quantitative and basic scientific credit, and completion of a 200/300-levek quantitative methods course and enrolment in an Environmental Science program."}, {"name": "ENV332H5 • Practicum in Environmental Project Management", "description": "Solutions to environmental issues depend on interdisciplinary teamwork.  This course mimics the practical, multidisciplinary, collaborative work  that is highly valued in the environment sector.  Students work in teams on semester-long projects addressing a specific environmental issue on campus or in the local community (e.g., conducting a waste audit; developing an educational module for a local NGO, etc.).  Specific skills that are developed include; project management and workflow, data collection, report writing and formal presentations.   This course is strongly recommended for Specialist and Major students in any of the Environment Programs.", "prerequisites": "9.0 credits and completion of a Research Methods course (e.g., GGR277H5)."}, {"name": "ENV393H5 • Environmental Assessment", "description": "The course focuses on the methodologies for measuring and predicting the impact of development on the bio-physical and socio-economic environments. Topics include environmental assessment, law and institutions, environmental mediation; Phase I, II, III environmental site assessment; monitoring; mitigation; evaluation; and risk assessment. The types of impact assessment (IA) methods examined vary from year to year (e.g. economic IA, ecological IA, social IA).", "prerequisites": "ENV100Y5"}, {"name": "ENV399Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work on a research project with a professor in return for course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Based on the nature of the project, projects may satisfy the Sciences or Social Sciences distribution requirement. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "ENV100Y5"}, {"name": "ENV425H5 • Managing Urban Ecosystems", "description": "This course examines the ways people interact with and manage urban ecosystems. Socio-ecological systems, green infrastructure, environmental justice, ecosystems services, climate change mitigation and adaptation, and sustainability will be discussed in the context of urban ecosystems. Throughout the course, issues associated with bridging the gaps between the social and natural sciences, unique characteristics of urban ecosystems, and the role of individual decision-makers will be considered.", "prerequisites": "14 credits"}, {"name": "ENV430H5 • Environmental Law and Policy", "description": "This course introduces students to the challenges and opportunities of environmental law and policy. Students will learn how legal systems can address increasingly complex environmental challenges. This course will include an in-depth look at the toolbox of legal and policy instruments that decision makers have at their disposal to tackle major environmental problems. The focus is primarily Canada though international examples will also be touched upon. Case studies and examples will be used to connect theoretical and legal principals to real world situations.", "prerequisites": "14 credits including (GGR111H5 and GGR112H5) or ENV100Y5 or permission of instructor"}, {"name": "ENV435H5 • Governing the Commons: Communities and Conservation", "description": "Common-pool resources (CPRs) include pastures, forests, watersheds, ocean fisheries, traffic, the Internet, and the Earth’s climate. CPRs present a variety of social dilemmas because it is difficult to exclude and prevent resources users from accessing, using, and polluting a resource. Individual self-interest may put CPRs at risk of overuse, overconsumption, and exploitation to result in a “tragedy of the commons” scenario. However resource users across the world, have devised rules and strategies to avoid such tragedies to sustain CPRs over centuries. In this course, through playing games in the classroom, we will learn whether and how theories of collective action, cooperation, and institutions provide insight into achieving conservation of CPRs that delivers on the twin goals of social and environmental justice.", "prerequisites": "14.0 credits including GGR111H5 and GGR112 or ENV100Y5 or permission of instructor"}, {"name": "ENV490H5 • Special Topics in Environmental Studies", "description": "This course highlights various topics of special interest in environmental studies. The specific focus and format of the course will vary, depending on the chosen topic. The course will not be offered every year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable for details.", "prerequisites": "14.0 credits including ENV100Y5"}, {"name": "ENV491H5 • Special Topics in Environmental Studies", "description": "These courses highlight various topics of special interest in environmental studies. The specific focus and format of the courses will vary, depending on the chosen topic. The courses will not be offered every year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable for details.", "prerequisites": "14.0 credits including ENV100Y5 and permission of instructor"}, {"name": "ENV495H5 • Restoration Ecology I", "description": "Restoration ecology is an emerging cross-disciplinary field of study that concerns human activities undertaken to promote the recovery, health, integrity and sustainability of degraded ecosystems. This course introduces the fundamental concepts of ecological restoration, addressing topics such as assessing ecosystem health, resilience, resistance and stability; community structure and biodiversity; invasive species; ecosystem processes and functions; societal aspects of ecological restoration (e.g., the relationship between social, economic and environmental sustainability).", "prerequisites": "14 credits including ENV100Y5 or BIO205H5"}, {"name": "ENV496H5 • Restoration Ecology II", "description": "The follow-up course to Restoration Ecology I,ENV496H5will build on its theoretical foundations to focus on student involvement in a variety of restoration projects planned or underway by Credit Valley Conservation and other groups in Mississauga and the greater Credit Valley watershed. The emphasis here is on planning and implementation of restoration projects; good scientific design; understanding policies and procedures; identifying and working with stakeholders, etc. Occasional field exercises may be scheduled during regular class meeting times.", "prerequisites": "14.0 credits including ENV495H5"}, {"name": "ENV497H5 • Environmental Research Project", "description": "This independent project course is designed to give students experience in the definition and execution of a one-term research study on an environmental topic, under the guidance of a member of the faculty. Students who wish to pursue this option with a specific faculty member or who have an idea for a research project should approach the faculty member early - before the start of the academic term - to negotiate the terms of the project.", "prerequisites": "14.0 credits towards an Environmental Specialist or Major program and permission of instructor"}, {"name": "JEG400Y5 • Geography / Environment Science Internship", "description": "Through a part-time, unpaid work placement, students apply the natural science based environmental science/physical geography expertise gained through previous course work. Placements are made at local conservation authorities, municipalities, environmental consulting companies, corporations, provincial or federal agencies, and other organizations. Students must submit an application online. Instructions for the application can be found on the Geography Department home page:https://utm.utoronto.ca/geography/field-internship-and-thesis-courses", "prerequisites": "15.0-18.0 credits and permission of instructor"}, {"name": "JEG401Y5 • Geography / Environment Social Science Internship", "description": "Through a part-time, unpaid work placement, students apply the knowledge and expertise gained through previous course work in geography. Placements may be made in a range of settings. For example, placements may include municipal government, regional government, neighbourhood organizations and centres, corporations as well as with non-governmental organizations. Admission for this course will be through an online application. Instructions for the application can be found on the Geography Department home page:https://utm.utoronto.ca/geography/field-internship-and-thesis-courses", "prerequisites": "15.0-18.0 credits and permission of instructor"}, {"name": "JEG417Y5 • Honours Thesis", "description": "This course is designed to give students experience in the design and execution of an independent senior thesis under the supervision of a faculty member.In order to register in the course, students must obtain approval from a supervisor, complete an application form and submit the form to the Department of Geography. Please refer to the Department of Geography website for details:https://utm.utoronto.ca/geography/field-internship-and-thesis-courses.This course may fulfill field day components. Please consult with your supervisor.", "prerequisites": "14.0 credits"}, {"name": "JEP351H5 • Comparative Environmental Policy", "description": "This course is an introduction to comparative environmental policy. The focus of the course will be comparing different country’s policies on climate change, biodiversity, water, and pollution. Larger themes related to sustainable development and environmental justice will be covered in detail.", "prerequisites": "9.0 credits including (JP251H5 and JPE252H5) or JPE250Y5"}, {"name": "JEP356H5 • Environmental Justice", "description": "Environmental Justice is about the fair treatment of all people in the creation and implementation of environmental policies. It also provides a critical framework to analyze and understand inequalities of an environmental kind. These inequalities are often based around identities of race, class and gender, such that marginalized groups are made to bear the burden of environmental externalities like pollution. Why are First Nations in Canada less likely to have access to safe drinking water? Why are industrial plants often in low-income neighborhoods? After critical examinations of the theories and foundations of environmental justice, this course uses a case study approach to understanding the concepts and the ways in which it has shaped modern society.", "prerequisites": "9.0 credits"}, {"name": "JEP452H5 • Politics and Policy of Wildlife Conservation", "description": "This course is an in-depth analysis of conservation policy in Canada. The course begins with an overview biodiversity crisis facing the planet and then moves to an overview of Canada's approach to managing biodiversity across the country. We will carefully examine the federal Species at Risk Act as well as the provincial and territorial wildlife legislation. The remaining of the course will be aimed at making improvements to the Canadian strategy. During the course of the semester, the students will focus on the recovery of endangered species in Canada through the development of a recovery strategy for a specific species.", "prerequisites": "14.0 credits including ENV100Y5 and JPE251H5"}, {"name": "JGE378H5 • Natural Hazards", "description": "Earth is a dangerous place and risk is an inherent feature of life on this planet. Some of the events and processes that we call \"hazardous,\" such as earthquakes, volcanic eruptions, floods, tsunamis, cyclones, and forest fires are natural environmental processes. We define them as hazards only when they pose a threat to human interests. In this course we will examine natural hazards as well as some technological hazards, their causes, their potential impacts on people, and their management and mitigation.", "prerequisites": "9.0 credits"}, {"name": "JPE251H5 • Introduction to Canadian Environmental Law and Policy I", "description": "This course serves as an introduction to environmental policy and law in Canada. The primary intent is to provide an overview of the political context in which environmental policy and law is made and implemented. The emphasis in this course will be on environmental policy. The course begins with an outline of the Canadian parliamentary system and policymaking process. A series of case studies, from biodiversity to climate change, are then explored as a way to see the policy process in action. [24L]", "prerequisites": "3.5 credits"}, {"name": "JPE252H5 • Introduction to Canadian Environmental Law and Policy II", "description": "This course builds on the themes and concepts introduced inJPE251H5. The primary intent is to provide an overview of the political context in which environmental policy and law is made and implemented. The emphasis in this course will be on environmental law. [24L]", "prerequisites": "JPE251H5"}]