[{"name": "JLP285H5 • Language, Mind, & Brain", "description": "Language is often described as a quintessentially human trait. What is the mental machinery underlying this ability? In this course, you will explore questions such as: Do animals have language? How do children learn language? How do we understand and produce language in real time? How does bilingualism work? What can neuroscience tell us about language abilities? What is the relationship between language and thinking?", "prerequisites": "(LIN101H5 and LIN102H5) OR PSY100Y5"}, {"name": "JLP315H5 • Language Development", "description": "By three years of age, children have mastered many of the complexities of human language. How do they do this so rapidly, and with such ease? In this course, you will examine language acquisition from a cognitive perspective. Topics include the acquisition of speech sounds, sentence structure, and conversational abilities, as well as patterns of development in special populations. You will also learn about childhood bilingualism and social aspects of language development. Hands-on experience analyzing recordings of children will be provided.", "prerequisites": {"and": [{"and": [], "or": ["PSY201H5/equivalent", "JLP285H5/equivalent"]}, {"and": [], "or": ["PSY210H5", "PSY270H5", {"and": ["LIN101H5", "LIN102H5"], "or": []}]}], "or": []}}, {"name": "JLP383H5 • Language Processing: Words, Sentences, and Discourse", "description": "Language is a key element in our social interactions, our ability to share information, and aspects of human culture. In this course you will engage in an advanced exploration of the cognitive machinery underlying language in adulthood. Key themes include: incremental interpretation and predictive processing; the relationship between language comprehension and production; and the nature of processing in bilinguals and speakers of less-studied languages. Practical activities address experimental methodology and aspects of data analysis.", "prerequisites": "[PSY201H5/equivalent or JLP285H5/equivalent] and [JLP315H5/equivalent or JLP 384H5/equivalent or PSY270H5 or (LIN101H5 and LIN102H5)]"}, {"name": "JLP384H5 • Speech Communication", "description": "Imagine an animal species where one creature can generate thoughts in other creatures' minds simply by causing the air molecules around them to vibrate. Although this sounds exotic, it is what we as humans do every time we speak and listen. In this course, we explore the perception and production of spoken language from an interdisciplinary perspective. Sample topics include perceptual and cognitive aspects of speech communication, speech signal acoustics, audio-visual speech integration, speech sound articulation, artificial speech recognition, multilingualism, and contextual influences on speech communication. Through laboratory exercises, students will replicate classic experimental findings and gain hands-on experience with acoustic and behavioural data analysis", "prerequisites": "[PSY201H5 or LIN228H5] and 0.5 credit from [JLP285H5/equivalent or JLP383H5/equivalent or LIN229H5 or LIN318H5 or PSY270H5 or PSY280H5]"}, {"name": "JLP388H5 • Bilingualism and Multiple Language Acquisition", "description": "What are the linguistic and psychological implications of knowing more than one language? This course will explore topics such as the bilingual brain, the nature of bilingual language input, effects of age-of-acquisition and language similarity, the status of heritage languages, schooling in a second language (for example French Immersion programs), and research methodologies used in the study of bilingualism. Bilingual/multilingual corpora will be examined.", "prerequisites": {"and": [], "or": ["JLP285H5/equivalent", "JLP315H5/equivalent"]}}, {"name": "JLP481H5 • Topics in Developmental Psycholinguistics", "description": "How do children's language comprehension and production abilities differ from adults? What can research on language acquisition tell us about why language looks the way it does? Developmental psycholinguists use experimental techniques to explore a range of topics in the area of child language comprehension and production. Drawing on cutting-edge interdisciplinary research, we will explore contemporary issues and debates in this area.", "prerequisites": "(LIN288H5 or PSY274H5) and 1.0 credit from the following list: LIN318H5 or LIN328H5 or LIN329H5 or LIN332H5 or LIN385H5 or LIN418H5 or LIN421H5 or PSY315H5 or PSY374H5 or PSY384H5 or any JLP course."}, {"name": "JLP483H5 • Topics in Adult Psycholinguistics", "description": "What is the connection between comprehending, producing, and thinking about language? How do the properties of different languages influence the nature of language processing? How is processing affected by differences across individuals? Drawing on a variety of perspective and methodologies, we will explore contemporary issues and debates in these and other topics.", "prerequisites": "(LIN288H5 or PSY274H5 or JLP285H5) and 1.0 credit from the following list: (PSY315H5 or JLP315H5) or (PSY374H5 or JLP383H5) or (PSY384H5 or JFL388H5 or JLP388H5) or (LIN318H5 or LIN418H5) or JLP384H5 or JLP481H5."}, {"name": "PSY100Y5 • Introductory Psychology", "description": "An examination of the science of behaviour, and use of the scientific method in the study of human and animal behaviour. This course, which includes 10 two-hour computer labs, is a prerequisite for all other Psychology courses except forPSY201H5andPSY202H5.", "prerequisites": "(LIN288H5 or PSY274H5 or JLP285H5) and 1.0 credit from the following list: (PSY315H5 or JLP315H5) or (PSY374H5 or JLP383H5) or (PSY384H5 or JFL388H5 or JLP388H5) or (LIN318H5 or LIN418H5) or JLP384H5 or JLP481H5."}, {"name": "PSY201H5 • Introduction to Quantitative Research in Psychology I", "description": "In this course, you will develop a conceptual understanding of statistics that will improve your data-driven decision-making processes and critical assessment of research findings. Using statistical programming, you will learn practical skills that will help you visualize data, draw insights from graphs, describe data to others, and test predictions using statistics.", "prerequisites": "Grade 12 (4U) Advanced Functions"}, {"name": "PSY202H5 • Introduction to Quantitative Research in Psychology II", "description": "This course builds on the foundation ofPSY201H5to explore a variety of statistical procedures used in psychology research, understand the factors that maximize the validity of research findings, and to develop effective strategies to communicate research findings.", "prerequisites": "PSY201H5"}, {"name": "PSY210H5 • Introduction to Developmental Psychology", "description": "How do children learn to interact with the world around them; to communicate, solve problems, establish moral principles, form meaningful relationships, and develop a sense of self? In this course, you will take an interdisciplinary approach to understanding how a child’s mind and brain develop through exploration of cognitive, biological, social, and cultural factors. At the end of this course, you will have developed an understanding of the theoretical, experimental, ethical, and psychological foundations of developmental psychology.", "prerequisites": "PSY100Y5"}, {"name": "PSY220H5 • Introduction to Social Psychology", "description": "A survey of classic and contemporary research in social psychology. Topics include the self, social cognition, attitudes, social influence, relationships, emotions, culture, stereotyping, altruism and aggression.", "prerequisites": "PSY100Y5"}, {"name": "PSY230H5 • Introduction to Personality Science", "description": "Personality science examines human diversity in behaviours, thoughts, and emotions. A primary learning objective is for students to think scientifically about human diversity in personality traits. The course focuses primarily on empirical results that have accumulated since the 1970s. Students learn about the measurement of personality, biological and social causes of human diversity, and the influence of personality on major life outcomes. The course focuses on variation in personality that is normal, although the relationship between personality and health – both physical and mental – is examined.", "prerequisites": "PSY100Y5"}, {"name": "PSY240H5 • Introduction to Abnormal Psychology", "description": "A survey of contemporary issues in theory and research on abnormal behaviour and its treatment. Topics include the definition of abnormal behaviour, causes and treatment of disorders, diagnosis and assessment, incidence and prevalence, biological and psychological interventions, prevention, as well as legal and ethical issues.", "prerequisites": "PSY100Y5"}, {"name": "PSY270H5 • Cognition: The Machinery of the Mind", "description": "In your everyday life, you are constantly bombarded with information from the external world. How does your mind select important information, remember it, and use it to govern your behaviour? Cognition is the study of the mechanisms involved in the processing of information. In this course, you will learn how your mind allows you to pay attention, create mental representations, remember information, manipulate knowledge, and express thoughts.", "prerequisites": "PSY100Y5"}, {"name": "PSY280H5 • Sensation and Perception: Where the World Meets the Brain", "description": "What you see, hear, taste, and smell is not only a product of sensory stimulation, but also your brain's attempt to make sense of that information. Perception is the gateway between the external world and your internal representation of what is going on around you. In this course, you will be introduced to current empirical research in perceptual science. You will develop a greater awareness of the biological underpinnings of how you perceive the world and how your brain actively interprets information from the environment.", "prerequisites": "PSY100Y5"}, {"name": "PSY290H5 • Introduction to Neuroscience", "description": "The human brain is made up of billions of cells and trillions of connections that give rise to our ability to perceive, act, think, and learn. Neuroscience, the scientific exploration of the brain, is beginning to unravel how this amazing structure works. In this course, you will learn the fundamental anatomical organization and physiological properties of the brain. You will develop a greater understanding of the structures of the brain, how neurons communicate, and the processes that give rise to perception, learning, and memory.", "prerequisites": "PSY100Y5"}, {"name": "PSY299H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to participate in the research project of a professor in return for 299H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "4.0 credits including PSY100Y5"}, {"name": "PSY299Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to participate in the research project of a faculty member in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of 4.0 FCE including PSY100Y5"}, {"name": "PSY309H5 • Experimental Design and Theory", "description": "You will learn how to interpret and critically evaluate psychological research, including the strengths and limitations of different research designs. You will learn to propose new research, including literature review, hypothesis formulation, anticipated results, and pre-specified analysis planning. Finally, you will also practice presenting your work in a virtual conference setting.", "prerequisites": "PSY202H5 (or equivalent) and 1.0 credit in PSY at the 200 level"}, {"name": "PSY310H5 • Adolescence and Emerging Adulthood", "description": "A survey of research findings and theories concerning the physical, cognitive, personality, and social growth of adolescents and emerging adults. Topics include pubertal development, changes in parent/adolescent relationships, role of peers, identity development, high-risk behaviours, and development through transitional periods.", "prerequisites": "PSY201H5 (or equivalent) and PSY210H5"}, {"name": "PSY311H5 • Social Development", "description": "A survey of contemporary research and theory in social development during infancy and childhood with consideration of the cultural context of development. Topics include interactional development, attachment, understanding self and others, sex role development, parenting and socialization, and outcome of development.", "prerequisites": "PSY201H5 (or equivalent) and PSY210H5"}, {"name": "PSY312H5 • Children's Thinking: Cognitive Development in a Social World", "description": "This course seeks to answer two questions about the development of children's thinking: (1) What develops? (2) How does this development occur? Students will develop an understanding of theory and research in cognitive development across a range of topics including perception, social cognition, language, conceptual development, and problem solving.", "prerequisites": "PSY201H5 (or equivalent) and PSY210H5 and PSY270H5"}, {"name": "PSY313H5 • Adult Development and Aging", "description": "An introduction to current research in human development from young adulthood through old age. Adult development will be examined in terms of the interplay of biological, socio-cultural, and psychological determinants, with special emphasis on psychological factors. Topics include the demographics of aging, research methods and problems, developmental changes in sensory-perceptual systems, memory, intelligence, personality, as well as issues related to mental health, dying and bereavement.", "prerequisites": "PSY201H5 (or equivalent) and one additional second year course in PSY"}, {"name": "PSY314H5 • Educational Psychology: The Science of Learning", "description": "In this class we will review key findings from cognitive development, cognitive psychology, and educational psychology that have implications for the development of learning experience inside and outside the classroom.", "prerequisites": {"and": ["PSY201H5", "PSY210H5", "PSY270H5"], "or": []}}, {"name": "PSY316H5 • Infant Perception and Cognition", "description": "This course focuses primarily on human perceptual and cognitive development during the first 2 years of life. A heavy emphasis is placed on experimental work with normally developing infants. Topics include but are not limited to face recognition, colour and depth perception, auditory localization, object categorization, speech and language processing, learning and memory, intelligence and social influences on development.", "prerequisites": {"and": [{"and": [], "or": ["PSY201H5", "equivalent"]}, {"and": [], "or": ["PSY210H5", "PSY270H5", "PSY280H5"]}], "or": []}}, {"name": "PSY317H5 • Gender and Sexual Development", "description": "Gender and sexuality influence how we think about ourselves and relate to others. This course explores the development of these aspects with emphasis on cognitive, social and cultural processes. Topics include gender stereotypes and the emergence of gender differences, gender and education, gender bias, gender identity, sexual development in children and youth, and sexual partner preferences.", "prerequisites": {"and": [{"and": [], "or": ["PSY201H5", "equivalent"]}, "PSY210H5"], "or": []}}, {"name": "PSY318H5 • Developmental Neuropsychology", "description": "A survey of brain development, its relation to normal cognitive and behavioural development, the effects of early brain damage on development, and specific neurological disorders of childhood.", "prerequisites": "PSY201H5 (or equivalent) and PSY210H5 and PSY290H5"}, {"name": "PSY319H5 • Developmental Psychology Laboratory", "description": "In this course, students will learn how to develop and design experiments to answer scientific questions of their interest in the study of Developmental Psychology. Students will learn research methods revelant to research with infants and children, and apply these advanced methods. Students will also learn to code and analyze real data using advanced computational and statistical software.", "prerequisites": "PSY201H5 and PSY202H5 (or equivalent) and PSY210H5 and PSY309H5"}, {"name": "PSY320H5 • Social Psychology:  Attitudes", "description": "Attitudes are persistent evaluations (preferences, likes and dislikes). This course examines the measurement of attitudes, the formation of attitudes to new objects, and the change of existing attitudes. General principles are illustrated with examples from various domains, such as propaganda and advertising, stereotyping and prejudice, attitudes towards health behaviours, and self-evaluations (self-esteem, life-satisfaction).", "prerequisites": {"and": [{"and": [], "or": ["PSY201H5", "equivalent"]}, "PSY220H5"], "or": []}}, {"name": "PSY321H5 • Cross-cultural Psychology", "description": "Culture influences our daily experience and has far-reaching implications for psychological development. This course explores the origins of culture as well as human cultural universals and cultural diversity through consideration of multiculturalism and the various ways culture influences people’s self-concepts, perceptual and cognitive processes, social and emotional lives, concepts of morality, and health.", "prerequisites": {"and": [], "or": ["PSY210H5", "PSY220H5", "PSY230H5", "PSY240H5", "PSY270H5", "PSY274H5"]}}, {"name": "PSY324H5 • The Science of Wellbeing", "description": "What makes people happy? Does money buy happiness or do unhappy people not know where to shop? Are people in California happier than people in Ontario? Does marriage make men happier and women unhappier? This course reviews the scientific evidence regarding these and other questions about the determinants of happiness from an interdisciplinary perspective (psychology, economics, sociology, philosophy, & biology) that ranges from molecular genetics to cross-national comparisons.", "prerequisites": "PSY201H5 (or equivalent) and (PSY220H5 or PSY230H5)"}, {"name": "PSY325H5 • Psychology of the Self", "description": "An examination of theory and research on the self from the perspectives of personality, developmental, and social psychology. Examples of topics associated with self development that will be covered are relationships, motivations, psychological stages, individual differences, cognition, culture, autobiographical memory, and narrative perspectives on the self.", "prerequisites": "PSY201H5 (or equivalent) and (PSY210H5 or PSY220H5 or PSY230H5)"}, {"name": "PSY327H5 • Psychology of Intimate Relationships", "description": "The objective of this course is to review what relationship science can tell us about close relationships, with a particular focus on romantic relationships. We will explore questions such as: Why do we want to be in relationships, what informs our choice of relationship partners, what predicts satisfaction and stability in relationships, and what is the role of sexuality in relationships? These and other questions will be examined from a variety of theoretical perspectives and will be applied to better understand real-world relationship functioning. General topics include theory and methods of relationships, attraction, social cognition, interdependence, attachment, sexuality, culture and gender, jealousy, and thriving relationships.", "prerequisites": "PSY201H5 (or equivalent) and (PSY220H5 or PSY230H5)"}, {"name": "PSY328H5 • Psychology and the Law", "description": "An examination of relevant research and contemporary methodologies examining phenomena encountered in the justice system. Topics include jury decision-making, violence and risk assessment, eye-witness evidence, insanity, psychopathy and anti-social personality disorder, sentencing, treatment of special offender groups, and criminal profiling. Students will learn how to apply the scientific method to examine behaviours that occur in a legal context.", "prerequisites": "PSY201H5 (or equivalent) and (PSY220H5 or PSY240H5)"}, {"name": "PSY329H5 • Social/Personality Laboratory", "description": "Readings, laboratory exercises, and research projects designed to familiarize students with methodologies relevant to empirical research in social/personality psychology.", "prerequisites": "PSY201H5 and PSY202H5/ (or equivalent) and (PSY220H5 or PSY230H5) and PSY309H5"}, {"name": "PSY330H5 • The Basics of Measurement in Social and Personality Psychology", "description": "In psychology, we often talk about people in relation to concepts like attachment, happiness, and need to belong. But, how do we actually measure these psychological constructs when we cannot see and touch them? Importantly, how can we be sure that research findings are based on good measurement practices and therefore seen as trustworthy? This course explores basic issues of psychometrics – the measurement of psychological constructs -- in social and personality psychology. We will read scholarly literature on psychometrics, discuss good practices for conceptualizing and assessing psychological constructs, and learn about how we can provide evidence for the validity and reliability of people’s responses to measures. We will practice using analytic techniques that examine measurement properties. The student should leave the course with a practical “measurement toolbox” which will allow them to conduct their own psychometric analyses, and better evaluate measurement practices used in social and personality psychology.", "prerequisites": "PSY201H5 (or equivalent)"}, {"name": "PSY331H5 • Psychology of Emotion", "description": "In this course you will develop an in-depth understanding of the role of emotions in human psychology. You will learn theories of emotion, emotional regulation, expression and experience, the role of emotion in decision-making, and the relationship between emotion, cognition and behaviour.", "prerequisites": "PSY201H5 (or equivalent) and (PSY220H5 or PSY230H5 or PSY240H5)"}, {"name": "PSY333H5 • Health Psychology", "description": "Examines research evidence concerning the impact of psychological factors on physical health and illness.", "prerequisites": "PSY201H5 (or equivalent) and (PSY230H5 or PSY240H5)"}, {"name": "PSY340H5 • Abnormal Psychology:  Adult Disorders", "description": "This advanced course provides an in-depth examination of current theory and research related to the origin, diagnosis, classification and treatment of adulthood psychological disorders. Readings and discussion will provide a biopsychosocial framework from which to explore contemporary explanations of psychopathology. Students will investigate how culture, societal norms, and environmental factors may shape what is considered to be abnormal adult behaviour.", "prerequisites": "PSY201H5 (or equivalent) and PSY240H5"}, {"name": "PSY341H5 • Abnormal Psychology:  Disorders of Children and Adolescents", "description": "Considers concepts of normal, abnormal and delayed development. Schemes of classification and diagnosis, approaches to identification of causes, antecedents, and consequences, as well as contemporary treatment methods are critically evaluated. In addition, resilience in the face of adversity will be addressed, since risk and traumatic events often do not lead to disorders. The emphasis is on rigorous research as a primary source of knowledge about psychological disorders and empirically supported treatment.", "prerequisites": "PSY201H5 (or equivalent) or PSY210H5 and PSY240H5"}, {"name": "PSY343H5 • Theories of Psychotherapy", "description": "Considers the theories and techniques of the major classic and contemporary approaches to psychological treatment (psychotherapy) for personality and behavioural disorders, research supporting and/or growing out of the theories, and critical examination of these theories.", "prerequisites": "PSY201H5 (or equivalent) and (PSY230H5 or PSY240H5)"}, {"name": "PSY344H5 • Forensic Psychology", "description": "An exploration of the role of psychology in forensic science (the application of scientific inquiry into criminal investigation). Topics, which will vary from year to year, could include the assessment of criminal responsibility, competency issues, psychiatric disorders associated with crime, criminal profiling, behavioural analysis of a crime scene, prediction of dangerousness, workplace and family violence, sexual assault/abuse/rape, recovered memories, detection of malingering and deception, deindividuation and bystander intervention, social psychology of the jury, use of psychological tests in legal cases, witness preparation/interrogation, and the psychologist as expert witness.", "prerequisites": "PSY240H5"}, {"name": "PSY345H5 • Exceptionality:  Disability and Giftedness", "description": "A survey of contemporary theory and research related to exceptionality with a special emphasis on disability and educational issues. Topics include controversial psychosocial issues, legal, family, and multicultural issues, disability across the lifespan, communication disorders, hearing and visual impairment, autism, and acquired brain injury.", "prerequisites": "PSY210H5"}, {"name": "PSY346H5 • Abnormal Psychology:  Neuroscience Perspectives", "description": "An examination of contemporary theory and research related to the origin, prevention, and treatment of psychological disorders from a biological perspective. The course will focus on the role of behaviour genetics, structures in the brain, and biochemistry in the nervous system in specific disorders (e.g., schizophrenia, mood and anxiety disorders, aggression, premenstrual syndrome, sleep disorders) and will discuss alternative approaches to their treatment (e.g., psychopharmacologic versus behaviourally-oriented therapies).", "prerequisites": "PSY201H5 (or equivalent) and PSY240H5 and PSY290H5"}, {"name": "PSY351H5 • Evolutionary Psychology", "description": "Application of the theory of biological evolution to understanding the origins and structure of the human mind.", "prerequisites": "PSY201H5 (or equivalent) and PSY290H5"}, {"name": "PSY352H5 • Animal Behaviour", "description": "An introduction to animal behaviour from a biological perspective, stressing ecological and evolutionary aspects of behaviour. The course will review the neural, endocrine and physiological mechanisms mediating animals' natural behaviours, as well as how gene-environment interactions during development modify these behavioural mechanisms.", "prerequisites": "PSY201H5 (or equivalent) and PSY290H5"}, {"name": "PSY353H5 • Social Neuroscience", "description": "The course will focus on the development and adult organization of brain mechanisms underlying the perception of social information and production of diverse social behaviours in mammalian species. Circumstances and events that can lead to diminished function and psychopathology in humans will be considered.", "prerequisites": "PSY201H5 (or equivalent) and PSY290H5"}, {"name": "PSY354H5 • The Biopsychology of Sex", "description": "This course is an introduction to the scientific study of human sexuality. Topics covered may include sexual development, sexual orientation, sex practices, sexuality across the lifespan, sexual dysfunction and sexually transmitted diseases.", "prerequisites": "PSY201H5 (or equivalent) and PSY290H5"}, {"name": "PSY355H5 • Animal Behaviour Genetics", "description": "An introduction to the genetic analysis of behaviour. The concepts and methods of classical Mendelian genetics, quantitative genetics, and recombinant DNA technology-based reverse and forward genetic approaches will be discussed as they relate to the analysis of animal behaviour.", "prerequisites": "PSY201H5 (or equivalent) and PSY290H5"}, {"name": "PSY362H5 • Animal Cognition", "description": "A comparative survey of cognitive processes in animals from an ecological and evolutionary perspective. The course will examine topics including perception, working and reference memory, simple associative and complex relational learning, and concept formation.", "prerequisites": "PSY201H5 (pr equivalent) and PSY270H5 and PSY290H5"}, {"name": "PSY368H5 • Neuroimaging Laboratory", "description": "In this course, you will become familiar with theory and principles underpinning approaches to measuring the brain. The course will focus on techniques used in human neuroscience research. Students will gain skills relevant to the processing, visualization, analysis, interpretation, and reporting of brain data.", "prerequisites": {"and": ["PSY201H5", "PSY202H5", "PSY290H5"], "or": []}}, {"name": "PSY369H5 • Behavioural Neuroscience Laboratory", "description": "In this course, you will be guided through hands-on laboratory exercises to learn how behavioural paradigms, along with anatomical, genetic, and physiological methods, can be used to answer questions relevant to behavioural neuroscience research.", "prerequisites": "PSY202H5 (or equivalent) and PSY290H5"}, {"name": "PSY371H5 • Higher Cognitive Processes", "description": "This course covers selected topics pertaining to higher cognitive processes including expertise, consciousness, creativity, and human and artificial intelligence.", "prerequisites": "PSY201H5 (or equivalent) and PSY270H5"}, {"name": "PSY372H5 • Human Memory: The World within your Mind", "description": "Your everyday life hinges on the ability to encode perceptual information around you (what’s in the fridge?) and build a model of the world in your mind (need to buy milk) so that you can retrieve information later when you need it (at the grocery store). How does your mind and brain support this fundamental yet complex mental ability? In this course, you will learn how human memory works, drawing on key findings in cognitive psychology and recent advances in neuroscience.", "prerequisites": "PSY201H5 (or equivalent) and PSY270H5 and PSY290H5"}, {"name": "PSY379H5 • Cognitive Psychology Laboratory", "description": "In this course, students will learn how to design and propose original experiments to answer scientific questions of their interest in the field of cognitive psychology. Students will discover the mechanisms involved in the processing of information by engaging with various methodologies used by cognitive psychologists and learn to analyze real data using advanced computational and statistical software.", "prerequisites": "PSY201H5 and PSY202H5 (or equivalent) and (PSY270H5 or PSY274H5) and PSY309H5"}, {"name": "PSY385H5 • Human Factors: Applying Perceptual and Cognitive Research to the World", "description": "How can understanding perception help to explain what we do in the world? In this course, we will consider questions from engineering and human factors through the lens of perceptual research, tackling the human side of design and engineering problems. Topics include driver behaviour, interface design, data visualization and the perceptual and psychological foundations that dictate their success or failure.", "prerequisites": {"and": [], "or": ["PSY270H5", "PSY272H5", "PSY280H5", "PSY290H5."]}}, {"name": "PSY387H5 • Psychology of Music", "description": "An examination of the psychological foundations of music perception and performance. Consideration of processing differences between naive and experienced listeners, biological foundations of music processing, cultural contributions to music processing, theoretical perspectives on the origins of music, music and emotion, and the non-musical implications of musical training.", "prerequisites": "PSY201H5 (or equivalent) and (PSY210H5 or PSY270H5 or PSY274H5 or PSY280H5)"}, {"name": "PSY389H5 • Perception Laboratory", "description": "In this course, students will learn how to develop and design experiments to answer scientific questions of their interest in the study of perception. Students will learn psychophysical methods, which relate the physical properties of the world to perceptual experience, and apply these advanced methods by carrying out experiments and analyzing data.", "prerequisites": "PSY202H5 (or equivalent) and (PSY280H5 or PSY290H5)"}, {"name": "PSY391H5 • Psychology of Pain", "description": "An introduction to the biological and psychological aspects of pain, as a multidimensional bodily sensation, an adaptive solution to threatening stimuli and a clinical problem. Pain will be introduced from a phenomenological perspective, focusing on the ways in which social, situational, psychological and organismic factors can alter pain. An awareness of the current challenges and unanswered questions in pain research and management will be fostered.", "prerequisites": "PSY201H5 (or equivalent) and PSY290H5"}, {"name": "PSY392H5 • Behavioural Epigenetics", "description": "Epigenetics encompasses the study of stable alterations in gene activity that occur independent of changes to genetic sequence. Epigenetics has been implicated in all aspects of behaviour, from responding to maternal behaviour in early life to mediating cognitive function in aging and dementia. This course will describe how epigenetics shapes development, learning, memory, stress response, and mental illness in animal and human models.", "prerequisites": "PSY201H5 (or equivalent) and PSY290H5"}, {"name": "PSY393H5 • Human Neuropsychology", "description": "This course will review major topics in cognitive neuroscience, with an emphasis on human function. Sample topics include issues such as memory disorders and models of memory, split brain research, language and aphasia, attention, emotion, and executive functions.", "prerequisites": "PSY201H5 (or equivalent) and PSY270H5 and PSY290H5"}, {"name": "PSY395H5 • Hormones and Behaviour", "description": "This course is an introduction to the field of Behavioural Neuroendocrinology -- the study of relationships between hormones, the nervous system, and behaviour in a variety of species from a comparative perspective. Behavioural/functional systems may include reproductive behaviour, social behavior, biological rhythms, eating, and stress.", "prerequisites": "PSY201H5 (or equivalent) and PSY290H5"}, {"name": "PSY397H5 • Neuroplasticity and Behaviour", "description": "An examination of experimental findings and theory documenting the plasticity of the brain and its relationship to behaviour. The course will discuss the molecular, synaptic, cellular and circuitry components of neural plasticity in relation to learning and experience.", "prerequisites": "PSY201H5 (or equivalent) and PSY290H5"}, {"name": "PSY399H5 • Research Opportunity Program", "description": "This course provides third year undergraduate students who have developed an understanding of psychological research methods with an opportunity to participate in the research program of a faculty member in return for course credit. Enrolled students will have the opportunity to become involved in original research, enhance their research skills and share in the excitement of acquiring new knowledge and in the discovery process of science. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of 8.0 credits and 1.0 credit of PSY at 200-level and last AGPA of 3.0 or above."}, {"name": "PSY399Y5 • Research Opportunity Program", "description": "This course provides third year undergraduate students who have developed an understanding of psychological research methods with an opportunity to participate in the research program of a faculty member in return for course credit. Enrolled students will have the opportunity to become involved in original research, enhance their research skills and share in the excitement of acquiring new knowledge and in the discovery process of science. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of 8.0 FCE and 1.0 200-level credit in Psychology and last AGPA of 3.0 or above."}, {"name": "PSY400Y5 • Thesis", "description": "Independent research supervised by individual faculty members. Seminars on general topics relevant to the conduct of independent research, student research proposals, and the presentation of findings. To register in the course, students must obtain approval from a faculty supervisor, and apply for and obtain approval from Department of Psychology (see the Psychology department website for details). Advanced-level students who do not meet the stated course prerequisites but who possess relevant research experience may be admitted at the discretion of the course instructor. In addition to the seminar component, students complete at least 72 hours of research in the laboratory of their supervisor.Note: Entry to the course is competitive. Satisfaction of minimum requirements does not guarantee admission to the course.", "prerequisites": "PSY202H (or equivalent) and at least 0.5 credits in advanced laboratory or research courses in Psychology at the 300 or 400 level (e.g., PSY courses ending in \"9\" at the 300 or 400 level, and PSY403) and last AGPA of 3.2 (varies from year to year and is rarely below 3.4)."}, {"name": "PSY401H5 • Knowledge Translation: Delivering Scientific Discovery to the Real-World", "description": "As a science, psychology investigates why and how humans and nonhuman animals feel, think, and behave in the ways they do. Our discoveries can be harnessed for societal good when the insights gained from psychological research are communicated accurately to the public. In this course, students will participate in seminars to learn to communicate effectively about scientific discoveries and engage in the process of knowledge translation. Students will also work with a Psychology faculty supervisor to create and deliver knowledge translation products.Note: To register in the course, students must obtain approval from a faculty supervisor, and apply for and obtain approval from the Department of Psychology (see the Psychology department website for details).", "prerequisites": "1.0 credits in 300-level psychology courses. Commitment from a faculty supervisor via application process."}, {"name": "PSY402H5 • Roots of Psychology: A history of the field from the 19th century to the present day", "description": "Where did the field of psychology come from, and where is it going?In this course we will explore these questions through the lens of theoretical frameworks, experimental methods, ideas that have (or have not) endured, recent advances, and promising new directions.", "prerequisites": "1.0 credit of PSY at 300 level"}, {"name": "PSY403H5 • Individual Project", "description": "Independent research on a specific aspect of human or animal behaviour. Students arrange for a Faculty supervisor during the preceding term.", "prerequisites": "PSY201H5 equivalent and 1.0 credit of PSY at 300-level and minimum last AGPA of 3.0 or above"}, {"name": "PSY404H5 • Individual Project", "description": "Independent research on a specific aspect of human or animal behaviour. Students arrange for a Faculty supervisor during the preceding term.", "prerequisites": "PSY201H5 (or equivalent) and 1.0 credit of PSY at the 300-level and minimum last AGPA of 3.0"}, {"name": "PSY405H5 • Individual Project", "description": "Independent research on a specific aspect of human or animal behaviour. Students arrange for a Faculty supervisor during the preceding term.", "prerequisites": "PSY201H5 (or equivalent) and 1.0 credit of PSY at the 300-level and minimum last AGPA of 3.0"}, {"name": "PSY406H5 • Individual Project", "description": "Independent research on a specific aspect of human or animal behaviour. Students arrange for a Faculty supervisor during the preceding term.", "prerequisites": "PSY201H5 (or equivalent) and 1.0 credit of PSY at the 300-level and minimum last AGPA of 3.0"}, {"name": "PSY410H5 • Special Topics in Developmental Psychology", "description": "In depth examination of selected topics in developmental psychology. Topics change periodically. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will always be 36 hours in total. See the UTM Timetable.", "prerequisites": "PSY210H5 and 1.0 credit from (PSY311H5 or PSY312H5 or PSY315H5 or PSY316H5 or PSY317H5 or PSY318H5 or PSY319H5 or PSY341H5 or PSY345H5 or PSY442Y5)"}, {"name": "PSY415H5 • Special Topics in Adult Development and Aging", "description": "In depth examination of selected topics in adult development and aging. Topics change periodically. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will always be 36 hours in total. See the UTM Timetable.", "prerequisites": "PSY313H5 and 1.0 credit from (PSY311H5 or PSY312H5 or PSY316H5 or PSY319H5 or PSY320H5 or PSY321H5 or PSY325H5 or PSY343H5 or PSY333H5 or PSY340H5 or PSY345H5 or PSY374H5 or PSY442Y5)"}, {"name": "PSY420H5 • Special Topics in Social Psychology", "description": "In depth examination of selected topics in social psychology. Topics change periodically. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will always be 36 hours in total. See the UTM Timetable.", "prerequisites": "PSY220H5 and 1.0 credit from (PSY311H5 or PSY319H5 or PSY320H5 or PSY321H5 or PSY325H5 or PSY329H5 or PSY343H5 or PSY333H5 or PSY340H5 or PSY341H5)"}, {"name": "PSY424H5 • Special Topics in Well-Being", "description": "In depth examination of selected topics in well-being. Topics change periodically. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will always be 36 hours in total. See the UTM Timetable.", "prerequisites": {"and": [], "or": ["PSY320H5", "PSY321H5", "PSY324H5", "PSY325H", "PSY327H5", "PSY331H5", "PSY343H5", "PSY340H5", "PSY333H5", "PSY341H5", "PSY344H5", "PSY345H5", "PSY346H5", "PSY442Y5"]}}, {"name": "PSY430H5 • Special Topics in Personality", "description": "In depth examination of selected topics in personality. Topics change periodically. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will always be 36 hours in total. See the UTM Timetable.", "prerequisites": "(PSY220H5 or PSY230H5) and 1.0 credit from (PSY311H5 or PSY320H5 or PSY321H5 or PSY324H5 or PSY325H5 or PSY327H5 or PSY331H5 or PSY333H5"}, {"name": "PSY440H5 • Special Topics in Abnormal Psychology", "description": "In depth examination of selected topics in abnormal psychology. Topics change periodically. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will always be 36 hours in total. See the UTM Timetable.", "prerequisites": "PSY340H5 and one of (PSY320H5 or PSY321H5 or PSY331H5 or PSY343H5 or PSY333H5 or PSY341H5 or PSY344H5 or PSY345H5 or PSY346H5 or PSY442Y5)"}, {"name": "PSY442Y5 • Practicum in Exceptionality in Human Learning", "description": "Seminar and practicum on issues relating to the life-long development of individuals with disabilities. Seminar at UTM; practicum involves supervised placements in schools or social service agencies (80 hours). Course is required for students enrolled in the Exceptionality in Human Learning Specialist program and is available to Psychology Specialists, Majors and Minors on a competitive basis. Course fulfills the 400-level seminar requirement for the Psychology Specialist Program. Admission by academic merit. Interested students should submit an application to the Psychology office by mid-April. Application procedures:http://www.utm.utoronto.ca/psychology/undergraduate-studies/course-info….", "prerequisites": "10.0 credits including PSY210H5 and 1.0 credit of PSY at the 300 level"}, {"name": "PSY471H5 • Special Topics in Cognition", "description": "In-depth examination of selected topics in cognition. Topics change periodically. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will always be 36 hours in total. See the UTM Timetable.", "prerequisites": "PSY270H5 and 1.0 credit from (PSY312H5 or PSY315H5 or PSY360H5 or PSY362H5 or PSY372H5 or PSY374H5 or PSY379H5 or PSY393H5 or PSY397H5)"}, {"name": "PSY474H5 • Special Topics in Human Communication", "description": "In-depth examination of selected topics in the psychology of human communication. Topics change periodically. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will always be 36 hours in total. See the UTM Timetable.", "prerequisites": "1.0 300 level credit in Psychology including (PSY315H5 or PSY374H5) and one of (PSY312H5 or PSY315H5 or PSY316H5 or PSY319H5 or PSY374H5 or PSY379H5 or PSY384H5)"}, {"name": "PSY480H5 • Special Topics in Perception", "description": "In-depth examination of selected topics in perception. Topics change periodically. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will always be 36 hours in total. See the UTM Timetable.", "prerequisites": "PSY280H5 and 1.0 300 level credit in Psychology"}, {"name": "PSY490H5 • Advanced Topics in Neuroscience", "description": "In depth examination of selected topics in biological psychology. (Topics change periodically.)", "prerequisites": "(PSY270H5 or PSY290H5) and 1.0 credit from (PSY346H5 or PSY351H5 PSY352H5 or PSY353H5 or PSY354H5 or PSY355H5 or PSY362H5 or PSY369H5 or PSY372H5 or PSY391H5 or PSY392H5 or PSY393H5 PSY395H5 or PSY397H5 or PSY398H5 or BIO304H5)."}, {"name": "PSY495H5 • Special Topics in Neuropsychology", "description": "In depth examination of selected topics in neuropsychology. Topics change periodically. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will always be 36 hours in total. See the UTM Timetable.", "prerequisites": "PSY290H5 and 1.0 credit from (PSY315H5 or PSY318H5 or PSY346H5 or PSY362H5 or PSY372H5 or PSY374H5 or PSY379H5 or PSY393H5 or PSY397H5)"}, {"name": "PSY499H5 • Research Opportunity Program", "description": "This course provides a rewarding opportunity for students in their fourth year to undertake relatively advanced work in the research project of a faculty member in return for PSY499H course credit. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of 13.0 FCE and 1.0 300-level credit in Psychology and minimum last AGPA of 3.0 or above."}, {"name": "PSY499Y5 • Research Opportunity Program", "description": "This course provides a rewarding opportunity for students in their fourth year to undertake advanced work in the research project of a faculty member in return forPSY499Y5course credit. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of 13.0 credits and 1.0 300-level credit in Psychology and minimum last AGPA of 3.0 or above."}]