[{"name": "SOC202H5 • Cultural Sociology", "description": "This course introduces students to the field of cultural sociology, which seeks to understand how ideas, meanings, values and beliefs are created, and how they are also implicated in foundational sociological issues such as inequality, identity, social change, and social organization. These linkages are examined through topics such as popular culture, the mass media, science, religion, art, language, knowledge, public opinion, food, advertising and consumerism.", "prerequisites": "SOC100H5"}, {"name": "SOC205H5 • Theories in Criminology", "description": "This course will cover major theoretical paradigms in the field of criminology included, among others, classical, positivist, strain, control, social learning, critical, feminist, postmodern and critical race theories. Students are required to take this course upon entry to the Criminology, Law and Society Major and Specialist programs.", "prerequisites": {"and": ["SOC100H5", {"and": [], "or": ["SOC109H5", "SOC209H5"]}], "or": []}}, {"name": "SOC206H5 • Introduction to the Sociology of Genocide", "description": "This lecture course will lead students through an in-depth consideration of why genocides occur.", "prerequisites": "SOC100H5"}, {"name": "SOC208H5 • Crime and Organizations", "description": "An analysis of the intersection between crime and organizations. This course introduces students to various organizational theories and examines crime by organizations, crime within organizations, and crime that is \"organized.\"", "prerequisites": {"and": ["SOC100H5", {"and": [], "or": ["SOC109H5", "SOC209H5"]}], "or": []}}, {"name": "SOC210H5 • Canadian Criminal Justice", "description": "This course provides an introduction to sociological and criminological analyses of crime, law, and the operation of the Canadian criminal justice system, with emphasis on how law and criminal justice are shaped by social, political and economic considerations. It will also consider how social identities such as race, class and gender influence individuals' perceptions of, and experiences in, the Canadian criminal justice system.", "prerequisites": {"and": ["SOC100H5", "SOC109H5"], "or": []}}, {"name": "SOC211H5 • Law and Social Control", "description": "This course investigates the role of law in shaping social norms and regulating behavior.", "prerequisites": {"and": ["SOC100H5", {"and": [], "or": ["SOC109H5", "SOC209H5"]}], "or": []}}, {"name": "SOC216H5 • Sociology of Law", "description": "Major theoretical and substantive debates in the sociology of law. How race, gender and social inequality shape legal institutions, the law and the broader social context.", "prerequisites": {"and": ["SOC100H5", {"and": [], "or": ["SOC109H5", "SOC209H5"]}], "or": []}}, {"name": "SOC219H5 • Gender and Crime", "description": "This course explores how masculinity and femininity shape and are shaped by offending, violence, and victimization. Possible topics may include the gender gap in crime, intersectionality, gender diversity, victimless crimes, survival crimes, gender-based violence, and missing and murdered Indigenous women.", "prerequisites": {"and": ["SOC100H5", {"and": [], "or": ["SOC109H5", "SOC209H5"]}], "or": []}}, {"name": "SOC221H5 • The Logic of Social Inquiry", "description": "Logic of Social Inquiry compares the logic of quantitative and qualitative research. Key topics include the relationship between theory and research, conceptualization and measurement of sociological concepts and sampling strategies in the quantitative and qualitative traditions. Students are introduced to a range of data collection methods. Students are required to take this course upon entry to the Sociology and Criminology, Law and Society Major and Specialist programs.", "prerequisites": "SOC100H5"}, {"name": "SOC222H5 • Measuring the Social World", "description": "This course addresses how we are able to measure social concepts such as social characteristics, social attitudes, and social actions. Descriptive statistics and their presentation in tables and graphs will be presented in some detail. A very basic introduction to inferential statistics and sampling will also be presented. Students are required to take this course upon entry to the Sociology and Criminology, Law and Society Major and Specialist programs.", "prerequisites": "SOC100H5"}, {"name": "SOC224H5 • Sociology of Education", "description": "This course examines what some of our key sociological thinkers have said about the role of education in society, from socialization to sorting students into different opportunities, including along the lines of race, class and gender. The course also covers the development of the education system in Canada, the career of teaching, curriculum development, and standardized testing. Students will have the opportunity to apply sociological insights to contemporary issues in education.", "prerequisites": "SOC100H5"}, {"name": "SOC227H5 • Sociology of Work and Occupations", "description": "This course covers work and post-industrialization in Canada today. It considers labour force participation, and social differences and inequalities across different groups, including gender, class, and ethnicity/race. It also examines managerial cultures and styles, and workers' responses and resistance to managerial control.", "prerequisites": "SOC100H5"}, {"name": "SOC228H5 •  Introduction to Indigenous Studies", "description": "This survey course introduces students to theinterdisciplinary field of Indigenous Studies. Students willexplore the themes, theories and methods of the discipline,and develop a foundational knowledge about Indigenoushistory, peoples, cultures and societies in Canada.", "prerequisites": "0.5 SSC credit"}, {"name": "SOC230H5 • Thinking Like a Sociologist", "description": "This course builds onSOC100H5through a deep engagement with 4-5 significant new publications in Sociology, typically books by department faculty and visiting scholars. By developing reading and writing skills through a variety of assignments, including reflections, and experiential learning in classroom debates and simulations with the researchers who produced the publications, students will learn to \"think like a sociologist\". Possible topics covered include race/ethnicity, gender, work, immigration, political sociology, cultural sociology, and criminology, as well as other major subfields within the discipline.", "prerequisites": "SOC100H5"}, {"name": "SOC231H5 • Classical Sociological Theory", "description": "This course presents a discussion and analysis of classical sociological theory including such luminaries as Marx, Durkheim, Weber and Dubois among others. Students are required to take this course upon entry to the Sociology Major and Specialist programs and the Criminology, Law and Society Specialist program.", "prerequisites": "SOC100H5"}, {"name": "SOC236H5 • Globalization", "description": "How do individuals relate to the complex and over-used concept of \"globalization\"? This course will explore major theories and controversies in the field of globalization scholarship, looking at the phenomena from the perspective of global capitalists, anti-globalization social movements, consumers, states, and citizens. Students will critically evaluate common claims made about globalization, and acquire tools to assess the validity of competing perspectives.", "prerequisites": "SOC100H5"}, {"name": "SOC239H5 • Sociology of Health and Illness", "description": "This course examines the social causes of illness and disease, the sociology of illness experience, and the sociology of risks to health. The course addresses only peripherally issues related to formal health care provision, health care work, and the structure of health care systems.", "prerequisites": "SOC100H5"}, {"name": "SOC240H5 • Introduction to Social Policy", "description": "This course will examine how human needs are met by states. It focuses on the sociological, political and economic forces that help create new policies and reshape existing social policies. The course will provide a survey of welfare state policies, economic policies and family policies. It will also focus on the outcomes of social policy as these affect various constituencies and social groups such as the economically underprivileged and disadvantaged, racial and ethnic minority groups, and people with disabilities.", "prerequisites": "SOC100H5"}, {"name": "SOC244H5 • Sociology of Families", "description": "The development and variation in contemporary families will be presented. Topics may include cross-cultural comparisons, the impact of legal, economic and political factors as well as change in the meaning of the term \"family\".", "prerequisites": "SOC100H5"}, {"name": "SOC253H5 • Social History of Race and Ethnicity", "description": "This course examines how ideas about \"race\" and \"ethnicity\" evolved and became institutionalized on a global scale, as well as systems of exploitation, exclusion and inequality that have given rise to today's patterns of racial and ethnic inequality in the world. We focus on examples from different regions of the world, as well as examine large-scale historical events such as colonialism, slavery and immigration.", "prerequisites": "SOC100H5"}, {"name": "SOC263H5 • Social Inequality", "description": "Examines the causes, prevalence and manifestations of social, political and economic inequalities, internationally and within Canada. The effects of gender, age, ethnicity-race, among other characteristics, are carefully analyzed in Canada and cross-culturally.", "prerequisites": "SOC100H5"}, {"name": "SOC275H5 • Sociology of Gender", "description": "This course introduces students to the sociology of gender showing how gender is a relationship of power that structures our everyday lives from intimate relationships through global political and economic forces. We will focus on gender and gender differences as produced in historically and locally specific ways where gender differences intersect with those of race, ethnicity, class, religion, sexuality and other structures of inequality.", "prerequisites": "SOC100H5"}, {"name": "SOC299H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return forSOC299H5course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "SOC100H5 and 2nd Year Standing and permission of instructor"}, {"name": "SOC299Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return forSOC299Y5course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "SOC100H5 and 2nd Year Standing and permission of instructor"}, {"name": "SOC301H5 • Canadian Prisons", "description": "This course will examine trends and approaches within the correctional system in Canada. It will explore the historical and contemporary context of correctional practices. Attention will be paid to the differential impact of Canadian corrections on Aboriginal people and other minority groups.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC302H5 • Indigenous-Canada Relations", "description": "This course analyzes Indigenous-Canada relations. Topics may include nationhood, diplomatic relations, trade, military relationships, assimilation/civilization policy, land claims, self-government, and/or education.", "prerequisites": "1.0 SSC credit"}, {"name": "SOC303H5 • White-collar and Corporate Crime", "description": "This course explores the individual, organizational, and ecological dimensions of white-collar and corporate crime. Topics generally include financial and environmental crime, workplace safety, and organizational deviance. As well, the social, political, and criminal justice responses to these crimes will be examined.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC304H5 •  Environmental Sociology", "description": "This course focuses on human-nature interactions, and the social processes that modify and threaten the natural world.Students develop a better understanding of environmental issues, the interrelationship between social problems and environmental problems, as well as the ways that humans themselves are part of nature.", "prerequisites": "SOC100H5 and 1.0 SSC credit at the 200-level"}, {"name": "SOC305H5 • Asian Canada and Asian Diaspora", "description": "The course will introduce students to the core and cutting-edge sociological and interdisciplinary scholarship on Asian Canada and Asian diaspora from transnational perspectives. We will examine the history of Asian migration to North America on the context of colonialism, the Cold War, and capitalist development, as well as the experiences of various Asian immigrant communities in the contemporary era.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC306H5 • Education and Social Control", "description": "This course explores the intersections of education and social control. In particular, we focus on moments when social control is evident in schooling, including how that control is used on some populations more than others. Topics include zero-tolerance policies, police/security presence in schools, education programming in prison, and the school-to-prison pipeline.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC308H5 • Law and Crime in Asia and Asian Diasporas", "description": "This course introduces students to the core and cutting-edge sociological and interdisciplinary scholarship on law and crime in Asia and Asian diasporas across the world. It examines major topics in criminology, law and society in various Asian contexts (e.g., legal consciousness, legal pluralism, dispute resolution, policing, rights mobilization, etc.), as well as the experiences of Asian immigrant communities with legal and criminal justice systems.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC309H5 • Sociology of Mass Communication", "description": "This course examines the theories, methods, and findings of sociological studies of media production, content, and reception. The focus is on understanding how communication theories are adjudicated by empirical findings. Topics include race and gender in the media, bias in the news, media ownership, the film industry, and the role of the media in politics.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC310H5 • Youth Justice", "description": "The youth criminal justice system in Canada. Topics include historical and contemporary shifts in the youth justice system, young offender legislation, public perceptions and media representations of juvenile delinquency, current research and theories on youth crime and crime prevention strategies. Particular attention is paid to the treatment of specific groups.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC311H5 • Special Topics in Law", "description": "This course will provide an in-depth exploration of a specific topic in law. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC312H5 • Law, Race and Racism", "description": "The course investigates the relationship between law, race, and racism and the societal implications. Students will gain a stronger understanding of how law creates race for the purposes of legitimating and perpetuating racism and the ways that law can, under some conditions, generate social change that reduces racial inequality.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC314H5 • AI, Robotics, and Society", "description": "This course focuses on the social, historical, and technological origins and the intended as well as unintended consequences of the Internet, Artificial Intelligence and Robotics for society. Major classical and contemporary sociological concepts will be introduced and used for understanding these new technologies.", "prerequisites": "SOC100H5"}, {"name": "SOC316H5 • Crime Prevention and Security", "description": "The growth of political, economic, community and academic interest in crime prevention and security. How segments of society or particular physical sites are constructed as security risks in need of regulation. The regulation of security, including crime prevention, community safety, risk reduction and surveillance. These issues are then examined in relation to specific empirical developments such as private policing, restorative justice, community policing and gated communities.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC317H5 • Shopping and Society", "description": "This course provides an overview of the Sociology of Consumption. The study of consumption provides an entry point for examining the intersection between culture, economics, and the environment. Potential topics include the following: the shopping experience, consumption as status, the environmental impact of consumerism, fashion cycles, and identity construction through consumption.", "prerequisites": "SOC100H5 and 1.0 SOC credit at the 200 level."}, {"name": "SOC318H5 • Sociology of Mental Health and Mental Disorders", "description": "An overview of the link between social inequality and inequality in distress, focusing on differences in mental health across social groups and the role of stress and coping resources in explaining group differences.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC319H5 • Capitalism and Society", "description": "This course focuses on the origins and multiple intended and unintended social consequences – including the birth of formal academic Sociology - of modern industrial capitalism. Possible topics include colonialism, slavery, imperialism, food, family, fashion, media, politics, war, inequality, relationships, identities, consumption, education, globalization, the climate crisis etc.", "prerequisites": "SOC231H5"}, {"name": "SOC320H5 • Criminal Justice Organizations", "description": "This course uses organizational theory to examine major criminal justice institutions--including police, courts, and prisons. It examines the role of organizational goals, structure, resources, legitimacy, culture, and front-line workers in shaping organization-level decisions about policy and practice. It also examines the interactions, mutual influence, and competition between government, interest groups, and criminal justice institutions that help to initiate and sustain field-wide change.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC321H5 • Law & Rights", "description": "This course investigates the promise and limitations of rights as a legal framework to safeguard citizens and residents of Canada and abroad. Topics include the framing and implementation of novel rights claims, the relationship between formal rights and social norms, and the impact of rights frameworks on civic and community ties.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC322H5 • Criminal Justice and Inequality", "description": "This course examines the intersections between social inequality and the criminal justice system in Canada and internationally. The course will explore the impact of practices and policies on race, class, gender and other forms of social inequality.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC323H5 • Law, Culture and Social Problems", "description": "This course explores contemporary social problems related to law with an emphasis on cultural dynamics such as perception, group and community culture, stereotyping, and meaning-making. Topics covered may include law in everyday life, gun carrying by gun owners, workplace discrimination lawsuits, the #MeToo movement, and the Canadian government’s marginalization of Indigenous legal orders.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC324H5 • Carceral Feminisms: Race, Gender and State Violence", "description": "This course explores how different strains of feminism shape practices of punishment. Course topics may include: intersectional debates in the regulation of domestic violence, gender-responsive policing, state regulation of gender-based violence, and prison abolition theory and praxis.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC325H5 • Law and Social Theory", "description": "This course examines the writings on law-related topics in classical and contemporary social theories. At the intersection between socio-legal studies and sociological theory, the course traces how different generations of social theorists approach law, from classical theorists such as Montesquieu, Tocqueville, Marx, Durkheim, and Weber to contemporary socio-legal theorists across the world.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC326H5 • Policing", "description": "This course will examine the nature of policing, its structure and function. Attention is given to the theoretical analyses of policing, the history of policing and to its public and private forms. The course will focus on the objectives and domain, as well as the strategies, powers, and authority of contemporary policing; including decision-making, wrong-doing, accountability, and the decentralization of policing.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC327H5 • Drugs and the Modern World", "description": "The course examines how \"drugs\", as well as attempts to police and control their use, have been implicated in the making of the modern world. Instead of taking drugs as inherently criminal and deviant, the course will look at how drugs have played a central role in the development of capitalism, colonialism and global inequality in the past 200 years.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC328H5 • Drugs in the City", "description": "This course will explore illegal urban drug markets in Canada and the United States. Specifically, it will focus on how urban drug markets and drug use are influenced by drug cycles, moral panics, the economy, and criminal justice policy. Moreover, it will sociologically analyze the business practices, subcultures, and gendered interactions of drug market participants.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC329H5 • Law & Social Movements", "description": "This course focuses on how popular movements and legal institutions influence efforts to produce or prevent social change. Taking a comparative approach, it examines the social conditions that mobilize and sustain popular movements, factors that contribute to movement success, and the receptivity of courts to pressure from below.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC330H5 • Criminology and Immigration", "description": "This course examines the intersection between immigration and crime control. More specifically, it examines immigration detention and deportation, concerns with immigrant risk, security and terrorism, as well as the impact of public policy on immigration and crime.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC331H5 • Gender and Criminal Justice", "description": "This course explores how gender impacts criminalization and how gender shapes the way criminal justice is conceptualized and delivered. Possible topics may include masculinity & criminalization; gender & policing; gender & court outcomes; women's prisons, and trans issues in prisons.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC332H5 • Race and Ethnicity in Canada", "description": "This course deals with the social construction of racial and ethnic categories in the Canadian context, as well as with how Canadian institutions have used racial and ethnic categories to generate inequality and exclusion. It also addresses how individuals, social movements and institutions have at times worked to resist, challenge or modify these practices of categorization and exclusion.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC333H5 • Criminal Groups and Organizations", "description": "An analysis of the intersection between criminal groups and crime and organizations. This course introduces students to various organizational theories and examines how criminal groups and organizations form, crime by organizations, and crime that is \"organized\".", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC334H5 • Aging and Society", "description": "This course will examine (1) theoretical and empirical issues regarding demographic, economic, and social processes of aging as they affect individuals, families, and societies; (2) the variations in the process and meaning of aging across gender, ethnicity, and class; and (3) public policy issues concerning aging with regard to the process of public policy-making and effectiveness of relevant programs and services.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC335H5 • Political Sociology", "description": "This course will introduce students to the classic and contemporary view of political processes in small groups, organizations, institutions, communities and societies. Specific topics to be covered may include revolutions, state formation, ethnic nationalism, social capital and civic participation, gender politics, the various varieties, causes and effects of welfare states and social movements. The course will have both a Canadian and international focus.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC336H5 • Special Topics in Sociology", "description": "This course explores a particular area within sociology. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC337H5 • Special Topics in Criminology, Law and Society", "description": "This course will explore a particular area within criminology, law and society. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC338H5 • Legal Developments in Criminology", "description": "This course will survey new legal developments in the field of criminology and criminal law. It will explore the intersections between criminal law and other forms of regulation in society.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC339H5 • The Indian Act: Canadian Law, Sovereignty and Indigenous Womxn", "description": "In discussions about Indigenous Peoples and law, the Indian Act is one of the most cited pieces of Canadian legislation. From explaining the history of residential schooling to violence against Indigenous womxn, critical and Indigenous scholars turn to the Indian Act as a key source and problem space. We will center the work of Indigenous feminist scholarship to understand why scholars argue that the act is still both required and a site of contestation, violence, and genocide, and how we are each affected by its governance.", "prerequisites": "1.0 SSC credit"}, {"name": "SOC340H5 • Social Change", "description": "Understanding social transformation is at the heart of sociological inquiry. This course introduces students to the sociological analysis of social change - particularly how societies evolve into complex systems. The course examines how social, political and economic institutions are transformed by social change, as well as how these institutions can themselves promote social change. We also examine how citizens can affect change through social and political participation. In addition to classical foundations, the course covers a range of contemporary themes including inequality and stratification, social movements, globalization, and law and justice.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC341H5 • Contemporary Issues in the Sociology of Work", "description": "This course will focus on key changes in the world of work since the 1970s and their implications for different groups. We will engage different sides of debates about such issues as women in the workforce, recent immigrant and migrant workers, unions and mobility. Throughout the course, emphasis will be placed on how class, gender, ethnic and race relations shape work and occupations.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC342H5 • Sociology of Scandals", "description": "This course takes up scandals as sociological events: What are the causes of scandals? How are scandals 'made'? How are scandals represented? and What are the consequences of scandals? The course will pay attention to how scandals are made public: Leaks, investigations, whistleblowers, and media reporting, and the framing of events as scandals worth of public condemnation. To do so, this course will focus on scandals among professionals, in the private corporate sector and in government, domestically and worldwide, both current and past. By understanding scandals as sociological events, students will learn to trace how scandals may lead to new organizational, professional, social, cultural, and political responses.", "prerequisites": "SOC100H5 and 1.0 SOC credit at the 200 level"}, {"name": "SOC343H5 • Urban Sociology", "description": "The course will introduce students to the core and cutting-edge scholarship in urban sociology. We will discuss theories and empirical studies related to the issue of urban politics, including the issues of food, housing, gentrification, and neighborhood change. Despite the focus on Canadian and American cities, this course also highlights global and transnational perspectives, such as immigrant experiences, “ethnic” restaurants, and forces of globalization that are intricately tied to urban lives. This course aims to open this discussion about how we connect the micro-level of our social interactions, consumption, and daily lives to macro-levels of progress, global economic forces, politics and culture.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC344H5 • Sociological Approaches to Social Psychology", "description": "This course provides an overview of sociological approaches to social psychology, with an emphasis on how individuals' thoughts, behaviors, and emotions are influenced by both situations and larger social structures. Theoretical perspectives including symbolic interaction, group processes, and social structure and personality will be examined in depth and applied to understanding various topics; these may include self and identities, socialization, attitudes, emotions, deviance, mental health, and collective behavior.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC345H5 • Special Topics in Sociology", "description": "This course explores a particular area within sociology. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC346H5 • Special Topics in Criminology, Law and Society", "description": "This course will explore a particular area within criminology, law and society. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC347H5 • Sociology of Masculinities", "description": "In this course students will engage with foundational material on the intersections of gender, sex, and sexuality as they relate to masculinity. This includes foundational work on hegemonic masculinity and multiple masculinities.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC348H5 • Indigenous Rights, Resistance, and Resurgence", "description": "This course explores Indigenous people’s confrontations with colonization through an examination of rights-based processes, resistance movements, and community-led resurgence efforts. Topics may include: rights, courts, and legal action; land reoccupation; political organizing; everyday acts of resistance and resurgence such as petitioning, social media, arts-based movements, and community initiatives.", "prerequisites": "1.0 SSC credit"}, {"name": "SOC349H5 • Sociology of Food", "description": "Sociological analysis of food in global, regional and intimate contexts. It links cultural and structural aspects of the food system, historically and in the present. Students will investigate and report on inter-cultural food practices in Canada.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC350H5 • Quantitative Analysis", "description": "The course is a continuation ofSOC222H5(Measuring the Social World) ) and introduces students to more advanced applications of regression analysis. In addition to producing and interpreting regression models, this course also focuses on diagnostic tools for addressing outliers and multicolinearity, as well as regression with categorical independent variables and dependent variables (including a basic introduction to logistic regression). This course is mainly project based. Students will develop their own research questions and hypotheses and use statistical software to analyze data in order to provide evidence for their hypotheses. All students in the Sociology and Criminology, Law and Society Specialist programs are required to take this course.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC351H5 • Politics and Violence: Spot the Difference", "description": "This course aims to develop a critical approach to the study of violence. We will examine the linkages between politics and crime, between violence and democracy and the political context of specific forms of violence, such as vigilantism, state, collective and, structural violence.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC352H5 • Gender and Care", "description": "This course will examine how gender shapes the work of care, and its value in society. It will look at both unpaid and paid care and the relationship between them. It will compare how care is organized and it's value in different countries, and institutions (ranging from hospitals to homes) and consider care provided to children, elderly people and adults with disabilities. Contemporary topics include care from the recipient's perspective, and new efforts to value care work.", "prerequisites": "SOC100H5 and 1.0 SOC/WGS credit at the 200 level"}, {"name": "SOC353H5 • Borders and Human Rights", "description": "This course focuses on the legal construction of international borders, with an emphasis on human rights. The course investigates a range of issues, including but not limited to, the 1951 Refugee Convention and refugee movements, the limits of citizenship rights, and the merging of criminal justice and migration enforcement, including the use of detention as a migration management tool.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC354H5 • Global Sociology", "description": "Approaches to transnational networks, structures and processes, such as diasporic networks, transnational corporations, and social movements.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC355H5 • Sociology of the Professions", "description": "Becoming a professional (doctor, accountant, lawyer, engineer, nurse, etc...) remains a coveted goal for many young adults and their parents. But what is a profession, and what do these disparate groups have in common? This course lays the groundwork for understanding how the \"professional projects\" define professions, limit entry, create internal inequalities and try to maintain their prestige. The role of policy is key to our understanding of the professions, and we will focus on the role of policies in the creation of professions, in the substance of professional work such as ethics, autonomy and commercialism, and on the role of policies in addressing social concerns of inequality and diversity in the professions.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC356H5 • Population and Society", "description": "This course will discuss interrelationship between human population and societal issues such as aging, reproductive health, gender, environment, and social policy. It will examine population structure and dynamics in relation to social, economic, political, and cultural elements of change in both developing and developed world. It will also examine historical population policy developments and the diversified national policies in relation to policy formulation, implementation, and effectiveness.", "prerequisites": "SOC100H5 and 1.0 SOC credit at the 200 level"}, {"name": "SOC357H5 • The Legal Profession", "description": "This course introduces the legal profession from a sociological perspective. Focussing on the social structure of the legal profession, the course draws on the sociology of professions and the sociology of law and covers topics such as the creation of the profession, competition from inside and outside, historical and modern challenges to professional boundaries, and structural transformations and shifts. The course will provide examples from global legal professions. It does not teach how to think like a lawyer, nor does it provide the perspective of legal practitioners, but instead it provides social science perspectives for understanding how the legal profession is organized, differentiated, and transformed over space and time.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC358H5 • Indigenous People: Legal Orders and Law", "description": "This course examines Indigenous people's traditional and contemporary legal orders and confrontations and interactions with non-Indigenous legal systems. Topics may include: treaties; land and resource rights and laws; rights; self-government; governance; restorative justice; colonial legal systems; criminalization and criminal law; and/or international law.", "prerequisites": "1.0 SSC credit"}, {"name": "SOC359H5 • Gendered Identities", "description": "This course will focus on the production of gendered selves, femininity and masculinity, sexuality and sexual identities. We will draw from theoretical and empirical work in the sociology of gender and related disciplines, emphasizing the ways in which gender intersects with class, ethnicity, race, religion and other forces of difference in the production of identities.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC361H5 • Sociology of Organizations", "description": "This course examines the structure and culture of organizations, including the range of management cultures, and how relationships among unions, management, and employees are affected by the social structure and culture of both the employer and the union as organizations.", "prerequisites": "SOC100H5 and 1.0 SOC credit at the 200 level"}, {"name": "SOC362H5 • Sociology of Gender, Work, and Labour", "description": "This course will engage social theories to understand the gendered structure of work and labour. We will discuss gendered work and its intersections with race and ethnicity, im/migration, class, sexual orientation, geography, and time.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC363H5 • Sexuality and Crime", "description": "This course focuses on the socio-legal origins, regulations,and consequences of sexuality, reproduction, and sexual violence. Possible topics may include historical and contemporary sexual and reproductive regulations, sexual violence, sex offenders, sex work, pornography, trafficking, and hate crimes against sexual minorities.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC364H5 • New Directions in Social Inequality", "description": "This course reviews current ways of viewing and researching social inequality. Particular attention will be paid to how foundational work on social inequality connects to contemporary patterns, especially as demonstrated through current research.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC365H5 • Special Topics in Criminology", "description": "This course will explore a particular area within criminology. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC366H5 • Special Topics in Criminology", "description": "This course will explore a particular area within criminology. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC371H5 • Sociology of Punishment", "description": "Punishment cannot be analyzed outside of its historical, cultural, economic, political and social context. This course offers students a critical, multidisciplinary approach to the study of punishment in Canadian society.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC373H5 • Economic Sociology", "description": "How is the worth of an item determined? What do financialcrises reveal about social life? How do financial tradersmake decisions? Economic questions, and facts, areinherently sociological. This course teaches you to connectthe economy to society by examining a range ofphenomena that are more readily related to the economy,such as financial crises, CEO compensation, Silicon Valleyinnovation, markets and firms, but also those that are not,such as love, art, doormen, the organs of dead bodies, andnature. This course will emphasize how economictransactions create, legitimate, and transform socialrelations, how economic behaviour needs to be understoodwithin its social context, and how economic principlespermeate aspects of social life that seem to resist or lieoutside of the economic realm.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC375H5 • Sociology of International Migration", "description": "This course will analyze the forces that cause people to leave the country of their birth. We will look at why some countries become predominantly leaving countries, and other immigrant receiving countries. Possible topics include the politics of integration, multiple citizenships, refugee and settlement policies, the development of transnational social spaces and transnational governance structures. Attention will also be given to the dynamics of race, ethnicity, class, and gender in structuring international growth.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC378H5 • Law, Crime and Justice", "description": "This course draws on case law to explore a particular area within law and justice. Topics will vary from year to year.", "prerequisites": {"and": [{"and": [], "or": ["SOC109H5", "SOC209H5"]}, {"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC379H5 • Criminology, Urban Life, and Social Policy", "description": "The city is an important site of human interaction, characterized by crisis and promise. Through the lens of the city, this course will examine the nature of various social problems, including their causes and impacts. In particular, we will consider how criminological scholarship can analyze and inform policy responses to these issues. Course topics will include a diverse array of issues related to criminalization, youth justice, neighbourhood-level inequality, violence, and the criminal justice system.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC380H5 • Gender, Politics and Society", "description": "This course analyzes the social structural forces that produce gender and the ways in which gender affects political and social change. Possible topics include: migration, social movements, social policy and the welfare state, and globalization. We will also pay special attention to the ways in which gender intersects with class, ethnicity, race, religion and other forces of difference.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC382H5 • Genocide and Memory", "description": "This research-based course will engage students with the following two questions: Why does genocide happen? How do we construct, present, and maintain our memories of these terrible social phenomena? Students will spend the first part of the course learning about the sociology of genocide. Students will also be exposed to general theories of culture and the social construction of memory, and will be trained in qualitative methods, with a focus on basic field observation and field note writing. Students will take this knowledge and training into the field, using a sociological lens to look at genocide museums and memorials, and the people who visit them. The course will culminate in a final project based on the students' observations and analysis during one of several course field trips. The specific cultural and historical sites for the course will vary from year to year. As part of this course, students may have the option of participating in an international learning experience that will have an additional cost and application process. An interview may be required, with priority going to UTM Sociology and Criminology Majors and Specialists.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5"}, {"name": "SOC384H5 • Media Ethics and Policy: Controversies in Mass Communication", "description": "This course examines conflicts and controversies in the media. The goal of the course is to analyze power struggles within the realm of the media in order to understand how they both reflect and can reinforce broader social inequalities. Special emphasis is paid to the role of media policies and regulations. Topics include censorship, violence, pornography, marketing, social media and privacy.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC387H5 • Qualitative Analysis", "description": "This course surveys various qualitative methods sociologists use. Students gain insight into the craft of sociology through reading examples of the different qualitative methods, discussing the theories behind the methods, conducting hands-on research exercises and analyzing qualitative data. The objective of this course is to learn to design and conduct a qualitative research project and to analyze qualitative sociological data. All students in the Sociology and Criminology, Law and Society Specialist programs are required to take this course.", "prerequisites": {"and": [{"and": [], "or": ["SOC205H5", "SOC231H5"]}, "SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC388H5 •  Race and Indigeneity", "description": "This course examines how the concept of race, and the ideologies that inform it, impacts identity politics for Indigenous peoples. Special attention will be paid to the socio-cultural and legal effects of racialized knowledge production. Topics may include: human genome projects, museums, recognition politics, legal definitions, criminalization, access to resources, stereotypes and personhood.", "prerequisites": "1.0 SSC credit"}, {"name": "SOC391H5 • Independent Research in Sociology", "description": "This course is intended for Sociology Specialists and Majors who wish to explore a specific Sociology topic in depth. To enrol, a student must prepare a proposal form in consultation with a faculty supervisor and submit the approved form to the academic counsellor.Note: Professors have discretion whether to take on an independent study; they are not required to serve as faculty supervisors.", "prerequisites": "SOC221H5 and SOC222H5 and SOC231H5 and 3rd Year Standing and permission of instructor"}, {"name": "SOC392H5 • Independent Research in Sociology", "description": "This course is intended for Sociology Specialists and Majors who wish to explore a specific Sociology topic in depth. To enrol, a student must prepare a proposal form in consultation with a faculty supervisor and submit the approved form to the academic counsellor.Note: Professors have discretion whether to take on an independent study; they are not required to serve as faculty supervisors.", "prerequisites": "SOC221H5 and SOC222H5 and SOC231H5 and 3rd Year Standing and permission of instructor"}, {"name": "SOC393H5 • Independent Research in Criminology, Law and Society", "description": "This course is intended for Criminology, Law and Society Specialists and Majors who wish to explore a specific Criminology, Law and Society topic in depth. To enrol, a student must prepare a proposal form in consultation with a faculty supervisor and submit the approved form to the academic counsellor.Note: Professors have discretion whether to take on an independent study; they are not required to serve as faculty supervisors.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 3rd Year Standing and permission of instructor"}, {"name": "SOC394H5 • Independent Research in Criminology, Law and Society", "description": "This course is intended for Criminology, Law and Society Specialists and Majors who wish to explore a specific Criminology, Law and Society topic in depth. To enrol, a student must prepare a proposal form in consultation with a faculty supervisor and submit the approved form to the academic counsellor.Note: Professors have discretion whether to accept students wishing to pursue an independent studies course; they are not required to serve as faculty supervisors.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 3rd Year Standing and permission of instructor"}, {"name": "SOC399H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third or fourth year to work in the research project of a professor in return forSOC399H5course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "SOC221H5 and SOC222H5 and 3rd Year Standing and permission of instructor"}, {"name": "SOC399Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third or fourth year to work in the research project of a professor in return forSOC399Y5course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "SOC221H5 and SOC222H5 and 3rd Year Standing and permission of instructor"}, {"name": "SOC401H5 • Doing Public Sociology", "description": "In this seminar course, students learn to communicate insights based in sociological research to a broader audience, beyond the university. Student design and execute projects (essays, creating a podcast or video, and/or public speaking) on sociological topics of their choosing related to law and/or crime. The course also provides students with guidance on how to locate sociological research through library resources and how to incorporate that research into their public sociology projects. Priority may be given to Criminology, Law and Society students.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC402H5 • Understanding Human Action", "description": "This course addresses a fundamental question in the social sciences: \"Why do people do what they do?\" Readings and discussion focus on classic and current sociological approaches to understanding human action, giving attention to topics such as rational calculation, decisions, cultural processes, values, attitudes, identities, perception, interaction, situational influences, and automatic cognitive processing. A recurring theme is the tension between individual and situational explanations of behavior.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC403H5 • Prisons, Punishment & Surveillance Across the Globe", "description": "This seminar course will focus on possible solutions for issues related to prisons, punishment and surveillance across the globe. Along with this surveillance you have a rise in prisons and other forms of state sponsored punishment.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC404H5 • Special Topics in Social Policy", "description": "This lecture course will explore a particular area within Social Policy. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC405H5 • Surveillance in a Digital World", "description": "This course introduces students to theories of surveillance and risk in the digital era. The era of big data has given rise to smart policing, preventative security measures, and data driven solutions which are producing new knowledge about risk. It focuses on how surveillance is shifting institutional risk practices within law and criminal justice systems and how marginalized populations and particular geographical spaces are constructed as security risks.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level"}, {"name": "SOC406H5 • Vigilantism on the Margins of the State", "description": "This seminar examines the social problem of “vigilantism”. It focuses on how the act is defined in terms of scholarly works on punishment and policing, as well as mainstream popular opinion. The course looks at questions such as how vigilantism manifests in different geographic spaces (e.g. the “global north” and the “global south”), in rich and poor areas, and in different historical periods.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level"}, {"name": "SOC407H5 • Development and Social Change: The Case of China", "description": "This course introduces concepts, theories, and policies of development and underdevelopment. With China as a case, it focuses on social, economic, political, and cultural factors shaping the nature and meaning of social change.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC408H5 • The Sociology of Anti-Muslim Racism", "description": "This reading-intensive course explores historical and contemporary manifestations of anti-Muslim racism through a transnational lens, while paying special attention to scholarship from and about Canada and the United States. Issues related to gender and sexuality, race, citizenship status, Orientalism, colonialism, and military intervention cut across the readings.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC409H5 • Masculinity and the Internet", "description": "In this course we will take an in-depth look at a number of topics related broadly to masculinity and the internet, including such things as the “manosphere”, incels, and representations of masculinity on social media. These topics will be examined through the lens of the sociological literature on gender and masculinities. A recurring theme relates to the questions: “Is masculinity changing?” Students will be encouraged to critically examine and evaluate these topics and the sociological literature in multiple ways.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level"}, {"name": "SOC410H5 • Senior Seminar in Inequality", "description": "This course offers an in-depth examination of selected topics in the sociology of inequality.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC411H5 • Senior Seminar in Social Institutions", "description": "This course offers an in-depth examination of selected topics in the sociology of social institutions.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC412H5 • Senior Seminar in the Sociology of Work", "description": "This course offers an in-depth examination of selected topics in the sociology of work.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC413H5 • Senior Seminar in the Sociology of Gender", "description": "This course offers an in-depth examination of selected topics in the sociology of gender.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC414H5 • Senior Seminar in Political Sociology", "description": "This course offers an in-depth examination of selected topics in political sociology.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC415H5 • Senior Seminar in Indigenous Studies", "description": "This course offers an in-depth examination of selected topics in Indigenous Studies.", "prerequisites": "1.0 SSC credit, including 0.5 credit at the 300-level"}, {"name": "SOC416H5 • Senior Seminar in the Sociology of Culture", "description": "This course offers an in-depth examination of selected topics in the sociology of culture.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC417H5 • Senior Seminar in the Sociology of Globalization", "description": "This course offers an in-depth examination of selected topics in the sociology of globalization.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300-level and 4th Year Standing and permission of instructor"}, {"name": "SOC418H5 • Senior Seminar in the Sociology of Health", "description": "This course offers an in-depth examination of selected topics in the sociology of health.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC419H5 • Senior Seminar in Race and Ethnicity", "description": "This course offers an in-depth examination of selected topics in Race and Ethnicity.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC420H5 • Senior Seminar in Punishment", "description": "Restricted to Criminology, Law and Society Specialists and Majors. Topics vary from year to year and are noted on the timetable once confirmed.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC421H5 • Senior Seminar in Criminology", "description": "Restricted to Criminology, Law and Society Specialists and Major. Topics vary from year to year and are noted on the timetable once confirmed.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC422H5 • Sociology of the Body", "description": "The body is an inevitable part of our existence, but it has not always played a central role in sociology. This course aims to bring the body into sociology by drawing on multiple approaches to theorizing and researching the body as a fundamental element of social interactions. We will work to connect the body to power, social problems and diverse forms of exploitation, but we also examine how the body serves as a source of pleasure, joy, and resistance. Fundamentally, we will study the processes by which bodies are shaped, and in turn, shape our social life. Body topics that may be covered include, but are not limited to, the following: health and illness, fatness, fitness and sport, diet culture, taste, aging, disability, sexuality, beauty, cosmetic surgery, and eating disorders.", "prerequisites": {"and": ["SOC100H5", {"and": [], "or": ["SOC205H5", "SOC231H5"]}], "or": []}}, {"name": "SOC423H5 • Identity Crime", "description": "This interactive course concentrates on identity theft and fraud. It provides a critical examination of definitions of, sociological explanations for, and responses to identity crime. Identity crime is examined in the broader context of privacy, national security and organized crime.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level."}, {"name": "SOC424H5 • Law, Emotions and Justice", "description": "This course investigates emotional dynamics in law and justice. Topics will include public attitudes towards crime and punishment, the rights of victims in criminal proceedings, and restorative justice.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 credit of SOC credit at the 300 level"}, {"name": "SOC425H5 • Gender in Global Contexts", "description": "This lecture course looks at gender relations from a global perspective, focusing on how the social, political and economic aspects of globalization affect gender relations within various (local) contexts. Possible topics include gender and international migration, women's activism in local/global perspective and post-colonialism.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC426H5 • Social Theory and Third Cinema", "description": "This course is an exploration of the societies of Asia, Africa, and Latin America through films created by directors living and working in the Global South. Each week, we’ll pair a social theory reading with a film made in the Global South to explore themes of colonialism, political economy, race, class, gender, power, and history.", "prerequisites": {"and": ["SOC100H5", {"and": [], "or": ["SOC205H5", "SOC231H5"]}], "or": []}}, {"name": "SOC427H5 • Politics, Violence, Democracy and Human Rights in Latin America", "description": "This course examines the transnational, national and local historical, social and political contexts that produce, and is in turn affected by, criminal, state and other forms of violence in Latin America, and the challenges that this poses for the functioning of Latin American democracies and for the everyday life of people in the region, whose human and civil rights are frequently violated. Examples of transnational factors examined may include the legacies of the Cold War, the impact of the U.S. war on drugs, and the circulation of ideas about punishment throughout the hemisphere. We also contextualize the presence of violence into the historical and contemporary political and social realities of particular Latin American countries.", "prerequisites": "SOC100H5 and (SOC205H5 or SOC231H5)"}, {"name": "SOC428H5 • Health, Disability, and Crisis", "description": "This course will apply sociological theories of inequality, health, and disability to contemporary problems associated with economic and health crises, including the COVID-19 pandemic. This course integrates both quantitative and qualitative methods across substantive themes, providing an opportunity for students to link theories to data.", "prerequisites": {"and": ["SOC221H5", "SOC222H5"], "or": []}}, {"name": "SOC429H5 • Disability, Politics and Society", "description": "This course situates disability within a social and political context. We focus on how disability serves as a basis for exclusion from social, legal, political and economic institutions as well as the ways in which actors (policymakers, activists, etc.) have sought to undermine this system of discrimination. We will investigate a variety of related themes including the “social model of disability,” policy and judicial transformations, the evolution of the disability rights movement (including the use of legal mobilization), disability identity, intersectionality, and the future of disability politics and the law.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC430H5 • Developments in Sociological Theory", "description": "This course presents a discussion and in-depth analysis of strands in contemporary sociological theory from the 1920s to the present day. Topics may include race and ethnicity, gender, class, post-colonial theory, queer theory, intersectionality, symbolic interactionism, new institutionalism, post-structuralism, and culture.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300-level"}, {"name": "SOC431H5 • Museums & Indigenous Peoples", "description": "This seminar in Indigenous Studies focuses on the evolving relationship between Indigenous peoples and museums. It explores changes to museum policy and practice, the repatriation of Indigenous bodies, objects, and knowledges, the development of Indigenous museums, and the contributions of Indigenous artists to a new museology.", "prerequisites": "1.0 SSC credit, including 0.5 credit at the 300-level"}, {"name": "SOC432H5 • Contemporary Issues in Genocide and State Violence", "description": "This advanced lecture course will provide students with the analytical tools necessary to engage in deep analysis of contemporary genocides and state violence.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and SOC206H5 and 1.0 SOC credit at the 300 level."}, {"name": "SOC433H5 • Power and Cultural Politics", "description": "This lecture course will ask students to engage with classic and contemporary views on power and its relation to the social bases of politics and social movements.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC434H5 • Race, Class, Gender in the Global South", "description": "Three of the most fundamental cleavages in the contemporary world-economy are those between whites and people of colour, men and women, and capital and labour. This seminar course focuses on these cleavages and analyzes each through both an historical and global south perspective.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC435H5 • Sociology of Environmental Health", "description": "This course will examine environmental health with an emphasis on environmental justice, contested illness, and the politics of scientific knowledge production. We will study the politics of environmental health through case studies on activism in response to hazards, the tactics of corporate “product defense,” and the challenges of policy response.", "prerequisites": {"and": ["SOC100H5", {"and": [], "or": ["SOC205H5", "SOC231H5"]}], "or": []}}, {"name": "SOC436H5 • Colonies, Empires, Slavery & the Modern World", "description": "This course focuses on the origins, structure and role of modern colonialisms, empires, and slavery in the constitution of global modernity. Topics covered include the major debates about the legacy and ongoing effects of the various forms and types of colonialisms, empires, and slavery for the modern world.", "prerequisites": "1.0 SOC credit at the 300-level"}, {"name": "SOC437H5 • Mnidoo Mnising Indigenous Field School", "description": "This course operates within a nation-to-nation framework involving on-campus learning and a multi-day field component involving travel to First Nations communities. The land-based learning approach provides the opportunity to explore relationships to land, sovereignty, nationhood, rights, culture, resurgence, and resistance.", "prerequisites": "1.0 SSC credit including 0.5 credit at the 300-level"}, {"name": "SOC439Y5 • Research Project in Sociology", "description": "This is a seminar course where students engage in an independent research project supervised by a faculty member in Sociology. Students develop a research proposal, conduct independent research, analyze data and present findings. Admission by academic merit. Preference given to eligible Sociology Specialists.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 4th Year Standing and permission of instructor"}, {"name": "SOC440Y5 • Research Project in Criminology, Law and Society", "description": "This is a seminar course where students pursue advanced research supervised by a faculty member in Criminology, Law and Society. Students develop a research proposal, conduct independent research, analyze data and present findings. Admission by academic merit. Preference given to eligible Criminology, Law and Society Specialists.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 4th Year Standing and permission of instructor"}, {"name": "SOC444H5 • Advanced Topics in Sociology", "description": "An in-depth examination of selected topics in Sociology. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC445H5 • Advanced Topics in Sociology", "description": "An in-depth examination of selected topics in Sociology. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC446H5 • Advanced Topics in Criminology, Law and Society", "description": "An in-depth examination of selected topics in Criminology, Law and Society. Restricted to Criminology, Law and Society Specialists and Major. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level"}, {"name": "SOC447H5 • Advanced Topics in Criminology, Law and Society", "description": "An in-depth examination of selected topics in Criminology, Law and Society. Restricted to Criminology, Law and Society Specialists and Major. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level"}, {"name": "SOC448H5 • Advanced Topics in Criminology, Law and Society", "description": "An in-depth examination of selected topics in Criminology, Law and Society. Restricted to Criminology, Law and Society Specialists and Major. Topics vary from year to year and are noted on the timetable once confirmed. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level"}, {"name": "SOC450H5 • Walls to Bridges: Carceral Seminar", "description": "Based on the Walls to Bridges Program model, this seminar course matches a group of University of Toronto Mississauga students (\"outside\" students) with an approximately equal number of incarcerated students (\"inside\" students) who study together as peers at an off-campus setting. Topics vary from term to term. All class sessions are held inside the institution (e.g., penitentiary, detention centre, halfway house, etc.). Inside and outside students work together on small teams to develop and present a final project. Interested students should submit an application to the Department of Sociology (see website for details), and an interview may be required. Preference given to eligible Criminology, Law and Society Specialists and Majors.Note: Once students are accepted into this course a criminal record check (CPIC) may be required to access the offsite location for classes. Students are advised to schedule approximately seven hours for class time (to allow time sufficient time for travel, institution check-in and -out in addition to the seminar time).", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 4th Year Standing and permission of instructor"}, {"name": "SOC452H5 • Contemporary Issues in Higher Education", "description": "This course explores the debates and discussions centered on a selection of contemporary issues in postsecondary education in Canada and elsewhere. This may include topics such as the massification and corporatization of higher education, the reliance on sessional labour for instruction, and trends towards credentialism. The course combines instructor- and student-led discussions and inquiry.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC454H5 • Sociology of the Global South", "description": "This course examines the causes and consequences of empire, imperialism, and colonization to help better understand contemporary inequalities across the globe. The first part of the course focuses on theories of the Global South and the second part of the course applies those theories to the practice of social science research.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC455H5 • Comparative Indigenous Politics", "description": "Using a comparative approach, this course explores the politics of Indigeneity in settler colonial contexts. It centers critical analyses of settler colonialism and decolonization, and focuses on examples from Canada, the USA, New Zealand, and Australia to examine the differences and similarities between Indigenous peoples and politics in these places.", "prerequisites": "1.0 SSC credit, including 0.5 credit at the 300-level"}, {"name": "SOC456H5 • Senior Seminar in Law and Society", "description": "The course will examine substantive debates in law and society. Restricted to Criminology, Law and Society Specialists and Major. Topics vary from year to year and are noted on the timetable once confirmed.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level"}, {"name": "SOC457H5 • Sociology of Race and Ethnicity", "description": "This course offers an overview of some of the major theories and research programs in the sociology of race and ethnicity.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC459H5 • Science, Technology and Society", "description": "The focus of this lecture course will be on the varied social contexts of the emergence, development and consequences of science and technology in the modern world. In addition to critical sociological perspectives on science and technology, possible topics could include genomics, reproductive technologies, surveillance, the internet and social media, domestic technology, warfare, nuclear technologies, etc.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC460H5 • Migrant Labour", "description": "This lecture course will focus on the intersection of citizenship status and class by examining the position and experiences of various categories of migrant labour in North America, Europe and other regions. Migrant groups include those with temporary status who come to work for a specific time frame in a particular job, those with no status (the undocumented) who work mainly in an informal, unregulated economy, and immigrants with permanent resident status who work in a range of industries and occupations. We will read and write about theoretical and empirical work in the sociology of migration and related fields.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC463H5 • The Sociology of Disasters", "description": "The modern world leans heavily on the assumption that organizations run smoothly, but often they do not and sometimes the consequences are disastrous. This course draws on a variety of sociological theories and explanatory frameworks to better understand how any why large scale disasters occur. The class will investigate high risk technologies, issues and problems related to organizational culture, deviance and misconduct, community dynamics and resilience, environmental justice, and social problems related to racialization, gender, class, and other inequalities.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC465H5 • Climate Crisis and Society", "description": "In this course a variety of classical and contemporary sociological perspectives will be deployed to understand the social context, factors and consequences of climate change. Possible topics include the political economy of the environment, environmental refugees, environmental movements, media representations of climate change, the social context and consequences of fracking, the politics of global protocols on carbon emissions, climate justice and social inequality, etc.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 1.0 SOC credit at the 300 level"}, {"name": "SOC467H5 • Peel Social Lab Seminar: Translating Research for the Wider Public", "description": "This is a seminar course where students work on data from the Peel Social Lab to produce various media to translate sociological findings for a broader audience.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 4th Year Standing and permission of instructor"}, {"name": "SOC475H5 • Sociology of Legal Careers", "description": "This course examines legal careers from the sociological perspective. As one of the most elite and influential professions, lawyers are key players in economic, political, and social life. This course traces the various careers of lawyers from their experiences in law school to their jobs in law firms, courts, and other professional settings. In so doing the course will also focus on structures of inequality, such as gender, race and class.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level"}, {"name": "SOC480Y5 • Internship in Sociology, Criminology, Law and Society", "description": "Through a part-time, unpaid, 200-hour internship, students apply sociological knowledge gained primarily through previous coursework. Students can seek internship opportunities at municipal social service departments or non-profit agencies providing social services, social movement or community-based organizations working for social change, courts or parole offices, for-profit workplaces, or other organizations. This experiential learning course also includes class meetings, written assignments and oral presentations, as well as an assessment by the internship employer. An application/interview may be required (see Department of Sociology website for details).Note: International students should visit the International Education Centre to ensure they have the appropriate documentation required to work in Canada well before the start of the course/internship.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 4th Year Standing and minimum CGPA 3.0 and permission of instructor"}, {"name": "SOC485H5 • Investigation through Study Abroad", "description": "An in-depth examination of selected topics in sociology as part of a UTM Study Abroad experience. Topics vary from year to year and are noted on the timetable once confirmed. During the international experience, students will collect data and observations to use as the basis for a final analytical project. As part of this course, students will have the option of participating in an international learning experience that will have an additional cost and application process. An interview may be required, with priority given to Sociology and Criminology, Law and Society Specialists and Majors.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 4th Year Standing and minimum CGPA 3.0 and permission of instructor"}, {"name": "SOC491H5 • Independent Research in Sociology", "description": "This course is intended for Sociology Specialists and Majors who wish to explore a specific Sociology topic in depth. To enrol, a student must prepare a proposal form in consultation with a faculty supervisor and submit the approved form to the academic counsellor.Note: Professors have discretion whether to take on an independent study; they are not required to serve as faculty supervisors.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC492H5 • Independent Research in Sociology", "description": "This course is intended for Sociology Specialists and Majors who wish to explore a specific Sociology topic in depth. To enrol, a student must prepare a proposal form in consultation with a faculty supervisor and submit the approved form to the academic counsellor.Note: Professors have discretion whether to take on an independent study; they are not required to serve as faculty supervisors.", "prerequisites": "(SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC493H5 • Independent Research in Criminology, Law and Society", "description": "This course is intended for Criminology, Law and Society Specialists and Majors who wish to explore a specific Criminology, Law and Society topic in depth. To enrol, a student must prepare a proposal form in consultation with a faculty supervisor and submit the approved form to the academic counsellor.Note: Professors have discretion whether to take on an independent study; they are not required to serve as faculty supervisors.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300-level and 4th Year Standing and permission of instructor"}, {"name": "SOC494H5 • Independent Research in Criminology, Law and Society", "description": "This course is intended for Criminology, Law and Society Specialists and Majors who wish to explore a specific Criminology, Law and Society topic in depth. To enrol, a student must prepare a proposal form in consultation with a faculty supervisor and submit the approved form to the academic counsellor.Note: Professors have discretion whether to take on an independent study; they are not required to serve as faculty supervisors.", "prerequisites": "(SOC109H5 or SOC209H5) and (SOC205H5 or SOC231H5) and SOC221H5 and SOC222H5 and 0.5 SOC credit at the 300 level and 4th Year Standing and permission of instructor"}, {"name": "SOC499H5 • Research Opportunity Program", "description": "This course provides a rewarding opportunity for students in their fourth year to undertake relatively advanced work in the research project of a professor in return forSOC499H5course credit. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "SOC221H5 and SOC222H5, 4th Year Standing and permission of instructor"}, {"name": "SOC499Y5 • Research Opportunity Program", "description": "This course provides a rewarding opportunity for students in their fourth year to undertake relatively advanced work in the research project of a professor in return forSOC499Y5course credit. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "SOC221H5 and SOC222H5 and 4th Year Standing and permission of instructor"}]