[{"name": "SPA219H5 • Spanish for Heritage and Native Speakers I", "description": "This course is designed for heritage and native speakers with little to no knowledge of written Spanish who have basic to fluent speaking and comprehension abilities. The course provides foundations in understanding the Spanish grammatical system, opportunities to increase vocabulary and to develop writing skills and the ability to use the language across different contexts including in more formal situations. Students MUST complete the Spanish Language Assessment Questionnaire before enrolling in this course. Please visithttps://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnaires", "prerequisites": "As determined by the Spanish Language Assessment (https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}, {"name": "SPA220Y5 • Intermediate Spanish", "description": "Intermediate Spanish for non-natives. Intensive grammar review of the structures of Spanish integrated with an introduction to reading authentic Spanish material, with practice designed to build vocabulary and to improve oral and written expression. As part of this course, students may have the option of participating in an international learning experience that will have an additional cost and application process.", "prerequisites": {"and": [], "or": ["SPA100Y5", "SPA100Y1"]}}, {"name": "SPA235H5 • Music and Dance in Hispanic Culture", "description": "This course will explore the heritage and the modern manifestations of some Latin American, Caribbean, and Spanish musical styles and their accompanied dance forms. This course highlights the historical evolution of several prominent genres of music and dance, the place of music and dance in modern culture and their contribution in national identity and shows how European colonization and the slave trade impact on indigenous sounds and rhythms. The course is organized thematically and geographically and will be taught in English. Students who take this course for Spanish Language Citation must complete written course work in Spanish. As part of this course, students may have the option of participating in an international learning experience that will have an additional cost and application process.", "prerequisites": "Open to all students."}, {"name": "SPA259H5 • Introduction to Hispanic Culture", "description": "Forms of cultural expression in Spain, Latin America and Spanish-speaking North America, with study of representative media, including literature, journalism, film, visual art, and the urban environment. Introduction to methods of cultural analysis.", "prerequisites": "SPA100Y5"}, {"name": "SPA275H5 • Latin American Cinema", "description": "A survey of Latin American cinema, analyzed within historical, social, political, and cultural contexts. Aesthetic and social forms and questions of identity will also be studied. Throughout the course, the cinema of various Spanish speaking nations, regions, and historical periods will be highlighted. The course is taught in English. Students who take this course for Spanish Language Citation must complete written course work in Spanish.", "prerequisites": "SPA100Y5"}, {"name": "SPA305H5 • Spanish for Business and Media", "description": "An intermediate level Spanish course focusing on topics and language related to professional and media spheres. Students will work with language appropriate for the workplace, newsprint, and online media, as well as financial and diplomatic institutions. Topics studied will include foreign affairs, business, advertisement, and the geopolitics of Spain, Latin and North America. Students will gain literacy and intercultural skills, as well as critical thinking skills through the study of workplace culture, newsprint and social media, current and historical political events. Writing practice may include letters, CVs, opinion pieces, as well as social media posts.", "prerequisites": "SPA220Y5 or permission of the department."}, {"name": "SPA319H5 • Spanish for Heritage and Native Speakers II", "description": "This course is designed for heritage and native speakers with solid reading and writing abilities in Spanish as well as fluent speaking and listening skills. The course provides opportunities to develop a complex Spanish grammatical system as well as opportunities to increase vocabulary, and develop writing skills and the ability to use the language across different contexts including in more formal situations.", "prerequisites": "As determined by the Spanish Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment…)."}, {"name": "SPA320Y5 • Advanced Spanish", "description": "Advanced Spanish for non-natives. Selective review of grammar with emphasis on the complex sentence; intensive practice in written and oral expression to improve proficiency. As part of this course, students may have the option of participating in an international learning experience that will have an additional cost and application process.", "prerequisites": "SPA220Y5"}, {"name": "SPA323H5 • Business Spanish", "description": "Practical uses of spoken and written Spanish for business contexts. This course builds on grammar and vocabulary knowledge already acquired at the intermediate level.", "prerequisites": "SPA220Y5"}, {"name": "SPA390H5 • Cross-cultural Communication and Pragmatics in the Spanish-speaking World", "description": "The course introduces students to the different ways in which speakers communicate across the diverse Spanish-speaking world. Students will analyze how culturally defined politeness, social norms, and speaker identities impact how language is used in diverse Spanish-speaking countries. Students will also explore, identify, and solve problems resulting from cultural differences between Spanish and other languages. Furthermore, students will develop pragmatic competence in Spanish and will compare variation in pragmatic norms among different Spanish-speaking communities.", "prerequisites": "SPA220Y5"}, {"name": "SPA420H5 • Advanced Topics on Spanish Grammar", "description": "Study of traditional topics of Spanish grammar from a linguistic perspective with the goal of improving students’ knowledge and usage of Spanish grammar and language understanding in general. Topics include (but are not limited to): word order variation patterns, subject types, the verbal system, and the Spanish copulas. This course employs a cross-linguistic approach, as some of these topics are discussed from a comparative perspective. This course is taught in Spanish.", "prerequisites": "SPA219Y5 or SPA320Y5 or as indicated by Spanish Language Assessment Questionnaire (https://www.utm.utoronto.ca/language-studies/language-course-assessment-questionnaires)."}, {"name": "SPA443H5 • Studies in Spanish Linguistics: Pragmatics", "description": "This course introduces students to the discipline of linguistics through a focus on Spanish- speaking communities and the linguistic diversity amongst them. This advanced task-based course focuses on developing students’ pragmatic competence in Spanish, or the ability to use the language appropriately in different social contexts. To do so, students will analyze how culturally confined politeness norms, contextual elements, and speakers’ identities impact how language is used to carry out different speech acts such as requests, invitations, and apologies, among others, and will compare variation in pragmatic norms among different Spanish-speaking communities.", "prerequisites": "SPA320Y5 or (SPA219Y5 and permission of the instructor)"}]