[{"name": "STA221H5 • The Practice of Statistics II", "description": "A sequel toSTA220H5, emphasizing major methods of data analysis such as analysis of variance for one factor and multiple factor designs, regression models, categorical and non-parametric methods.", "prerequisites": {"and": [], "or": ["STA215H5", "STA220H5"]}}, {"name": "STA246H5 • Computational Probability and Statistics", "description": "This course covers probability including its role in statistical and computational modeling. Topics include classical and computational perspectives on cumulative, mass and distribution functions, random variables, expectation, limiting results, the normal distribution. Computational topics include generating and sampling random numbers, combinatorial objects and probability functions for simulation and statistical analysis. Additional techniques include resampling, hypothesis testing, model fit and cross validation. IMPORTANT NOTE:STA246H5will not be permitted as a pre-requisite for any other 200+ level STA courses. In addition,STA246H5cannot count towards any program(s) in Mathematics or Applied Statistics. The course is intended only for students in Computer Science programs who will not needSTA256H5for other program requirements.", "prerequisites": "CSC148H5 and (MAT134H5 or MAT134Y5 or MAT135Y5 or MAT136H5 or MAT137Y5 or MAT139H5 or MAT157Y5 or MAT159H5 or a minimum 65% in MAT133Y5)"}, {"name": "STA256H5 • Probability and Statistics I", "description": "This course covers probability including its role in statistical modeling. Topics include probability distributions, expectation, discrete and continuous random variables and vectors, distribution functions, distributions of functions of random variables, limit theorems, the central limit theorem.", "prerequisites": "MAT134H5 or MAT136H5 or MAT137Y5 or MAT139H5 or MAT157Y5 or MAT159H5 or a minimum 65% in MAT133Y5"}, {"name": "STA258H5 • Statistics with Applied Probability", "description": "A survey of statistical methodology with emphasis on the relationship between data analysis and probability theory. Topics covered include descriptive statistics, limit theorems, sampling distribution, point and interval estimation, hypothesis testing, contingency tables and count data, simple linear regression. A statistical computer package will be used.", "prerequisites": "STA256H5"}, {"name": "STA260H5 • Probability and Statistics II", "description": "A sequel toSTA256H5introducing current statistical theory and methodology. Topics include: Sampling distributions, point estimation, confidence intervals, testing (Neyman-Pearson Theorem, uniformly most powerful test, likelihood ratio tests), unbiasedness, consistency, sufficiency, complete statistics, and exponential family; Fisher Information and the Cramer-Rao inequality; simple linear models.", "prerequisites": {"and": [], "or": ["STA256H5", "ECO227Y5"]}}, {"name": "STA302H5 • Regression Analysis", "description": "Analysis of the multiple regression model by least squares; statistical properties of the least square analysis, including estimation of error; residual and regression sums of squares; distribution theory under normality of the observations; confidence regions and intervals; tests for normality; variance stabilizing transformations, multicolinearity, variable search methods.", "prerequisites": {"and": ["STA260H5", {"and": [], "or": ["MAT223H5", "MAT240H5"]}], "or": []}}, {"name": "STA304H5 • Surveys, Sampling and Observational Data", "description": "The sample survey is a widely used technique for obtaining information about a large population at relatively small cost. Only probability samples can provide both an estimator and a measure of sampling error from the data itself. In addition to sampling error, non-sampling errors (refusals, not-at-home, lies, inaccuracies, etc.) are always present, and can produce serious biases. The course covers: design of surveys, sources of bias, randomized response surveys. Techniques of sampling; stratification, clustering, unequal probability selection. Sampling inference, estimates of population mean and variances, ratio estimation, observational data; correlation vs. causation, missing data, sources of bias.", "prerequisites": {"and": [], "or": ["STA258H5", "STA260H5", "STA238H1", "STA255H1", "ECO227Y5"]}}, {"name": "STA305H5 • Experimental Design", "description": "This course covers topics in the design and analysis of experiments. The topics covered include analysis of variance, randomization, confounding, block designs, factorial designs, orthogonal polynomials and response surface methods. Applications include agricultural experiments, laboratory experiments, and industrial experiments, including quality control techniques.", "prerequisites": {"and": [], "or": ["STA302H5", "ECO375H5"]}}, {"name": "STA312H5 • Topics in Statistics", "description": "Introduction to a topic of current interest in statistics. Content will vary from year to year. Computer packages are used. The contact hours for this course may vary in terms of contact type (L, T) from year to year, but will be between 36-48 contact hours in total. See the UTM Timetable.", "prerequisites": "Appropriate prerequisite requirement(s) will be available on the UTM timetable along with the topic title prior to course registration."}, {"name": "STA313H5 • Topics in Statistics", "description": "Introduction to a topic of current interest in statistics. Content will vary from year to year. Computer packages are used. The contact hours for this course may vary in terms of contact type (L, T) from year to year, but will be between 36-48 contact hours in total. See the UTM Timetable.", "prerequisites": "Appropriate prerequisite requirement(s) will be available on the UTM timetable along with the topic title prior to course registration."}, {"name": "STA314H5 • Introduction to Statistical Learning", "description": "A thorough introduction to the basic ideas in supervised statistical learning with a focus on regression and a brief introduction to classification. Methods covered will include multiple linear regression and its extensions, k-nn regression, variable selection and regularization via AIC,BIC, Ridge and lasso penalties, non-parametric methods including basis expansions, local regression and splines, generalized additive models, tree-based methods, bagging, boosting and random forests. Content will be discussed from a statistical angle, putting emphasis on uncertainty quantification and the impact of randomness in the data on the outcome of any learning procedure. A detailed discussion of the main statistical ideas behind crossvalidation, sample splitting and re-sampling methods will be given. Throughout the course, R will be used as software, a brief introduction will be given in the beginning.", "prerequisites": {"and": [{"and": [], "or": ["MAT223H5", "MAT240H5"]}, {"and": [], "or": ["STA258H5", "ECO375H5"]}, "STA260H5"], "or": []}}, {"name": "STA315H5 • Advanced Statistical Learning", "description": "The second part of the course will focus on basic ideas in classification problems including discriminant analysis and support vector machine, and unsupervised learning techniques such as clustering, principal component analysis, independent component analysis and multidimensional scaling. The course will also cover the modern statistics in the \"big data\" area. The high dimensional problems when p >> n and n >> p will be introduced. In addition, the students will be formed as groups to do data analysis projects on statistical machine learning and present their findings in class. This will prepare them for future careers in industry or academia.", "prerequisites": "STA314H5"}, {"name": "STA348H5 • Introduction to Stochastic Processes", "description": "Discrete Markov chains with a finite number of states, random walks, single-server queues, continuous-time Markov chains, Poisson processes, branching processes, birth and death process, M/M/n queues, Monte-Carlo simulation may be introduced.", "prerequisites": {"and": [{"and": [], "or": ["STA260H5", "STA238H1", "ECO227Y5"]}, {"and": [], "or": ["MAT223H5", "MAT240H5"]}], "or": []}}, {"name": "STA360H5 • Introduction to Bayesian Statistics", "description": "A thorough introduction to statistics from a Bayesian perspective. Methods covered will include: the rules of probability, including joint, marginal, and conditional probability; discrete and continuous random variables; discrete and continuous random variables; Bayesian inferences for means and proportions; the simple linear regression model analyzed in a Bayesian manner; and (time permitting) a brief introduction to numerical methods such as the Gibbs sampler. Throughout the course, R will be used as software, a brief introduction will be given in the beginning.", "prerequisites": {"and": [], "or": ["STA258H5", "STA260H5", "ECO227Y5", "STA238H1", "STA255H1", "ECO227Y1"]}}, {"name": "STA378H5 • Statistics Research Project", "description": "Students explore a topic in statistics under the supervision of a faculty member. Interested students must consult with statistics faculty at least two months prior to registration, to determine the topic and scope.", "prerequisites": "(STA260H5 or STA261H1 or STAB57H3) and (permission of instructor and department) and a minimum CGPA of 3.0."}, {"name": "STA380H5 • Computational Statistics", "description": "Computational methods play a central role in modern statistics and machine learning. This course aims to give an overview of some of the computational techniques that are useful in statistics. Topics include methods of generating random variables, Monte Carlo integration and variance reduction, Monte Carlo methods in inference, bootstrap and jackknife, resampling application, permutation tests, probability density estimation, and optimization.", "prerequisites": {"and": [], "or": ["STA260H5", "STA238H1"]}}, {"name": "STA388H5 • Topics in Statistics", "description": "Introduction to a topic of current interest in statistics. Content will vary from year to year. The contact hours for this course may vary in terms of contact type (L, T) from year to year, but will be between 36-48 contact hours in total. See the UTM Timetable.", "prerequisites": "Appropriate prerequisite requirement(s) will be available on the UTM timetable along with the topic title prior to course registration."}, {"name": "STA398H5 • Statistics Research Project", "description": "Students explore a topic in statistics under the supervision of a faculty member. Interested students must consult with statistics faculty at least two months prior to registration, to determine the topic and scope.", "prerequisites": "(STA260H5 or STA261H1 or STAB57H3) and (permission of instructor and department) and a minimum CGPA of 3.0."}, {"name": "STA399H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third or fourth year to work in the research project of a professor in return for 399H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeResearch Opportunity Program (ROP)for more details.", "prerequisites": "(STA260H5 or STA261H1 or STAB57H3) and (permission of instructor and department) and a minimum CGPA of 3.0."}, {"name": "STA399Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third or fourth year to work in the research project of a professor in return for 399Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeResearch Opportunity Program (ROP)for more details.", "prerequisites": "(STA260H5 or STA261H1 or STAB57H3) and (permission of instructor and department) and a minimum CGPA of 3.0."}, {"name": "STA413H5 • Estimation and Testing", "description": "This course covers advanced topics in probability and mathematical statistics. Topics include convergence in probability, convergence in distribution, and convergence with probability one, sufficiency, completeness, Rao-Blackwell and Lehmann-Sheffe theorems, and asymptotics.", "prerequisites": "STA260H5"}, {"name": "STA431H5 • Structural Equation Models", "description": "Random vectors and matrices, univariate and multivariateregression with measurement error, latent variables, modelidentification, the LISREL model, path analysis,confirmatory factor analysis, longitudinal data analysis,robustness of the normal model. A statistical computingpackage will be used.", "prerequisites": {"and": [], "or": ["STA302H5", "STA302H"]}}, {"name": "STA437H5 • Applied Multivariate Statistics", "description": "Practical techniques for the analysis of multivariate data; fundamental methods of data reduction with an introduction to underlying distribution theory; basic estimation and hypothesis testing for multivariate means and variances; regression coefficients; principal components and the partial multiple and canonical correlations; multivariate analysis of variance; profile analysis and curve fitting for repeated measurements; classification and the linear discriminant function. There will be extensive use of statistical computing packages.", "prerequisites": {"and": [], "or": ["STA302H5", "ECO375H5"]}}, {"name": "STA441H5 • Data Analysis", "description": "Vocabulary of data analysis, Tests of statistical significance, Principles of research design, Applications of statistical methods such as Multiple regression, Factorial ANOVA, Mixed linear models, Multivariate analysis of variance, Repeated measures, Logistic regression, Generalized linear models, Permutation tests and Bootstrapping.", "prerequisites": {"and": [], "or": ["STA221H5", "STA302H5", "BIO360H5", "ECO375H5", "GGR376H5", "PSY202H5", "SOC350H5", "STA302H1", "STAC67H3"]}}, {"name": "STA457H5 • Applied Time Series Analysis", "description": "This course develops the theory and methodology for the statistical analysis of time series. The methods may be broadly characterized as time domain methods based on correlation (Box-Jenkins), or frequency domain methods based on a decomposition of the series into cycles (Fourier). The course develops both of these to the point where they may be applied using standard statistical software. Model identification, estimation and forecasting are discussed. Applications in social and physical sciences are used.", "prerequisites": {"and": [], "or": ["STA302H5", "ECO375H5"]}}, {"name": "STA478H5 • Statistics Research Project", "description": "Students explore a topic in statistics under the supervision of a faculty member. Interested students must consult with statistics faculty at least two months prior to registration, to determine the topic and scope.", "prerequisites": "(STA302H5 or STA302H1 or STAC67H3) and (permission of instructor and department) and a minimum CGPA of 3.0."}, {"name": "STA488H5 • Topics in Statistics", "description": "Introduction to a topic of current interest in statistics. Content will vary from year to year.The contact hours for this course may vary in terms of contact type (L, T) from year to year, but will be between 36-48 contact hours in total. See the UTM Timetable.", "prerequisites": "Appropriate prerequisite requirement(s) will be available on the UTM timetable along with the topic title prior to course registration. "}, {"name": "STA498H5 • Statistics Research Project", "description": "Students explore a topic in statistics under the supervision of a faculty member. Interested students must consult with statistics faculty at least two months prior to registration, to determine the topic and scope.", "prerequisites": "(STA302H5 or STA302H1 or STAC67H3) and (permission of instructor or department) and a minimum CGPA of 3.0."}, {"name": "STA499H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third or fourth year to work in the research project of a professor in return for 499H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeResearch Opportunity Program (ROP)for more details.", "prerequisites": "(STA302H5 or STA302H1 or STAC67H3) and (permission of instructor or department) and a minimum CGPA of 3.0."}]