[{"name": "CCT110H5 • Rhetoric and Media", "description": "This course critically examines the written, visual, aural, and dynamic rhetoric as it pertains to communications for academic and other purposes across a range of digital and interactive media discourses.", "prerequisites": "CCT109H5"}, {"name": "CCT111H5 • Critical Coding", "description": "This experiential learning course introduces students to the practice and theory of coding, programming, and basic development of user-oriented software. The lectures illustrate a core range of software development concepts that provide the foundations needed for the practical coding of front-end applications such as mobile interfaces or of back-end software such as introductory artificial intelligence or social media analysis. The practicals are lab-based and focus on applying these theoretical skills to solving problems grounded in a critical understanding of the interaction between people, culture, and society, by developing software or apps in languages such as Java, Objective C, Swift, Python.", "prerequisites": "CCT109H5"}, {"name": "CCT112H5 • Foundations of Management", "description": "This course introduces students to the foundational principles and analytical tools from the management discipline in link with today’s economic and technological advancements. Particular emphasis is given to the interconnections between information and communications technologies, innovation, the role of managers and their decision-making processes, and related social, cultural, and economic institutions.", "prerequisites": "CCT109H5"}, {"name": "CCT200H5 • Race, Media and Culture", "description": "This course provides an introduction to the intersecting fields of critical race, media, and cultural studies. We will pay particular attention to dynamics of social difference and power and the communication strategies and technologies through which these are navigated, reproduced and interrupted. Students will be introduced to critical and analytical tools for understanding the cultural and media circulation, regulation and reimagination of things like race, sexuality, time, gender, class, indigeneity, space, ethnicity, ability and nationality. These critical tools equip students with the skills to write, design and build ethical innovations in new media and culture.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT202H5 • Human-Machine Communication", "description": "From voice responsive cars and virtual assistants to social robots and smart toys, people are increasingly interacting with communicative technologies in their daily lives. In this course students will consider the implications of this evolution in communication practice – informing design, ethics, efficacy, privacy, and other implications. Human-machine communication is a specific area of study within communication encompassing human-computer interaction, human-robot interaction, and human-agent interaction.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT203H5 • Business Research Methods", "description": "This course provides an introduction to research design, conduct, and analysis for making informed business decisions. The course will focus on basic methodologies, qualitative and quantitative methods, data sources, reliability, validity, and other measurement issues, data collection and research design, ethics in research, and report writing and presentation.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT204H5 • Design Thinking I", "description": "An introduction to the basic concepts and skills of design thinking as an interdisciplinary subject. Emphasizes creative and critical thinking in the design process; provides the student with the theory and operational skills necessary to solve design problems in the realms of symbolic and visual communication, material objects, environments, and organized services and activities.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT205H5 • Digital Innovation and Cultural Transformation", "description": "This course examines a range of theoretical perspectives and worldviews that assess the cultural and social changes brought about by modern technology. These perspectives will be used to analyze the potential problems initiated by the introduction of digital and computing technologies to various contexts. Possible topics include: cybernetics; media convergence; artificial intelligence/life; smart technology; digital environmentalism and digital warfare.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT206H5 • Law, Technology and Culture", "description": "This course will provide a detailed review of copyright, trademark and patent law with a special emphasis on how they apply to digital media. This course will also review the law of contract as it applies to digital industries and investigate the relevant tort law. In addition, other regulatory issues will be discussed such as telecommunications and broadcasting law both from a Canadian and an international perspective.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT208H5 • Communications Research Methods", "description": "This course is a survey of research methodologies in the field of communication and media. A central goal of the course is to train students how to critically assess methods commonly used in social science research. Students will also become familiar with how to properly collect and interpret quantitative and qualitative social science research data.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT210H5 • Signs, Referents, and Meaning", "description": "How written or spoken statements, gestures, and aesthetic objects come to have meanings. How we recognize and fail to recognize such meanings. The nature, systems, and processes of interpretation. The role of mental models.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT211H5 • Fundamentals of User Interface Programming", "description": "This experiential learning course introduces students to the practice and theory of coding, programming, and development of user interfaces. The lectures illustrate an advanced range of software development concepts needed for the practical coding of user interfaces across a variety of devices. The practicals are lab-based and focus on applying these theoretical skills to design, implementation, and testing of user interface software components. Students will have the opportunity to acquire project management and software engineering skills Scrum, Agile), programming languages (Java, Javascript, Objective C, Swift, and other mobile and web programming languages), and evaluation methodologies (unit testing, bug tracking).", "prerequisites": {"and": ["CCT109H5", "CCT110H5", "CCT111H5"], "or": []}}, {"name": "CCT212H5 • Coding Cultures", "description": "This course introduces students to the critical study of computing and its interaction with culture and society. It examines how relations between humans and technology create different kinds of technocultures. Students will explore contemporary technologies from both a technical and cultural/historical point of view, focusing on the labour of coding, the materiality of software code, the role of intellectual property, and the cultures that sustain and arise from digital media production.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT218H5 • Foundations of Media and Technology Studies", "description": "An introduction to foundational theories for studying the relationship between media, technology and society. The course presents technology as a social practice and considers a wide variety of concepts and methods for studying its cultural and political significance.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT219H5 • Media Economics I", "description": "This course presents economic principles that explain how markets help organize exchange and production among competing but nevertheless cooperating economic units. Theories of consumer demand, the economic nature and function of business firms, optimal business decision rules of monopoly, oligopoly, and anti-combines regulations, as well as game theory, are presented. Efficiency criteria pertaining to the operation of firms and markets, the role of property rights, and the scope for public policy, are also examined.", "prerequisites": {"and": ["CCT109H5", "CCT110H5", "CCT112H5"], "or": []}}, {"name": "CCT221H5 • Digital Marketing I", "description": "Techniques for developing a comprehensive marketing strategy will be developed with particular emphasis on digital products and services. The nature of digital markets, approaches to advertising, pricing and such areas as versioning will also be discussed.", "prerequisites": {"and": ["CCT109H5", "CCT110H5", {"and": [], "or": ["CCT111H5", "CCT112H5"]}], "or": []}}, {"name": "CCT222H5 • Political Economy of Communication, Culture, and Technology", "description": "The course analyzes the relationship between media systems, communication technologies, and power. As an introduction to a political economy approach, this course surveys how media, culture, information and technologies are produced, circulated, and consumed, with attention to both historical developments and contemporary practices in the digital era. The course provides a basic understanding of media systems, technologies, and culture production in relation to the market, the state, and civil society. Students will develop a basic understanding of the political, economic, cultural, and regulatory environment in which media, culture, and technologies are produced, and pay particular attention to the implications of processes such as globalization, digitization, marketization, and commodification for social life.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT224H5 • Organizational Studies I", "description": "This course provides a comprehensive overview of the activities and processes that take place in organizations. Major emphasis is placed on the investigation of the varied measures that can be developed to assess and subsequently improve the performance of the organization. The interpretation of measures in managerial decision-making will also be investigated in detail.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT225H5 • Information Systems", "description": "This course has been designed to provide students with a basic understanding of the role of computers and communication systems in modern organizations. Unlike programming courses, the focus here is on the application of computer-based systems to support information requirements for problem solving and managerial decision-making. Topics include concepts of information, humans as information processors, survey of hardware and software applications, introduction to information systems analysis and design.", "prerequisites": "CCT224H5"}, {"name": "CCT226H5 • Data Analysis I", "description": "This course introduces students to the basic tools of data analysis, most particularly statistics and modeling. Students are introduced to basic principles of descriptive and inferential statistics with a focus on the types of data that they will typically encounter in a digital environment.", "prerequisites": {"and": ["CCT109H5", "CCT110H5", {"and": [], "or": ["CCT111H5", "CCT112H5"]}], "or": []}}, {"name": "CCT250H5 • Foundations of Digital Design and Production", "description": "Advances in technology have provided users ready access to empowering technologies enabling creative and enterprise digital production. This course provides hands-on skills on critical design and production suites and platforms used across industries and disciplines, centred on the development of industry-standard creative design.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT260H5 • Web Development and Design I", "description": "This course will explore foundational techniques of web development and design in the context of human-centred technologies, and design of experiences, interfaces and interactions. Topics include development of semantic web properties using contemporary programming techniques; standards-based design of responsive accessible systems; and production of rich media for online displays.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT261H5 • Speculative Design I", "description": "This introductory course in information architecture is a foundation of user interface design. Information architects work in organizations to design interfaces that enable users to find and navigate complex data via technology. Using architectural and design concepts to create and organize user-friendly information structures, this course includes exploring theories and hands-on practice with information organization, structure, categorization, representation, navigation and modeling.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT270H5 • Principles in Game Design", "description": "This course will address the principles and methodologies behind the rules and play of games. It will foster a solid understanding of how games function to create experiences, including rule design, play mechanics, game balancing and the integration of visual, tactile, audio, and textual components into games.", "prerequisites": {"and": ["CCT109H5", {"and": [], "or": ["CCT110H5", "ENG110H5"]}], "or": []}}, {"name": "CCT273H5 • Professional Practice and Communication", "description": "This professional practice course provides students with basic skills in professional communication, acumen, and problem solving that will help them develop personally and professionally.", "prerequisites": "70% in CCT110H5 or (WRI173H5 or WRI203H5)."}, {"name": "CCT285H5 • Immersive Environment Design", "description": "Students will develop skills in the areas of bitmap/vector graphics, audio/visual production and editing, 2D/3D modeling and animation, and video game design. Students will produce immersive environments while addressing and engaging issues of remix culture and intellectual property.", "prerequisites": {"and": ["CCT109H5", {"and": [], "or": ["CCT110H5", "ENG110H5"]}], "or": []}}, {"name": "CCT286H5 • Interactive Media Design", "description": "This course provides students with the opportunity to learn the skills necessary to produce responsive web content. Students will develop skills in the areas of website design, interactive and animated web content, mobile app development, and mobile game development.", "prerequisites": {"and": ["CCT109H5", {"and": [], "or": ["CCT110H5", "ENG110H5"]}, "CCT285H5"], "or": []}}, {"name": "CCT295H5 • Topics in Communication, Culture, Information and Technology", "description": "An in depth examination of selected topics in communication, culture, information and technology. Topics vary from year to year, and the content in any given year depends on the instructor. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT300H5 • Critical Analysis of Media", "description": "This course offers an overview of critical theoretical concepts and applies them to contemporary media. Students will use concepts from social theory, media studies and technology studies to critically analyze the many facets of the evolution and pervasiveness of digital media.", "prerequisites": {"and": [], "or": ["CCT210H5", "CCT218H5"]}}, {"name": "CCT301H5 • Design for Online Cultures", "description": "This course builds upon the concepts introduced inCCT218H5, Introduction to Digital Culture, through an exploration of the design and development of online information services (e.g. websites, digital libraries). It examines the standards, modeling approaches, and methods for testing. Students will experiment with different approaches to design of websites or other online services for different types of delivery devices (e.g. desktops, mobiles).", "prerequisites": "CCT218H5"}, {"name": "CCT302H5 • Developing and Managing Communication Campaigns and Projects", "description": "Communication campaigns and projects, whether they involve marketing, politics, or advertising require the establishment of objectives, tasks, and milestones. Furthermore developing and managing campaigns requires the development of knowledge and skills relating to the management of teams. Students will acquire analytic skills allowing them to understand the development and management of communication campaigns and projects. Current theory and research will comprise an integral part of the course as will study of the appropriate software tools. A significant component of the assessment for this course will be a group project that will involve the design of a communication campaign or project which will be presented to a group of experts.", "prerequisites": "A minimum of 8.0 credits."}, {"name": "CCT303H5 • Communicating In and Between Organizations", "description": "This course examines the nature of communications in organizations. Communications are the glue that holds organizations together. Understanding theoretically and practically the multi-faceted functions of communication in and between organizations is essential for anyone seeking to develop a career in an organization whether it be private or public. Students will acquire analytic skills allowing them to understand organizational communication from a variety of different perspectives. They will also be required to develop and actively critique practical examples of organizational communication.", "prerequisites": {"and": [], "or": ["CCT210H5", "CCT218H5"]}}, {"name": "CCT304H5 • Visual Communication and Digital Environments", "description": "This is a project-based course that focuses on analyzing and evaluating the persuasive impact of the images we use every day to make decisions about our social networks, what we buy, how we live, what we care about, and who we are. Students will learn about rhetorical devices used in visual communications and then work in teams to create a persuasive awareness campaign for an NGO, Government Agency, Healthcare organization or other social interest group as the final project.", "prerequisites": "CCT210H5"}, {"name": "CCT305H5 • Design and Implementation of Multimedia Documents", "description": "The principles and techniques of user-centered, functional design are introduced and applied to the analysis of software interfaces and the creation of multimedia documents. The roles of shared metaphors and mental models in clear, concise and usable designs are emphasized. Students will produce multimedia documents, which make effective use of text, colour, user input, audio, still, and time-based images.", "prerequisites": "CCT250H5"}, {"name": "CCT306H5 • Interpersonal Communication", "description": "An introduction to the cognitive, social, dyadic and group factors that shape communication and relational development between people. The objective of this course is for students to learn and apply the communication processes involved in encoding and decoding messages that help us understand others around us. Students will learn concepts, theories, and skills related to interpersonal communication. Topics include impression management, interpersonal influence, relational development, and conversational skills.", "prerequisites": "Completion of 8.0 credits"}, {"name": "CCT307H5 • Critical Infrastructure Studies", "description": "This course explores how infrastructures shape society, culture, and understanding of the human condition. We examine different infrastructures from electric networks to communication networks, data farms, environmental sensing systems, smart cities, and satellite technologies and our reliance on them. We will also examine how these infrastructures are sustained and maintained. By building on critical theories and approaches to infrastructures and their impact, the course investigates the power of infrastructure to establish the conditions of our daily lives.", "prerequisites": "CCT218H5"}, {"name": "CCT308H5 • Advanced Research Methodologies", "description": "This course provides students with an in-depth study and critical analysis of research methodologies within the discipline of communications and new media. Students will learn to explicitly identify generalizable findings, ethical concerns, study limitations, and new contributions to the field of knowledge using existing studies in qualitative, quantitative and mixed methodologies. Students will also gain experience in identifying and assessing problems within a research design and develop the ability to recommend revisions and/or new contexts and techniques for replicating the studies.", "prerequisites": {"and": [], "or": ["CCT203H5", "CCT208H5"]}}, {"name": "CCT310H5 • Popular Culture and Society", "description": "How does consumerism affect symbolic production, circulation and transactions? Major modern theories of mass communication will be presented (Fiske, Bourdieu, Benjamin, Jenkins, Frankfurt school, and Marxist approaches). Students will explore new structures of mass communication in relation to popular culture systems, and their economic, technological and institutional dimensions. Topics include Disney, Hollywood, celebrity culture, social media, and user generated content in digital environments.", "prerequisites": "CCT210H5"}, {"name": "CCT311H5 • Game Design and Theory", "description": "This course provides an introduction to games studies. It reviews the history of games, from board and card games through to the latest digital games. It enables students to understand the medium of games through various lenses such as critical theory and ethnography. Students are introduced to the concepts of game narrative, the influence of technology in digital games, and the emergence of game paradigms such as casual games, serious games, game ‘modding’, and subversive play.", "prerequisites": "CCT270H5"}, {"name": "CCT314H5 • Mind, Media and Representation", "description": "This course applies a variety of theoretical and practical approaches to consider the multiple and often conflicting ways representations in media are produced and consumed. The study of representations is approached from the perspective that they are best understood as both discursive and ideological. Questions to be examined include: What does it mean for historical and contemporary representations to carry economic, ideological and discursive power? To what extent do audiences hold power to resist or negotiate with representations? How might we interrogate the notion that we live in a post-feminist, post-racialized society in which older ideas about gender, race and power no longer apply or need re-thinking?", "prerequisites": "A minimum of 8.0 credits including CCT109H5 and CCT110H5."}, {"name": "CCT316H5 • Communication and Advertising", "description": "A study of theories in communication and meaning with different reference to advertising, advertising messages, and advertising management.", "prerequisites": "CCT210H5"}, {"name": "CCT317H5 • Creative and Experimental Coding", "description": "This course will instruct students in the use of programming languages such as Python or Processing for novel applications, including cases from animation, design, and information visualization. Appropriate use of code libraries, platforms and programming techniques will be developed. Assessment will be based on both programming and the expressive use of programs in their case context.", "prerequisites": "CCT211H5"}, {"name": "CCT318H5 • Sustainability and the Digital Enterprise", "description": "This course focuses on investigating the impacts of the digital enterprise on sustainability. The course presents an overview of the sustainability challenges and the concrete approaches to solving those challenges with the use of technology. The course uses an active learning approach allowing students the opportunity to learn while working on different sustainability projects linked to digital enterprises.", "prerequisites": "Minimum of 8.0 credits including CCT112H5"}, {"name": "CCT320H5 • Communication, Technology, and Social Change", "description": "This course explores how media and media technology have shifted the nature of existing political and social orders. We will focus on how social movements and political change engage media and technology to disrupt social norms and practices that perpetuate inequality. This will bring us in contact with theories of social movement mobilization, political communication, and digital media. We may also explore the ways that legacy and digital media have changed to be in service of misinformation and state repression.", "prerequisites": {"and": [], "or": ["CCT212H5", "CCT218H5", "CCT222H5"]}}, {"name": "CCT321H5 • Introduction to Finance", "description": "This course will provide students with an understanding of investment appraisal from a financial standpoint. It will provide them with the necessary tools to construct the financial component of a business plan and analyze the financial performance of a company. It will examine the practical problems of capital budgeting and highlight the techniques of performing ongoing monitoring of a company's financial health and risks.", "prerequisites": {"and": ["CCT112H5", {"and": [], "or": ["CCT219H5", "CCT319H5"]}, "CCT224H5"], "or": []}}, {"name": "CCT324H5 • Organizational Studies II", "description": "Overview of individual and group behaviour in organizations, including motivation, communication, decision making, influence and group dynamics. Examination of major aspects of organizational design including structure, environment, technology, goals, size, inter-organizational relationships, innovation and change.", "prerequisites": "CCT224H5"}, {"name": "CCT325H5 • Media Economics II", "description": "This course explores macroeconomics through the analysis of national and international crises. The course begins with a discussion of the nature of economics, a brief examination of markets, and a discussion of crisis and growth. We survey the institutions and dynamics of growth in the post WWII period, their breakdown in the 1960s and the spread of international crisis in the 1970s, and the crises of various economic policy responses from the 1980s to the present. After this historical overview, we explore macroeconomic theory and its development over the last 50 years. We study the Keynesian model and its emphasis on employment and output, its crisis in the late 1960s and early 1970s, the rise of monetarist alternatives, the elaboration of aggregate supply and demand models highlighting prices instead of employment, the surge of supply-side and rational expectations economics during the Reagan administration and the continuing debates among economists over the merits and problems of the various theoretical approaches. The course closes with an examination the various forms of crises tied to the emergence of information and communications technologies and the knowledge economy.", "prerequisites": "CCT219H5 or CCT319H5 or ECO100Y5 or (ECO101H5 or ECO102H5)."}, {"name": "CCT327H5 • Price Management", "description": "Price setting is one of the most important marketing mix decisions, which involves understanding both supply side factors (e.g., costs), and demand side factors (e.g. consumer willingness to pay). In this course, we will approach the pricing decision with a more pragmatic view encompassing a comprehensive understanding of the demand side; both at the level of individual customer values, and the more aggregate level of price sensitivities of the market. Using diverse categories, such as healthcare, industrial products and consumer packaged goods, this course will equip students with economic and behavioral approaches to pricing, value pricing, price customization, price bundling and retail pricing strategies.", "prerequisites": {"and": [], "or": ["CCT219H5", "CCT221H5", "MGT252H5."]}}, {"name": "CCT328H5 • Project Management", "description": "Approaches to the management of complex technical projects will be investigated. Topics include project estimating, costing and evaluation, organizing and managing project teams, quantitative methods for project planning and scheduling, introduction to computer-based project management tools. The course may involve an applied field project.", "prerequisites": "A minimum of 8.0 credits."}, {"name": "CCT331H5 • Social Media and Society", "description": "This course introduces students to critical approaches to social media drawing from theories and fields including software studies, platform studies, critical theory and political economy. The course provides students with tools and theories to analyze and understand current social media connectivity, and how social media platforms function as socio-cultural systems.", "prerequisites": {"and": [], "or": ["CCT218H5", "CCT222H5"]}}, {"name": "CCT332H5 • Canadian Communication Policy", "description": "This course examines the policy and regulatory frameworks that shape media, culture, and technology in Canada. The course surveys the historical development of communication policy in Canada, broadly understood, and introduces students to issues and debates in the development of communication policy for specific sectors such as broadcasting, creative industries, platforms, and the internet.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT333H5 • Social Innovation", "description": "This course introduces students to the strategies and processes of social innovation through usability studies, systems analysis, and artifact prototyping for new products or services for underserved groups. Students will learn various techniques of understanding user needs requirements and design methodologies, and apply this knowledge to create socially innovative prototypes to apply to real world situations. By the end of this course, students will have worked in groups to develop design alternatives for a technological artifact or system of their choosing, gain knowledge of human-centred design strategies and learn how to become change agents through case studies, best practice analyses, and relevant readings.", "prerequisites": "CCT250H5"}, {"name": "CCT334H5 • History and Theory of Game Production", "description": "This course will examine the principles, theory and practice behind the production of games. By examining the history and contributions of early founders such as Atari and Activision, all the way to present-day leaders such as Electronic Arts and Sony, students will gain an understanding of how the global video game industry operates. The lectures and practical work will foster an approach to the understanding of game production issues including technology, law, marketplace and audience demand.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT335H5 • Technology and the City", "description": "Technology continues to reshape the physical contours of our built environments as much as it redefines our conceptualization of how we inhabit and interact within them. This course investigates how urban form, space, infrastructure and communication are mediated by new and evolving technologies.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT340H5 • Gender, Media and Technology", "description": "This course brings a gendered lens to the study of media and technology. The course explores the (re)production and (re)presentation of gender through communicative practices in a variety of mediums, including print media, TV, activist media, video games and online platforms. The course develops an understanding of gender ideologies and how media, technologies, and communication help produce gender. The course examines the way gender identities are constructed by mainstream and alternative media; gendered divisions of media and digital labour; the relationship between ICTs and the performance of gender and sexuality; masculinities, gender politics; feminist theory; and the construction and negotiation of gender in relation to mediated environments.", "prerequisites": {"and": ["CCT109H5", "CCT110H5", {"and": [], "or": ["CCT200H5", "CCT210H5", "CCT222H5", "WRI173H5", "WRI203H5"]}], "or": []}}, {"name": "CCT341H5 • Introduction to IT Consulting", "description": "Information Technology (IT) Consulting is a growing profession that embodies the use of computer-supported collaborative tools in the execution of business functions. In this course students engage with the principles of Computer Supported Co-operative Work (CSCW) through an experiential opportunity to work with a real client. Students create an IT Consulting company and take on the role of consultants, learning core skills (soft and hard) necessary for this profession, including client management, communication, ideation, analysis and solution development, project management, presentation skills, and web design. Using case studies we discuss consulting lessons learned and problems to avoid within the context of industry best practices.", "prerequisites": "Minimum of 8.0 credits."}, {"name": "CCT353H5 • Digital Media Production l", "description": "This foundational course is centred on the practical aspects of producing narrative, still, and time-based imagery in digital environments. Industry-standard workflows and delivery systems of digital media production, including photography, video, and audio production platforms will be explored.", "prerequisites": "CCT250H5"}, {"name": "CCT354H5 • Digital Marketing II", "description": "This course examines digital marketing strategies and the role of online and mobile advertising platforms. Students will explore how emerging technologies are used to facilitate B2B and B2C transactions. A number of domains will be covered (search, display, programmatic trading, mobile, social, etc.) to give students a comprehensive understanding of both existing marketing strategies and emerging trends. This class will emphasize the strengths and weaknesses of various approaches to digital marketing while helping students develop a greater understanding of the different elements of marketing campaigns from formulation and implementation to integration and assessment.", "prerequisites": "CCT221H5"}, {"name": "CCT355H5 • Critical Approaches to Innovation", "description": "This course provides students with a survey of critical theories appropriate to the study of technological innovation. Students will: 1) explore theories of the social, cultural, and ecological impacts of technological innovation; 2) apply these theoretical lenses to the study of trends in innovation; and 3) propose a product or approach to innovation using social, cultural, or ecological criteria.", "prerequisites": "CCT224H5"}, {"name": "CCT356H5 • Online Advertising and Marketing", "description": "This course investigates the industrial practices and tools of effectively marketing and promoting goods and services online. Topics include analysis of contemporary online advertisement design, the effective use of social media technologies in product marketing, planning online campaigns that reinforce and complement existing marketing and advertising efforts, and understanding key metrics used to evaluate a campaign's effectiveness.", "prerequisites": "CCT260H5"}, {"name": "CCT360H5 • Web Development and Design II", "description": "This course will introduce advanced standards-based frameworks that support the development of responsive front-end systems. Key concepts covered in this course include the application of advanced markup and design strategies, scripting languages applied to dynamic interactions, frameworks and code version control, and foundations of server-side implementations.", "prerequisites": "CCT260H5"}, {"name": "CCT361H5 • Speculative Design II", "description": "In this course students are introduced to programming languages regularly used in management operations. Students will learn what these languages are, when and why they are applied, and how to read and write basic scripting code. The goal of this course is to familiarize students with scripting so that they can communicate more effectively with programmers in business settings.", "prerequisites": "CCT261H5"}, {"name": "CCT365H5 • Surveillance", "description": "From the Orwellian Big Brother to Foucault's panopticon, surveillance has become an everyday facet of modern life. From a surveillance studies perspective surveillance can be applied as a framework for understanding social, political, and technological interrelationships. This framework can help us study more effectively power, identity, persuasion, and control associated with the spread of Information Communication Technologies (ICT's). This course will introduce students to viewpoints, vision and visibility in surveillance studies. The class will look at a range of topics from information politics, identification, privacy, security, suspicion, social sorting, bodies, borders and biometrics to explore a range of perspectives under the surveillance studies umbrella. It will introduce students to key issues surrounding data, discrimination, and visibility in a global context to undercover the watched world.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": ["CCT206H5", "CCT222H5"]}}, {"name": "CCT371H5 • Sound as Media", "description": "Sound as Media will provide students with an immersive introduction to the field of sound studies. The course offers a counterpoint to surveys of visual media by exploring acoustic technologies in historical, cultural and spatial context. By considering examples such as the gramophone, public address system, boombox, and MP3 player as well as the theories that account for them, students will develop an understanding of media forms that engage the ear as well as the eye. They will in turn, have the opportunity to apply this understanding to the final project which will give them hands-on experience with creating a sound-based documentary.", "prerequisites": "A minimum of 8.0 credits including CCT109H5 or CCT110H5 or CCT111H5"}, {"name": "CCT373H5 • Career Planning and Development", "description": "The transition from university studies to professional settings necessitates the articulation of how acquired skill sets, education, professional contacts, supporting resources, and related experiences connect to and influence career trajectories. To facilitate agility in navigating the ever-shifting global economy, within and outside of the classroom students are provided with a mixture of structured, self-directed, independent, and team activities that aid in the development and refinement of professional identities, community networks, communication approaches, and problem solving skills.", "prerequisites": "CCT273H5"}, {"name": "CCT374H5 • Critical Histories of Information Technologies", "description": "The course approaches current information and communication technologies from critical and historical perspectives. It investigates the interests, motives and tactics of news media, pop culture producers, amateurs, universities, corporations, and governments in promoting, sustaining, and interpreting information and communication systems. It also asks how the focus will be on media and information technologies, more theoretical or methodological readings will necessarily cover other systems. Case studies may include investigations of orality, writing, the printing press, industrialized printing, and electronic media from the telegraph and the telephone to broadcasting and the internet.", "prerequisites": "CCT218H5"}, {"name": "CCT380H5 • Human-Computer Interaction and Communication", "description": "The emphasis in this course will be on theoretical, methodological, and empirical issues in the study of Human-Computer Interaction. Intelligent interface designs, usability assessment, user modeling and the accessibility of the technology for the disabled are among the topics to be examined. Related behavioural investigations concerning the ease and efficiency of users' interactions with computerized environments will also be discussed.", "prerequisites": {"and": ["CCT109H5", "CCT110H5"], "or": []}}, {"name": "CCT381H5 • Media Audiences", "description": "Audiences are social constructions which must be imagined to be actualized. Beginning with an exploration of the nature and role of audiences from early 20th century media, students explore how audiences make meaning of popular media platforms today. How are audiences situated within media texts, what role does this play in how media is generated and circulated, and how do audiences both enact and resist media influence? Broadcast models, interactive models, audience reading, gender, culture, race, and audience feedback are investigated.", "prerequisites": "CCT210H5"}, {"name": "CCT382H5 • Prototyping Digital Games", "description": "This course explores the fundamentals of the process of game design through prototyping. It focuses on the contexts and components of game design, such as design iteration and user testing along relevant dimensions such as art style, narrative, and game balance. Students will be introduced to design across different genres and types of digital games, including games for education, serious games, indie, and AAA games. Working in collaborative groups, students will learn and practice the appropriate methodology to design game mechanics, characters, art assets and other appropriate deliverables in order to create a game or high-fidelity prototype.", "prerequisites": {"and": [{"and": [], "or": ["CCT211H5", "CCT285H5"]}, "CCT270H5"], "or": []}}, {"name": "CCT383H5 • The Interactive Society", "description": "This course introduces students to the theoretical and practical study of how interactive digital media and systems affect, influence and reshape our society and what does it mean to be a \"user\" in the information-centric society. It will expose students to specific theoretical issues such as privacy by design, usable privacy, marginalized and at-risk user groups, the digital divide, behavioural modification (persuasion) through new media, ICT4D (info tech for development) and empowerment/alienation through intelligent interactive systems. Focus will be on developing skills that will enable students to propose changes (design, policy, framework) to existing and future envisioned interactive technologies that address the issues analyzed.", "prerequisites": "A minimum of 8.0 credits including CCT109H5 and CCT110H5."}, {"name": "CCT386H5 • Information Practice in Virtual Worlds: Exploration of Information Environments", "description": "Virtual environments, immersive 3D environments accessed via computers or virtual reality headsets, comprise a unique and futuristic communication environment. Virtual environments have the potential to support a wide variety of activities related to information creation, distribution, and reception and can support social, economic, and cultural causes. Compared to everyday information practices, however, those enacted in virtual worlds are uniquely characterized by multimodality, synchronicity, digital embodiment and geographic distribution of users. In this course, students engage in participatory learning in virtual environments, using avatars to assess how the world's technological and social affordances support and constrain information practices. Using theories of gaming, virtuality, and information lifecycles, students critically analyse how information is produced and used in these environments.", "prerequisites": "A minimum of 8.0 credits including CCT109H5 and CCT110H5."}, {"name": "CCT390H5 • Digital Media and Communications Abroad", "description": "Students on International exchange programs are encouraged to seek out courses in digital media and technologies that enrich their learning within an international context. This course is intended as an opportunity for students to study global issues and contexts abroad that provide a comparator to the Canadian media and communications landscape.", "prerequisites": "Permission of ICCIT Director."}, {"name": "CCT395H5 • Topics in Communication, Culture, Information & Technology", "description": "An in-depth examination of selected topics in communication, culture and information technology. Topics vary from year to year, and the content in any given year depends upon the instructor. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "A minimum of 8.0 credits."}, {"name": "CCT399H5 • Research Opportunity Program (ROP)", "description": "This course provides an opportunity for third or higher year students to assist with the research project of a professor in return for 399H course credit. Students have an opportunity to become involved in original research and enhance their research skills. Based on the nature of the project, projects may satisfy the Humanities, Sciences or Social Sciences distribution requirement. Participating faculty members post their project description for the following summer and fall/winter session on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "A minimum of 10.0 credits or permission of instructor."}, {"name": "CCT399Y5 • Research Opportunity Program (ROP)", "description": "This course provides an opportunity for third or higher year students to assist with the research project of a professor in return for 399Y course credit. Students have an opportunity to become involved in original research and enhance their research skills. Based on the nature of the project, projects may satisfy the Humanities, Sciences or Social Sciences distribution requirement. Participating faculty members post their project description for the following summer and fall/winter session on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "A minimum of 10.0 credits or permission of instructor"}, {"name": "CCT400H5 • Advanced Project", "description": "Majors and specialists are given the opportunity to develop a critical perspective on selected issues in CCIT. Students design and implement an advanced project on a topic of interest by engaging with advanced readings. A central aim is to refine the skills in critical analysis and in oral and written communication.", "prerequisites": "A minimum of 13.0 credits"}, {"name": "CCT401H5 • Advanced Thesis Course", "description": "Students will carry out a research project on a topic of their choosing which is related to their specific program focus in Digital Enterprise Management. Students will meet as a group for selected seminars emphasizing advanced research skills and thesis writing. Students will develop a research proposal, conduct research, and produce a research paper.", "prerequisites": {"and": [], "or": ["CCT203H5", "CCT208H5"]}}, {"name": "CCT402H5 • Creating, Protecting and Managing Digital Artifacts", "description": "Digital artifacts play an increasingly important role in our society. It is essential that in the digitization of these artifacts appropriate attention is paid to their representation, protection and management. Students will review the theories and practices of representation. They will investigate the technologies associated with the storage of digital artifacts as well as investigating appropriate legal perspectives. This varied knowledge will be integrated into a study of best practices in the management of digital artifacts.", "prerequisites": "A minimum of 13.0 credits including CCT206H5."}, {"name": "CCT403H5 • Finance, Innovation and the Digital Firm", "description": "Students will learn about financial aspects of digital industries. They will gain knowledge about how financial and other incentives shape the decisions of agents in the digital marketplace. Such a knowledge helps to identify industry trends aiding their own decisions when participating in Internet related industries. Topics covered include online and traditional media industries, aspects of e-commerce and marketing, open source software and crowd-sourcing. A highly effective way to gain such knowledge is by covering a relevant topic in an academic essay. This way the students will also improve their writing skills, and learn better how to cover financial aspects of their chosen topic in a scholarly manner.", "prerequisites": "A minimum of 13.0 credits."}, {"name": "CCT404H5 • Remote Work, Technology and Collaboration", "description": "This project-based course aims to demonstrate how collaboration is a critical capability often overlooked. During the course students will integrate their learning and experience and first hand see how, in combination with collaboration it can lead to creatively solving problems in areas as varied as business, health care delivery, urban planning and development. In addition to lectures, students will have the benefit of a series of guest lecturers. A large, group based project will serve to integrate learning and allow students the benefit of experiential learning.", "prerequisites": "A minimum of 13.0 credits."}, {"name": "CCT405H5 • Individual Project", "description": "A research project carried out under the supervision of a faculty member. Students will carry out a research project on a selected topic related to CCIT. Students must obtain signed permission from the faculty member who they would like to have as their supervisor.", "prerequisites": "A minimum of 13.0 credits."}, {"name": "CCT407Y5 • Advanced Field Experiences in CCIT", "description": "This course provides students the opportunity to test their skills, immerse themselves within a different cultural or social context and explore communication and technology issues through an intense field experience either in Canada or abroad. The type of field experience varies from year to year and some experiences may evolve through collaborations with other disciplines or through special industry projects. The advanced field experience may involve travel and participation in international conferences or other relevant activities. Students are responsible for travel expenses.", "prerequisites": "Permission of the ICCIT Director."}, {"name": "CCT409H5 • Special Topics in Work-Based Learning", "description": "An advanced unpaid field placement working on specially designed projects that explore collaborative, collective and global approaches to practical knowledge application. The placements may include international internships, collaborative group internships and community-based initiatives. The projects may vary from year to year depending on the external partners. Students will engage with others in the course through an online class component and complete individual reports and critical evaluations of the work experience.", "prerequisites": "A minimum 13.0 credits and CGPA of 2.5."}, {"name": "CCT410H5 • CCIT Internship I", "description": "This course is a practical internship and is available only upon application from students registered in the CCIT/DEM/TCS programs. Through a placement, students will apply the expertise in communication, culture, and information technology that they have gained through previous courses. Students must plan well in advance for the placement and work closely with the placement officer for CCIT to determine eligibility and suitability. A report and presentation will be required at the end of the placement. These, along with the employer's assessment, will provide the main part of the course mark.", "prerequisites": "Completion of 13.0 credits with a minimum CGPA of 2.5 and approval of the internship coordinator/instructor, and evidence of additional career development (e.g. workshops, networking events, and professional communication with faculty, librarians, staff, and peers)."}, {"name": "CCT411H5 • CCIT Internship II", "description": "This course is a practical internship and is available upon application from students registered in any CCIT program who have completedCCT410H5. The course is intended for students who have the opportunity to continue theirCCT410H5internship for a second semester. A report and presentation will be required at the end of the placement. These, along with the employer's assessment, will provide the main part of the course mark.", "prerequisites": "(Completion of 13.0 credits including CCT409H5 or CCT410H5 or WRI410H5) and minimum CGPA of 2.5 and permission of Internship Coordinator."}, {"name": "CCT414H5 • Special Topics in Knowledge, Media and Design", "description": "An in-depth examination of selected topics in interactive digital media with emphasis on knowledge, media and design. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "A minimum of 13.0 credits"}, {"name": "CCT416H5 • Social Data Analytics", "description": "This course highlights the research in analysis for social data and builds skills to undertake those analysis. It is a lab-intensive course intended to build up data analytic skills for novice and intermediate researchers. Students look at recent studies using \"big data\" which are primarily theoretical, including critiques of data analytics and concerns surrounding data ethics. Students learn a programming language -- Python -- and how to scrape social data, store and collect it, run basic statistics, generate visuals, and create a report based on a project of interest.", "prerequisites": {"and": [], "or": ["CCT203H5", "CCT208H5"]}}, {"name": "CCT417H5 • Alternative Media", "description": "This course examines the history, politics and aesthetics of a range of alternative, underground and radical media, as well as their relation to mainstream media. Students will study and experiment with a range of alternative media, including zines, graffiti, hacking, and culture jamming, for example. Students will gain hands-on experience in the creation of alternative media.", "prerequisites": "Minimum of 13.0 credits."}, {"name": "CCT418H5 • Work, Media and Technology", "description": "The course analyses the political, historical, and technical relationships between media, technology, and work in contemporary capitalism. The course will examine the power and social relationships that structure work in contexts such as media, creative industries, and the platform or \"gig\" economy. The course will focus on critical theories of work and will engage with case studies of the intersection of work, media and technology. The aim of the course is to build a tool kit for encountering an increasingly casualized and digitally-mediated labour market.", "prerequisites": {"and": [], "or": ["CCT219H5", "CCT222H5", "CCT319H5"]}}, {"name": "CCT419H5 • User Experience Design - UXD and Board Games", "description": "This course allows students to explore issues related to user interface, user experience, materiality, gamification and game theory. Board games represent a space to consider social interaction, the use of materials, the role of emotion in design (UX), knowledge sharing and the role gamification plays in influencing behaviour. Students will be exposed to professional and research publications related to design, game theory, user experience and game mechanics.", "prerequisites": "A minimum of 13.0 credits."}, {"name": "CCT420H5 • Information Technology and Globalization", "description": "The variety of ways in which various information technologies influence and are influenced by globalization will be critically examined. The class will explore metaphors or ways of thinking about society and technology to critically examine the complex process and the diverse consequences of globalization. Topics may shift focus yearly but will include the economy, culture, politics, social movements, migration, social identity, war and global conflict, etc.", "prerequisites": "A minimum of 13.0 credits including CCT109H5 and CCT110H5."}, {"name": "CCT424H5 • Organizational Studies III", "description": "An in-depth study of the development of innovative strategies for organizations with an emphasis on digital enterprises. The nature of strategic innovation will be studied and a variety of analytic frameworks introduced. Concepts will be explored through a combination of lectures and case studies.", "prerequisites": {"and": ["CCT112H5", {"and": [], "or": ["CCT219H5", "CCT319H5", "CCT321H5"]}, {"and": [], "or": ["CCT221H5", "CCT322H5"]}, "CCT324H5."], "or": []}}, {"name": "CCT430H5 • Networked Life", "description": "The rise of information and communication technologies in contemporary societies has highlighted the interdependent nature of relationships; person-person, person-machine, machine-person, and machine-machine. Network analysis offers a point-of-view with which we can analyze networks to understand the roles of people and technology, identify the source of existing or potential issues, and the exchange of resources and information. This course applies network theory and methodology to examine how technology is used to maintain and build personal networks. It will further explore how personal networks intersect with larger institutional networks (e.g. corporations and universities) and informal networks (e.g. online communities and sports clubs). In the process, students will be guided in how to identify, measure, and collect data on selected networks, how to then analyze this data using a variety of analytic techniques.", "prerequisites": {"and": [], "or": ["CCT203H5", "CCT208H5"]}}, {"name": "CCT431H5 • Drones, Robots, Artificial Intelligence", "description": "Drones, robots, and artificial intelligence are three interrelated technologies that are changing the most fundamental considerations of how society and sociality should operate. Work, war, consumption, and even love are being reconfigured. This course will address debates concerning the cultural, political, economic, military, and economic considerations surrounding the growing use of these technologies.", "prerequisites": "A minimum of 13.0 credits."}, {"name": "CCT432H5 • Ethics and Code", "description": "A self-driving car should always protect pedestrians, even if that implies serious threat for the vehicle's passengers. Current ethical challenges within our computational cultures has brought forward dilemmas involving code such as designing killer robots, the use of technology to predict and prevent crimes before they happen, and platform surveillance in social media. Students in this course will use theories and case based examples to examine questions such as what is meant with ethics in new media and critical computing, can we program computational systems according to ethical models, and does digital culture force us to rethink what ethics are?", "prerequisites": "A minimum of 13.0 credits."}, {"name": "CCT434H5 • Design Thinking II", "description": "An advanced project-based seminar on the art and creative directions of design thinking. Combining traditional and innovative creativity methods, a variety of design projects are conceptualized and drafted for proposal or implementation. This course embraces design thinking as a holistic, interdisciplinary approach that integrates methodical creativity and overarching design principles, such as aesthetics, futures-thinking, progress and metadesign.", "prerequisites": "A minimum of 13.0 credits including CCT204H5."}, {"name": "CCT435H5 • Media and Outer Space", "description": "Examines the relationship between media studies and Outer Space inhabitation and exploration. Through analysis of military, technological, industrial, scientific, design, artistic, and civilian projects, films, novels, science fictions, and other media forms, the class investigates and reveals the historical, social, cultural, and political implications of our mediated relation with Outer Space. Technologies and topics include: the space race and the Cold War, space imagery, extreme environments, space travel, space suits, space vehicles, and space habitats, satellites, extra-terrestrial intelligence, mining, extraction, terraforming, radiation, gravity, and levitation.", "prerequisites": "A minimum of 13.0 credits"}, {"name": "CCT436H5 • Cultures of Connection", "description": "This seminar course students will conduct original research to examine the role that culture plays in choosing and using communication technologies within the context of family, work, and friendship. We will focus on how individuals draw on communication technology to navigate cultural expectations and roles at home, work, and in social settings. To frame this research we will discuss various approaches to defining and understanding culture, and consider how these approaches help us to understand the use of communication technology within a variety of relationships.", "prerequisites": {"and": ["CCT109H5", "CCT110H5", "CCT208H5"], "or": []}}, {"name": "CCT440H5 • Power, Privilege and Technology", "description": "How is social inequality reproduced and encoded in technology systems and in digital media? In what ways do technology and media creations inform and influence perceptions, beliefs, and practices that impact girls and women, communities of colour, Indigenous groups, LGBTQ+ and other minoritized people? This course will address overlapping and intersectional issues of power, privilege, oppression, and sociotechnical imaginaries - all related to networks, big data and predictive analytics, algorithms, digital gig economies, and interactive multimedia like social media and virtual reality.", "prerequisites": {"and": ["CCT200H5", "CCT222H5"], "or": []}}, {"name": "CCT453H5 • Digital Media Production II", "description": "Building on theCCT353H5Digital Media Production I, this course will further develop theoretical and practical aspects of video production and editing. Over the course of the term, we will explore advanced video and sound capture techniques, media mixing, applications of digital libraries and effects in post-processing.", "prerequisites": "CCT353H5"}, {"name": "CCT454H5 • Documentary Practices", "description": "This course explores the form and practice of documentary. Objectivity, ethics, censorship, representation, reflexivity, responsibility to the audience and authorial voice will be examined. Students will engage in practical engagement with documentary forms including the expanded field of documentary using tools such as photography, audio, video, 360 video, VR and new technologies.", "prerequisites": "A minimum of 13.0 credits."}, {"name": "CCT460H5 • Web Development and Design III", "description": "This course builds on the front-end web development skills acquired in the Web Development and Design I & II courses by adding a server-side programming and database design component. Students will learn the theoretical and practical aspects of implementing data-driven applications, leveraging query languages, APIs and Content Management Systems for enterprise systems. Further topics include integration of analytics and search strategies in CMS systems.", "prerequisites": "CCT360H5"}, {"name": "CCT461H5 • Speculative Design III", "description": "Emerging technologies have the potential to transform business models and architectures. In this course students learn the functional and technical underpinnings of selected emerging technologies and critically analyse how these technologies are impacting business functions. Students also gain hands-on experience with emerging technologies and consider how they may be applied or adapted to solve management issues.", "prerequisites": "CCT361H5"}, {"name": "CCT470H5 • Information Visualization", "description": "Visual literacy and the visualization of information are increasingly important competencies in a growing number of fields. This course will explore the history of visually representing information, consider issues related to data visualization and approaches to visually representing data. In addition, students will develop a better understanding of what visualization works best for various types of data, what makes for a strong visualization and the importance of narrative in the construction of graphic data representation.", "prerequisites": {"and": ["CCT210H5", {"and": [], "or": ["CCT286H5", "CCT304H5"]}], "or": []}}, {"name": "CCT472H5 • Media Archaeology", "description": "This course examines media as technical objects with specific histories and a contemporary presence. In the contemporary context where media technologies are programmed to become obsolete, residual forms and practices provide materials traces for analysis. The class will focus on the evolution of media forms, looking particularly at early, antiquated, and obsolete practices and technologies of communication in order to recover their material traces, and to situate them in their historical, social, cultural, and political contexts. Through texts, archival materials, and case studies, old media will be brought back to life to question notions of authenticity, authority, preservation, archiving, temporality, agency, power, evolution, decay, and death.", "prerequisites": "A minimum of 13.0 credits and 2.3 CGPA"}, {"name": "CCT473H5 • Career Strategies", "description": "In this course students will learn about various challenges that new graduates, future managers, and future executives will face in the workplace. Students will learn the theoretical as well as practical techniques that will help them succeed after graduating from their undergraduate programs.", "prerequisites": "Minimum of 13.0 credits."}, {"name": "CCT475H5 • Thesis in Integrated Learning in Digital Media, Communication, and Technology", "description": "This capstone project course carried out independently under the supervision of a faculty member requires students to reflect on the experiences they gained during their two work placements connected with the Professional Experience Certificate in Digital Media, Communication, and Technology, and develop a comprehensive case study that integrates theories learned within ICCIT and their work placements.Students will be required to participate in one-on-one consultations with the course instructor.", "prerequisites": {"and": ["CCT273H5", "CCT373H5"], "or": []}}, {"name": "CCT476H5 • Foundations of Operations Management", "description": "Operations Management deals with the functions of an enterprise that create value for the customers. The scope of study covers all processes involved in the design, production and physical distribution of goods and services. With global competition continuously increasing, a firm's survival depends upon how well it integrates the operations function into the enterprise's general planning and strategy. It is thus essential for business managers to acquire an understanding and appreciation of operations.", "prerequisites": "A minimum of 13.0 credits including CCT224H5."}, {"name": "CCT477H5 • UX Design - Understanding Users", "description": "The focus of the course is on understanding the experiences of users and their communities as affected by their interaction with digital technologies in information-centric societies. Students will learn the theoretical framework and practical aspects of advances user-centered design principles (such as participatory design and techno-centric ethnographies). This course represents an opportunity for students to enrich their understanding of the deep interconnections between human factors, human needs, interactive technologies, information, as projected on several dimensions: cultural, societal, ergonomic, and economic.", "prerequisites": "CCT380H5"}, {"name": "CCT478H5 • UX Design - Prototyping and Evaluation", "description": "The course investigates how people interact with interactive digital systems from an evaluation and formal testing perspective, and introduces students to the methods of User Experience Assessment and User Experience Analysis (UXA). This studio-based experiential course examines how interactive systems are implemented and deployed to meet users' needs, with a focus on formal Human Computer Interaction (HCI) evaluation methods. Students will acquire the capacity to evaluate systems and to critically assess different HCI and UX validation methods which are based on industry approaches carried out by User Research Analysis.", "prerequisites": "CCT380H5"}, {"name": "CCT481H5 • Augmented Places and Social Media Spaces", "description": "Increasingly we are seeing a hybridization of information and location, where media provide a framework or environment for users (participants) to construct reality and relationships. The course explores emergence of new ubiquitous communication practices and the increasingly pervasive use of technology for the augmentation of people, places, and objects. In this course, students will explore various approaches to context-based information systems, and the shaping of social media spaces.", "prerequisites": "A minimum of 13.0 credits."}, {"name": "CCT483H5 • Play, Performance and Community in Digital Games", "description": "Students will explore the complex relationship between games and play. Starting with an overview of the major play theories, students will learn how cognitive, philosophical and social theories of play are used to guide and inform game design. The increasingly prominent role of the player in the co-creation and performance of digital games will be examined. Students will also explore the emergence of player communities and consider the various issues that this introduces into design and management process, including important new questions about governance, player and creative freedoms, and immaterial labour.", "prerequisites": "A minimum of 13.0 credits, including CCT270H5."}, {"name": "CCT486H5 • Digital Platforms: A Global Perspective", "description": "From Apple, Amazon, and Facebook to LINE, WeChat and TikTok, digital platforms dominate contemporary life. This course provides an intellectual voyage of the global spread of digital platforms from the days when they were not yet recognized as platforms to the contemporary era when users can hardly think of an internet without platforms. We will explore questions concerning the penetration of platforms into the social fabric of our digital life on a global scale while paying attention to the local conditions and specificity. Students will engage with key concepts, theories, and approaches related to platform studies through readings and discussions about different types of platforms, ranging from e-commerce and social media to live-streaming and on-demand service matching.", "prerequisites": "A minimum of 13.0 credits"}, {"name": "CCT487H5 • Advanced Communication Policy in a Global Context", "description": "This course provides students with a theoretical and practical understanding of media, technology, and cultural policy in a global context. The course focuses on issues such as national identity and globalization, media convergence, intellectual property, global media regulation, security and privacy by examining how media, communication, and cultural policy is created, influenced, and contested by a range of actors.", "prerequisites": {"and": ["CCT206H5", "CCT332H5"], "or": []}}, {"name": "CCT490H5 • Topics in Communication, Culture, Information and Technology", "description": "An in-depth examination of selected topics in communication, culture, information and technology. Topics vary from year to year, and the content in any given year depends upon the instructor. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "A minimum of 13.0 credits."}, {"name": "CCT495H5 • Topics in Communication, Culture, Information & Technology", "description": "An in-depth examination of selected topics in communication, culture, information and technology. Topics vary from year to year and the content in any given year depends on the instructor. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "A minimum of 13.0 credits."}, {"name": "CCT499H5 • Research Opportunity Program (ROP)", "description": "This course provides an opportunity for third or higher year students to assist with the resource project of a profession in return for 499H credit. Students have an opportunity to become involved in original research and enhance their research skills. Participating faculty members post their project description for the following summer and fall/winter session on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "A minimum of 13.0 credits or permission of instructor."}, {"name": "CCT499Y5 • Research Opportunity", "description": "This course provides an opportunity for third or higher year students to assist with the resource project of a profession in return for 499Y credit. Students have an opportunity to become involved in original research and enhance their research skills. Participating faculty members post their project description for the following summer and fall/winter session on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "A minimum of 13.0 credits or permission of instructor"}, {"name": "MGD415H5 • E-Business Strategies", "description": "Electronic business, the extensive use of the web and the Internet, is radically changing existing businesses. New Internet businesses are also being created at an unprecedented rate. New business models, e-business technologies, payment mechanisms, legal and regulatory issues (e.g., intellectual property rights, privacy and security) and the economics of e-business will be investigated from a research and practical perspective.", "prerequisites": {"and": ["CCT112H5", "CCT355H5"], "or": []}}, {"name": "MGD421H5 • Technological Entrepreneurship", "description": "This course explores the methods and frameworks of entrepreneurship through an experiential learning model (learning by doing). Students will begin the process of developing a new business venture, exploring their own business ideas and developing a business plan and pitch while working in teams. Topics include the business model, customers and markets, financial models, competition, intellectual property, funding and investment and characteristics of entrepreneurial teams.", "prerequisites": {"and": ["CCT112H5", {"and": [], "or": ["CCT219H5", "CCT319H5"]}, {"and": [], "or": ["CCT321H5", "MGM230H5"]}, {"and": [], "or": ["CCT221H5", "CCT322H5", "MGT252H5"]}, {"and": [], "or": ["CCT324H5", "MGT262H5"]}], "or": []}}, {"name": "MGD426H5 • Enterprise Risk Management", "description": "This course will address the identification and management of risks that are specific to digital industries such as network penetration, transaction processing interruption and flow disruption, provision of audit and backup facilities. The course will also integrate technical security issues along with managerial and legal considerations.", "prerequisites": {"and": ["CCT112H5", {"and": [], "or": ["CCT219H5", "CCT319H5", "EC0100Y5", {"and": [], "or": ["ECO101H5", "ECO102H5"]}]}, {"and": [], "or": ["CCT321H5", "MGM230H5"]}, {"and": [], "or": ["CCT221H5", "CCT322H5", "MGT252H5"]}, {"and": [], "or": ["CCT324H5", "MGT262H5"]}], "or": []}}, {"name": "MGD427H5 • Advanced Legal Issues", "description": "This course will build on the foundations established inCCT206H5. Issues relating to the protection of digital rights, taxation, privacy, jurisdiction and regulation will be examined in detail through the use of recent legal scholarship and evolving case law.", "prerequisites": {"and": ["CCT112H5", "CCT206H5"], "or": []}}, {"name": "MGD429H5 • Data Analysis II", "description": "This course offers an overview of data analytics principles, approaches, and technologies that allow businesses to generate business intelligence. Business intelligence refers to all the means required to collect, exploit and analyze data in order to provide the right information to decision-makers at the right time. This course is designed for individuals interested in Business Intelligence practices and analysis from a management point of view, without a detailed focus on statistical or programming methods.", "prerequisites": {"and": ["CCT226H5"], "or": ["CCT221H5", "CCT322H5"]}}, {"name": "WRI173H5 • Creative Non-Fiction", "description": "This course is an introduction to creative nonfiction as both a genre and a methodological tool for a variety of fields. It explores creative narrative approaches by professional writers in the form of journalism, documentary, ethnography, memoir, and narrative essay. This course also serves to begin and/or strengthen students’ own writing practice through craft-oriented workshops. Students explore ideas about product and process, form and meaning. Students will experiment with syntactic structures to explore how the form of language serves, or fails to serve, intention and the expression of meaning that may be understood and interpreted by others.", "prerequisites": "CCT226H5 and CCT221H5 or CCT322H5"}, {"name": "WRI225H5 • Community and Writing", "description": "Writing communication is a social act that both shapes and is shaped by community. Students in this course develop a narrative portfolio based on research into the experiences of individuals within a community that interests them. The course aims to enhance students’ storytelling by incorporating aspects of community such as unwritten rules, community language and nomenclature, rituals, history, ironic juxtaposition, and profiles of community members. Readings include a mix of student-authored and contemporary professional works.", "prerequisites": {"and": [], "or": ["WRI173H5", "WRI203H5"]}}, {"name": "WRI227H5 • Social Media and Content Creation", "description": "Examines theory and offers practice in creating content for Social Media. The course explores the growth of the Web, from information gathering to interactive and cooperative information/opinion dissemination. Students will critically examine the rhetorical practices of Social Media users and how these practices currently shape communications. Students will create and maintain individual content creation projects.", "prerequisites": {"and": [], "or": ["WRI173H5", "WRI203H5"]}}, {"name": "WRI273H5 • Specialized Prose", "description": "Examines theory and offers practice in nonfiction narrative with a specialized purpose. Students will explore conceptions of genre and the way genre shapes, and is shaped by, the social context of communications.", "prerequisites": {"and": [], "or": ["WRI173H5", "WRI203H5"]}}, {"name": "WRI291H5 • Introduction to Journalism", "description": "This course provides an introduction to journalism and examines journalism’s role in a democratic society. Students learn the fundamentals of journalistic writing, with a focus on news and reporting. The course examines news formats and styles, sources, interviews, research, structure, and other fundamentals. The course functions as a newsroom, with students producing several reported articles throughout the term, and includes guest talks and workshops with practicing journalists.", "prerequisites": {"and": [], "or": ["WRI173H5", "WRI203H5"]}}, {"name": "WRI292H5 • Narrative Inquiry", "description": "In this course, students design and carry out writing through a series of research techniques. Students learn to select and evaluate expert and scientific information from primary sources and produce content for an array of different media. A critical reading program exposes students to research-based writing. Assignments are aimed at developing professional skills across different forms and topics.", "prerequisites": {"and": [], "or": ["WRI173H5", "WRI203H5"]}}, {"name": "WRI293H5 • Introduction to Technical Communication", "description": "Introduction to Technical Communication serves as an introduction to the academic and professional fields of technical writing and communication. It explores strategies for analyzing organizational contexts, including professional audiences, professional purposes for writing, and organizational cultures. Assignments will build skills in technical writing, document design, documentation, accessibility, and ethical considerations for communication in professional settings.", "prerequisites": {"and": [], "or": ["WRI173H5", "WRI203H5", "CCT110H5"]}}, {"name": "WRI299H5 • Research Opportunity Program (ROP)", "description": "This course provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "WRI173H5 or WRI203H5 or CCT110H5"}, {"name": "WRI299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity forstudents in their second year to work in the research projectof a professor in return for 299Y course credit. Studentsenrolled have an opportunity to become involved in originalresearch, learn research methods and share in theexcitement and discovery of acquiring new knowledge.Participating faculty members post their project descriptionsfor the following summer and fall/winter sessions in earlyFebruary and students are invited to apply in early March.SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "WRI173H5 or WRI203H5 or CCT110H5"}, {"name": "WRI306H5 • Writing for the Academic Sciences", "description": "Examines conventions and standard practices when scientists write for other scientists in academic science journals, in conference and poster presentations, and in grant applications. This course focuses on presenting primary and secondary research. Humanities and social science students will gain specialized skills in technical writing and editing. Science students will learn the writing practices expected in professional labs and research groups. Students will present an article-length paper presenting primary research findings and a conference poster presenting the same findings to a scientific audience.", "prerequisites": "Completion of 8.0 credits with a minimum CGPA of 2.0"}, {"name": "WRI307H5 • Writing about Science", "description": "Examines the best practices of science writers and journalists who, based on research published in science journals, communicate scientific information to an educated audience which lacks specialized training. Science students will learn techniques for educating and informing public audiences. Humanities and social science students will learn to access and present current scientific information in engaging narrative. This course examines scientific writing and journalistic writing about science.", "prerequisites": "Completion of 8.0 credits with a minimumCGPA of 2.0"}, {"name": "WRI310H5 • Social and Professional Languages", "description": "Examines language by approaching it through its social users -- ethnic groups, genders, and social classes -- and its contextualized usages -- the languages of publishing, advertising, law, technical communications, academe and the electronic media. The course explores the functions of these languages and the roles of such forces as dictionaries, social change, and new communications technologies in the evolution of these languages.", "prerequisites": "WRI227H5 or WRI273H5 or WRI291H5 or WRI292H5 or WRI293H5 "}, {"name": "WRI320H5 • History and Writing", "description": "Examines written history as rhetoric and considers various conceptions of history and procedures for historical research and writing with reference to a range for models from Thucydides to contemporary writers of specialized and local histories. Students will conceptualize, design, and carry out primary source historical research to produce original history using locally available sources and materials.", "prerequisites": "Completion of 8.0 credits with a minimum CGPA of 2.0"}, {"name": "WRI330H5 • Oral Rhetoric", "description": "Examines the rhetoric of speech drawing on theorists from Plato to Havelock to Ong, and considers implications of \"great leap models\" that present orality and literacy on a continuum. This course considers a range of oral practices from informal to formal, and from spontaneous to research-based and examines a range of rhetorical modes: dialogue, storytelling, reporting, debate and presentational address. Significant course time will be devoted to students' oral performance, both individual and team-based.", "prerequisites": {"and": [], "or": ["WRI227H5", "WRI273H5", "WRI291H5", "WRI292H5", "WRI293H5"]}}, {"name": "WRI340H5 • Critical Reading and Listening", "description": "This course approaches reading and listening as time-bound processes by which we sense and make sense of the world around us. Reading and listening are not to be reduced merely to how we consume written or aural texts, but rather will be explored as the perceptual and cognitive activities that structure our sense of time, space, self and environment. We will place a particular emphasis on reading and listening in contemporary digital culture by engaging selectively with fundamental concepts in critical theory, as well as recent work in media and sound studies.", "prerequisites": {"and": [], "or": ["WRI227H5", "WRI273H5", "WRI291H5", "WRI292H5", "WRI293H5"]}}, {"name": "WRI360H5 • Finance and Writing", "description": "Examines organizational discourse with special attention to financial analysis and financial documents as rhetorical elements. Students will design and carry out primary research into organizations such as publicly listed companies and non-profit organizations and will examine different modes for reporting research findings. Principles of discourse analysis and genre theory provide a conceptual framework. Students do not need backgrounds in accounting or finance to manage this course.", "prerequisites": "Completion of 8.0 credits with a minimum CGPA of 2.0"}, {"name": "WRI363H5 • Communicating in a World of Data", "description": "This course examines how professionals in a variety of contexts communicate data. The course explores the growing relevance and allure of data in all its forms. Students will learn to interpret data to tell a story through numbers by creating infographics, writing informative articles from their own data mining, and presenting further findings at the end of the semester.", "prerequisites": "Completion of 8.0 credits with a minimum CGPA of 2.0"}, {"name": "WRI365Y5 • Editing: Principles and Practice", "description": "Examines theory and practice of editing in a professional communications environment. The course will consider principles of editing and the editorial process as it applies to various forms of writing, from daily news, to magazines, books, web pages and blogs. Study will include examination of the building blocks of an editor's skills - grammar, spelling, syntax, punctuation - and the means employed by an editor working with a writer to achieve clarity, accuracy and immediate comprehension.", "prerequisites": {"and": [], "or": ["WRI227H5", "WRI273H5", "WRI291H5", "WRI292H5", "WRI293H5"]}}, {"name": "WRI370H5 • Writing about Place", "description": "Examines writing about geographic places and the multiple rhetorics --- scientific, historical, geographical, social, political, economic --- that come into play. Students will design and carry out original primary research to develop their writing projects.", "prerequisites": {"and": [], "or": ["WRI227H5", "WRI273H5", "WRI291H5", "WRI292H5", "WRI293H5"]}}, {"name": "WRI375H5 • Writing about Environment and Ecology", "description": "Examines the evolving rhetoric of scientific, journalistic, legal and political writing about environmental issues. The course will consider eco-linguistic theory and eco-critical discourse analysis. Through theory and applied research, including primary research, and writing, students will consider protocols, research standards, and ethics in writing about environment and appraise current issues around the emerging language of sustainability.", "prerequisites": "Completion of 8.0 credits with a minimum CGPA of 2.0"}, {"name": "WRI380H5 • Podcasting", "description": "This course offers the skills and techniques needed to script, record and publish podcasts to the Web. Students will design and carry out original primary research to script, edit and produce independent podcasts. The course also explores the growing popularity of podcasts, and modern societies’ shift into a secondary orality.", "prerequisites": "Completion of 8.0 credits with a minimum CGPA of 2.0"}, {"name": "WRI390H5 • Independent Studies", "description": "A research/writing project designed by the student in consultation with a faculty member. Independent Study students will produce a substantial body of writing at a high professional standard submitted in weekly installments and will develop their drafts in editing sessions with other Independent Studies students. Students will also design and carry out a reading program. Students may not takeWRI390H5andWRI391H5in the same term.", "prerequisites": "8.0 credits including 1.5 WRI credits with a mark of 77% or higher in each and permission of course instructor or the PWC Director."}, {"name": "WRI391H5 • Independent Studies", "description": "A research/writing project designed by the student in consultation with a faculty member. Independent Study students will produce a substantial body of writing at a high professional standard submitted in weekly installments and will develop their drafts in editing sessions with other Independent Studies students. Students will also design and carry out a reading program. The Project Supervisor will be chosen in consultation with the Program Coordinator. Students may not takeWRI390H5andWRI391H5in the same term.", "prerequisites": "8.0 credits including 1.5 WRI credits with a mark of 77% or higher in each and permission of instructor or the PWC Director."}, {"name": "WRI395H5 • Re-languaging: Writing Across Cultures and Languages", "description": "Explores the practice and experience of writing across cultures, languages, and space. We examine writing as inflected through questions of translation, migration, colonialism, and social identity. Students will consider these themes through a historical and theoretical lens to sharpen analytic and writerly skills.", "prerequisites": "Completion of 8.0 credits with a minimum CGPA of 2.0"}, {"name": "WRI399H5 • Research Opportunity Program (ROP)", "description": "This course provides a richly rewarding opportunity for students in their third year to work in the research project of a professor in return for 399H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "A minimum of 10.0 credits or permission of instructor."}, {"name": "WRI399Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their third year to work in the research project of a professor in return for 399Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "A minimum of 10.0 credits or permission of instructor"}, {"name": "WRI410H5 • Professional Writing and Communication Internship 1", "description": "This course is a practical internship and is available only upon application from PWC Majors. Through a placement, students will apply their expertise in writing, editing and communications. Students must plan well in advance for their placement and work closely with CCIT/PWC placement officer to determine eligibility and suitability. A report of the placement, samples of work completed on the placement and a presentation about it will be required at the end of the placement. These, and the employer's assessment, will determine the course mark.", "prerequisites": "Completion of 13.0 credits with a minimum CGPA of 2.5 and approval of the internship coordinator/instructor, and evidence of additional career development (e.g. workshops, networking events, and professional communication with faculty, librarians, staff, and peers)."}, {"name": "WRI411H5 • Professional Writing and Communication Internship II", "description": "This course is a practical internship and is available only upon application from PWC Majors who have completedWRI410H5. The course is intended for students who have the opportunity to continue theirWRI410H5internship for a second semester. A report of the placement, samples of work completed on the placement and a presentation about it will be required at the end of the placement. These, and the employer's assessment, will determine the course mark.", "prerequisites": "(Completion of 13.0 credits including WRI410H5 or CCT410H5 or CCT409H5) and minimum CGPA of 2.5 and permission of the Internship Coordinator."}, {"name": "WRI420H5 • Making a Book", "description": "Examines principles, procedures and practices in book publishing. Students, working collaboratively, will collect material for, design, edit, typeset, print and assemble books. Students will consider philosophical, aesthetic, and economic factors that guide publishing, editing and design decisions. Students who do not receive formal permission may not take this course.", "prerequisites": "A minimum of 3.0 WRI credits and permission of instructor"}, {"name": "WRI430H5 • Journalistic Investigation", "description": "This course examines principles and practices in journalistic investigation and writing, and provides an introduction to the main socio-political issues related to contemporary journalism. The course will consider various models and formats of journalistic writing. Students will design and carry out investigative projects that culminate in a series of journalistic articles. The course will also analyze the Canadian media industry and its evolving labour market.", "prerequisites": "A minimum of 1.5 WRI credits and (WRI291H5 or WRI378H5)"}, {"name": "WRI470H5 • Writing Futures", "description": "This course examinesspeculative non-fictionand explores ways writers communicate about research, projections, and plans for humanity’s future. Students will consider how writing and other cultural forms act not only as “products” of science and reportage but as tools of knowledge-making. Students will produce portfolios that respond to and add to the literature of speculative non-fiction.", "prerequisites": "3.0 WRI credits "}, {"name": "WRI483H5 • Character, Narrator and Psychic Space", "description": "This course examines the central role of characterization and character development in nonfiction prose. Students explore the theory of psychic space, working to understand how the creation of that space operates to advance audience engagement. Classwork explores the furnishing and unfurnishing of psychic space in relation to meaning and characterization. Students focus on a small set of characters they develop over time via a writing portfolio. The course considers the impacts of place, incident, narrative arc, and complication-resolution models, with reference to theories by Gerke, French, Wolfe, and Van Manen. Weekly exercises and assignments focus on developing believable, memorable characters. Readings include a mix of student-authored and contemporary professional works.", "prerequisites": "2.0 WRI credits"}, {"name": "WRI488H5 • Food and Writing", "description": "This course examines narrative approaches to researching and writing about food-related topics. Students will design and carry out research projects that culminate in a series of life stories, narrative articles/chapters, or personal essays that investigate complex relationships surrounding food in society.", "prerequisites": "2.0 WRI credits"}, {"name": "WRI490H5 • Special Topics in Writing", "description": "An in-depth examination of topics in writing. Topics vary from year to year, and the content in any given year depends upon the instructor. The contact hours for this course may vary in terms of contact type (L, S, T, P) from year to year, but will be between 24-36 contact hours in total. See the UTM Timetable.", "prerequisites": "2.5 WRI credits and permission of instructor"}, {"name": "WRI499H5 • Research Opportunity Program (ROP)", "description": "This course provides a richly rewarding opportunity for students in their fourth year to work in the research project of a professor in return for 499H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "A minimum of 13.0 credits."}, {"name": "WRI499Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their fourth year to work in the research project of a professor in return for 499Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "A minimum of 13.0 credits."}]