[{"name": "JBH471H5 • Worlds Colliding: The History and Ecology of Exploration, Contact, and Exchange", "description": "An examination of contact in world history through both an ecological and a historical lens. Precise topics will depend on the year, but the focus will be on the creation of global systems and ecological challenges that continue to shape our world. In some years, students may have the option of participating in an international learning experience during Reading Week that will have an additional cost and application process. Students interested in this course will need to be approved for enrollment by the department and course instructors.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG101H5 • Introduction to the Study of Religion", "description": "Theories about the variety and nature of religious experience, personal and collective. How religious life is expressed in such forms as myth, narrative and ritual, systems of belief and value, morality and social institutions.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG201H5 • Introduction to Religion in the Literary, Visual, and Performing Arts", "description": "An examination of the interplay between religion and aesthetics, as expressed through the literary, visual, and performing arts. Structured thematically rather than by religious tradition, this course covers topics such as the creative word, visual representation of the divine through icons and iconography, sacred space and religious architecture, religion and the book arts, religious music, dance, and drama, visual narrativization, and religious ritual as performance.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG202H5 • Introduction to Judaism", "description": "This course studies Jewish religious thought and activity in both ancient and modern times through selected biblical, rabbinic, medieval, and modern Jewish writings. It explores the roots of Jewish religion, the variety of Jewish traditions, and how these traditions worldwide have been transformed throughout history.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG203H5 • Introduction to Christianity", "description": "An introduction to the diverse history of Christianity, ranging from the origins of the Jesus Movement in the Roman Empire to the development of the largest religious tradition in the world with over two billion adherents and thousands of denominations spread across the globe.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG204H5 • Introduction to Islam", "description": "What does it mean to be Muslim? This course explores the cultural and historical development of Muslim life and religious expression. Topics and themes addressed in the course include the Prophet Muhammad, the Qur’an and hadith, law, arts and architecture, material devotion, Sufism, Shiʿism, ritual, and modern movements.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG205H5 • Key Themes in South Asian Religions", "description": "How do we approach the extraordinary diversity of South Asian religious history? Students will explore key terms cutting across religious traditions: sacrifice, worship, ritual, practice, duty, scripture, canon, and doctrine. This course is a general introduction and presupposes no prior knowledge about South Asia.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG206H5 • Introduction to Buddhism", "description": "Philosophy of peaceful meditation or ideology of late capitalism? Both or neither? In this course you will learn through texts, images, objects, voices, and events how Buddhists through history have expressed their aspirations and anxieties, their thoughts and devotion, to discover how this religion changed and grew over time, and how it is being practised and applied today.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG207H5 • Introduction to Sikhism", "description": "This course surveys the history of Sikhism from its beginnings as a devotional movement in late medieval Punjab to its transformation during the colonial period. Students will learn about the historical development of core Sikh doctrines, practices, and institutions.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG208H5 • Iran before Islam: Introduction to Zoroastrianism", "description": "This course studies the history of Zoroastrianism, a religion born in Iran over 3,000 years ago. It analyzes its main doctrines and practices, provides an overview of its sacred literature and arts, and explores its interactions with other religions of the eastern and of the western world through the millennia.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG209H5 • Introduction to Indigenous Traditions", "description": "Indigenous traditions constitute the majority of the world's religions. They encompass the whole earth, and are incredibly diverse. So: where to begin? This course will introduce students to the vast array of global Indigenous traditions in both historic and contemporary contexts by looking comparatively at selected beliefs and practices. Attention will also be paid to Indigenous responses to colonialism and to the ways in which many communities are reviving their traditions.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG210H5 • Introduction to Hinduism", "description": "Hinduism is today the world’s third largest religion, with over one billion practitioners. In this course, students will learn about Hindu philosophy, literature, music, art, architecture, and ritual practices. A special focus will be on interactions between Hinduism and other South Asian religious traditions.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG211H5 • Introduction to Religion, Media, and Popular Culture", "description": "How does religion shape popular culture? How does popular culture shape religion? This course traces a history of these questions from the early modern period through the twenty-first century by looking at fairs and folk culture; mass broadcast media like radio, film, and television; and the rise of digital culture. Topics covered vary by semester, but could include religious comic books, televangelism, mass-mediated religious violence, online pilgrimage, digital occultism, etc.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG300H5 • Religion at the Edge of Tomorrow", "description": "What will religion look like in 2100? This course asks how early twenty-first century society is using religion to imagine its future around such questions as climate change, neoliberalism, authoritarian capitalism, pandemics, artificial intelligence, etc. Readings pair history, anthropology, and critical theory with science fiction, news media, and visual culture.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG301H5 • Stranger Things: Religious Objects in Theory and Practice", "description": "This course surveys major theories of religious objects and icons from the 18th through the 21st century in order to problematize the categories of fetish, totem, and idol. It presents the study of material religion as integral to the broader study of religion, media, and culture.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG302H5 • Sufism", "description": "This course focuses on the history, institutions, and practices of Sufism, popularly referred to as Islam’s “mystical” dimension. This course will examine the origins of Sufism, the development of metaphysical and theoretical thought, poetry, the emergence of Sufi orders, and shrine-based practices from the Middle East, South Asia, Africa, China, and the West.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG303H5 • Islam in South Asia", "description": "This course focuses on the history of Islam in South Asia from the 8th century to the present with an emphasis on religio-politics, the role of Sufism, Shi'ism, ritual, devotional and material practices, and questions of Islamic identity. Students will read primary sources in translation and examine art, architecture and material culture reflecting the historical depth and religious diversity of Muslims in South Asia.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG304H5 • Islamic Spiritual Traditions", "description": "An investigation of the spiritual traditions in Islam, covering the development of Sufism and other esoteric schools of Islamic thought. The historical evolution of devotional traditions, philosophical schools and scriptural hermeneutics are explored.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG305H5 • Islamic Aesthetic Traditions", "description": "This course explores aesthetic traditions in the Muslim world, including art, architecture, music and literature. Case studies may range from the majestic Taj Mahal to the sonorous voice of Umm Kulthum, from the enthralling worlds of the 1001 Arabian Nights to the lilting lyricism of poets like Hafiz and Rumi.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG306H5 • Shi'i Islam", "description": "An exploration of the history, thought and institutions of the Shi'i interpretation of Islam. The early Shi'i milieu, Zaidi, Ismaili and Twelver Shi'ism and the development of the Shi'i school of thought from early to modern times will be studied in this course.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG307H5 • Indian Scholasticism", "description": "A general introduction to Indian scholasticism through the organizing rubric of the human ends (purusarthas): pleasure, power, moral order, and liberation. Intellectual traditions covered may include the science of desire, aesthetics, the science of power, analysis of the socio-moral order, hermeneutics, and metaphysics.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG308H5 • Monuments, Inscriptions, and Narratives in South Asia", "description": "How do we interpret traces from the past? In the study of South Asia, we have access to a range of material data, inscriptions, legendary accounts, and historiographic poetry. This course explores the use of these sources in different periods and regions.", "prerequisites": "2.0 HIS credits or 1.0 BIO credit at the 300 level and permission of instructor."}, {"name": "RLG309H5 • Muslim Lives, Ritual Practices", "description": "This course will introduce students to topics including aspects of how Islam shapes life-cycle rituals, pilgrimage practices, cycles of fasting and feasting, healing practices, foodways, and votive offerings. Using primary sources, including ethnographic studies, documentaries, images, and food, we will examine case studies drawn from Sunni, Shiʿi, and Sufi traditions in the Middle East, South Asia, North Africa, and beyond.", "prerequisites": "RLG204H5"}, {"name": "RLG310H5 • The Ramayana", "description": "A study of the Ramayana of Valmiki in translation. Themes include aesthetic, ethical, and socio-political issues in the text, as well as commentary and the rise of Rama worship.", "prerequisites": "RLG204H5"}, {"name": "RLG311H5 • Religion and Ecology", "description": "This course explores how ecological concerns have influenced and challenged contemporary religious traditions and non-traditional forms of religious expression. We will also consider how religious traditions themselves have shaped or contributed to the environmental crisis.", "prerequisites": "RLG204H5"}, {"name": "RLG312H5 • How to Study Religion", "description": "What is religion? How should we study it? This course gives students the opportunity to ask the big, messy questions about religion, and to see how scholars know what they know about it. Students will learn key theoretical ideas and research methods, and then apply them in their own projects.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG313H5 • The Literature of Ancient Israel", "description": "The Hebrew Bible (i.e. the Old Testament) is not a single book, but an anthology selected from a larger body of ancient Jewish literature reflecting different authors, historical circumstances, literary genres, and religious agendas. This course familiarizes the student with critical study of the Hebrew Bible and related literature of ancient Jewish communities (Apocrypha, Pseudepigrapha, Dead Sea Scrolls). Among the topics to be examined are the basic forms of ancient Hebrew literature, the issues of textual development, the process of canonization, and the ancient Near Eastern cultural environment from which this literature emerged.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG314H5 • Religion and Gender", "description": "This course focuses on the interaction of gender and religion from a comparative and multidisciplinary perspective; topics include creation myths, authority and leadership, sainthood, expressions of the divine, and gendered ritual.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG315H5 • Biblical Wisdom and Poetry", "description": "Ancient Jewish sages understood wisdom as a \"skill in living.\" Wisdom for them was an approach to life, a way of looking at the world, and a quest for meaning and purpose in the relationships with God and fellow human beings. Some of history's most enduring collections of ancient wisdom are included in the Hebrew Bible (i.e., Old Testament) books of Job, Proverbs and Ecclesiastes. Wisdom perspectives are also found in the Song of Songs and many of the Psalms. Sometimes joyful and exultant, at other times cynical and fatalistic, the ancient sages wrestled with the ups and downs of life, and grappled with them rationally from the perspective of experience and community wisdom. This course investigates the genre of wisdom literature - its style, language, and historical and theological backgrounds - and explores the pluriformity of the biblical heritage.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG316H5 • Religion and Violence", "description": "Is violence inherent in religion? Most religious traditions include teachings that profess a love of peace, and yet these same traditions have motivated some of the most atrocious acts of violence in human history. This course will explore this issue through a critical and comparative examination of theories of different forms of religious violence (e.g., terrorism, sacrifice, patriarchy, colonialism). This examination will in turn involve considering violence in various historical and contemporary religious texts, practices, beliefs, and events.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG317H5 • Religion and Science", "description": "Are scientific and religious practices and ways of understanding unrelated? Contradictory? Complementary? What assumptions are made when we practice religion or science? And what do we assume when we attempt to interpret these practices? This course explores the relationships between religion, science, and academic interpretation in the contemporary world.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG318H5 • Jainism", "description": "This course offers students a historical glimpse at an ancient religion that has had a key influence on values that shape our world today: that not-harming should inform all our actions, that the truth consists in the awareness of contradictory views, or that the main quality of personality is self-improvement.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG319H5 • Magic, Astrology, and Religion", "description": "This course studies the interplay between religion, magic, and astrology. It analyzes how magic and astrology have been viewed in history by different world religions, and how these religions have integrated, or excluded, magical practices and astrological beliefs in their mainstream practices and beliefs.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG323H5 • Jesus of Nazareth", "description": "Analytic and comparative study of the earliest accounts of the life of Jesus of Nazareth in the canonical and non-canonical Gospels with a supplementary focus on historical reconstructions of Jesus using broader textual, cultural, and archaeological data.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG324H5 • Paul and Earliest Christianity", "description": "An exploration of the literary form and theological content of Paul's letters in the New Testament, including analyses of the importance of Paul in the rise, spread, and development of what would become earliest Christianity.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG325H5 • Visions and Revelations", "description": "Apocalyptic literature, concerned with the expectation of imminent, radical and transforming intervention of the divine into human history, flourished between 200 BCE and 200 CE. This course provides an introduction to the study of the origin, form and function of ancient Jewish and related apocalyptic literature understood in its cultural and literary contexts.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG326H5 • Early Christianity and Rabbinic Judaism", "description": "This course examines how Rabbinic Judaism and Christianity interacted in late antiquity. It explores the processes by which each community (in competition with the other and shaped by a wider social context) formed an identity for itself by establishing an \"orthodox\" set of beliefs, rituals, moral guidelines, and spiritual ideals.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG330H5 • Topics in Judaism", "description": "A detailed study of selected aspects of Judaism.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG331H5 • Religion on Screen", "description": "How have screen-based media technologies (cinema, television, computers, smart phones, video games, etc.) shaped the practice and representation of religion from 1890s till today? What is the relationship between screen cultures and visual religion? Topics may include: magic shows and early cinema; religion in classical Hollywood; devotional websites or zombies.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG332H5 • Reel Religion", "description": "This course uses theories and methods from the study of religion to understand narrative and visual aspects of films that are not explicitly religious. Genres of films may include comedy, horror, action, drama, and sci-fi. Approaches may include the tudy of rituals, symbols, myth, gender, politics, sacred figures, and psychology.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG333H5 • Biblical Themes in Modern Literature", "description": "This course examines the role and representation of various biblical traditions, teachings, and themes in a few selected works of fiction. Topics may include: covenant, freedom, evil, conquest, love, power, suffering, parables, education, and grace. No previous knowledge of the Bible is required.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG337H5 • Christmas: A History", "description": "A broad historical survey of Christmas ranging from the earliest accounts of Jesus’ birth in the New Testament up to contemporary debates about the place of Christmas and its celebration in the public sphere.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG340H5 • Topics in Christianity", "description": "A detailed study of selected aspects of Christianity.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG342H5 • Holy Heroes: The Lives and Legacies of Christian Martyrs", "description": "Though it promises eternal life, Christianity was forged in death. By considering narrative accounts of early Christian martyrdom, including the development of the cult of the saints, this course examines how persecution and death have shaped the culture of Christianity for two thousand years.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG346H5 • Early Modern Christianity", "description": "A study of the ways in which Protestant and Catholic Christians contributed to and reacted against the complex intellectual, political, and social changes in Europe from the sixteenth to the eighteenth century.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG347H5 • Zoroastrian Religious Writings", "description": "The course studies passages of Zoroastrian texts, principally from pre-Islamic times, in English translation. These passages are studied from the doctrinal point of view, and placed in the context of the history of Zoroastrianism. In addition, their points of contact with the texts of other religious literatures are analyzed.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG348H5 • Zoroastrian Customs and Ceremonies", "description": "The course analyzes the religious practices and the daily practices having a religious background, performed by the Zoroastrians in modern times. Their historical development is analyzed, considering, for the medieval and modern times, the influence of the environment of the countries where Zoroastrians lived, and where they represented a minority. Also highlighted is the significance of these practices in relationship to the Zoroastrian doctrinal system.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG349H5 • Medieval Christianity", "description": "Spanning a millennium from the fall of Rome to the Protestant Reformation, this course explores the many ways in which the western branch of Christianity, based in Rome, shaped the religion, society, culture, and politics of emerging Europe.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG350H5 • Topics in Islam", "description": "A detailed study of selected aspects of Islam.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG351H5 • Major Themes in the Study of the Quran", "description": "An introduction to the Quran, the scripture of Islam. Surveys of the history of the text and the development of traditions of Quranic interpretation and commentary, including tafsir and ta'wil, from early to modern times.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG352H5 • Jews and Muslims: The Medieval Encounter", "description": "This course examines the encounter between Jews and Muslims during the Middle Ages, when a large majority of the Jewish people subsisted under Muslim rule: an overview of the religious, political, communal, material and intellectual settings of the Judaeo-Muslim experience.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG356H5 • Persia and Beyond: Christianity in Asia to 1300", "description": "This course will examine the origins of Syriac-speaking Christianity on the eastern fringes of the Roman world, and chart its spread into Persia, Central Asia, China, and India. In contrast to the situation in Byzantium and in the Latin West, Christians in Asia lived (with few exceptions) as religious minorities under Zoroastrian, Muslim, Confucian, or Hindu rulers. We shall consider how these Christians adapted to regional cultures, engaged the political structures of the day, and developed their own unique theological and spiritual traditions.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG357H5 • Contemporary Global Christianity", "description": "An exploration of the changing face of Christianity in the twentieth and twenty-first centuries focusing on such topics as: Christianity in the Global South; new religious movements within Christianity; and intra- / inter-religious debates and conflicts in contemporary Christianity.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG358H5 • Christianity in Late Antiquity: From Persecuted Sect to Imperial Religion", "description": "Beginning at the end of the Apostolic Age and continuing up to the seventh-century confrontation with early Islam, this course examines the evolution of Christianity from a persecuted sect to the predominant religion of the Roman and Byzantine Empires, with a particular focus on the Eastern Mediterranean and Mesopotamian contexts.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG359H5 • The Orthodox Church of the Byzantine Empire", "description": "By the end of the fourth century, Constantinople was becoming the centre of a distinct branch of the Christian Church. This course will explore the formation and development of this \"Eastern Orthodox\" Christianity, including its theology, religious practices, social and cultural impact, and relationship to political power.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG360H5 • Topics in South Asian Religions", "description": "A detailed study of selected aspects of South Asian Religions.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG361H5 • Encounters Between Indo-Islamic and Hindu Cultures", "description": "This course explores historical encounters between Indo-Islamic and Hindu cultures in pre-colonial South Asia, including narratives of conquest and resistance, iconoclasm and the reuse of images, patterns of courtly dress, translations of Sanskrit sources into Persian, indigenous Islamic practices, and sufi and bhakti poetry.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG362H5 • Hindu and Muslim Worlds in Modern South Asia", "description": "Using primary texts as well as films, art, and architecture, this course explores the interbraided cultures of Islam and Hinduism in South Asia from the early modern period through the present day. It examines colonialism and nationalism’s effect on Hinduism and Islam and religion’s role in modern South Asian culture.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG363H5 • Hinduism in Documentary Film", "description": "How does film capture religious experience? This course explores this question via nonfiction films about Hinduism in both South Asia and the diaspora, with attention to various nonfiction film genres and various modes of religious life (e.g., pilgrimage, Vedic ritual, asceticism, family-based devotion).", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG365H5 • From Murti to Meme: The Image in South Asian Religions", "description": "Since antiquity, icons and images have been a key mode of religious life in South Asia. How has the rise of mass media reshaped image-based religion? How has religion shaped mass-mediated visual culture in South Asia and beyond? This course pursues these questions through a series of case studies on topics like poster art, comic books, film, monumental statues, WhatsApp, TikTok, and other media.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG366H5 • Icon and Iconoclasm in South Asia", "description": "This course focuses on the history of the image in Hinduism, Buddhism, Christianity, Sikhism, and Islam in South Asia. What is an icon, an image, a representation, and what is the ritual function of each form? When is the destruction of an icon and act of “iconoclasm”? In this course we consider acts of political plunder, reuse and rebuilding (spolia), and the power of the visual in shaping South Asian religious lives.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG370H5 • Topics in Buddhism", "description": "A detailed study of selected aspects of Buddhism.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG371H5 • Buddhist Thought", "description": "The course deals with the historical development of doctrines and controversies pertaining to the most important schools of Buddhist thought up to the end of the first millennium CE. It discusses the relationship of reason, belief and practice while giving a closer look at Buddhist positions on specific philosophical questions.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG373H5 • Buddhist Practices and Institutions", "description": "A study of Buddhist institutions and practices, this course varies in focus. Topics may include devotion, alms-giving, meditation practices, literature, hagiography, monastic codes, artistic and material histories, and/or the political and economic features of Buddhist institutions in particular times and places.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG374H5 • Buddhist Literatures", "description": "The course looks at popular Buddhist educational storytelling, courtly dramas, Buddhist poetry or the life-histories of the buddhas, bodhisattvas and Buddhist holy men and women. It reflects on how popular motifs, aesthetic styles and literary media have helped transport Buddhist doctrines across various times, regions and languages.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG378H5 • Museums and Material Religion", "description": "Museums have long collected and curated religious objects for public audiences, with missionaries as a primary collections source. Multiple visits to the Royal Ontario Museum and other museums will enable students to think critically about how museums received and presented these objects, while engaging with the challenges of museum curation.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG380H5 • Topics in Comparative Religions", "description": "An in-depth study of the main teachings, practices and institutions of the major, and several of the minor, religious traditions: namely, Buddhism, Christianity, Confucianism, Hinduism, Islam, Jainism, Judaism, Shinto, Sikhism, Taoism and Zoroastrianism.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG381H5 • Topics in Zoroastrianism", "description": "A detailed study of selected aspects of Zoroastrianism.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG382H5 • The Divine Comedy: A Spiritual Journey", "description": "This course studies the “Divine Comedy” by Dante Alighieri (1265–1321), a poem describing the author’s journey through the afterlife. It analyzes the religious themes of the text, highlighting how different traditions, such as Christianity, Judaism, Islam and Paganism, contributed to Dante’s shaping of the imaginary structure of the otherworldly spaces.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG388H5 • Special Topics", "description": "A comprehensive study of special topics in the history of religions.", "prerequisites": "RLG101H5 and 1.0 additional RLG credits"}, {"name": "RLG399Y5 • Research Opportunity Program", "description": "For senior undergraduate students who have developed some knowledge of a discipline and its research methods, this course offers an opportunity to work on the research project of a professor. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. Project descriptions for the following fall-winter session are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of a minimum of 8.0 to 10.0 credits. (Amended)"}, {"name": "RLG401H5 • Advanced Topics in Religion and the Literary, Visual, and Performing Arts", "description": "A critical exploration of selected topics concerning the relationship between religion and aesthetics, as expressed through the literary, visual, and performing arts. The focus in any given year may be on a particular tradition, or on broader, comparative understandings of \"religion.\" Similarly, the course may concern one specific art form or a variety of forms, including architecture, dance, film, literature, music, visual art, etc.", "prerequisites": "RLG101H5 and 1.5 RLG credits"}, {"name": "RLG402H5 • Religion and Stories", "description": "Stories are central to sacred texts and to creating meaning generally. This course examines different types of stories using approaches from the study of religion. Stories may come from religious traditions or anywhere else, and may involve various media such as books, films, video games, popular music, graphic novels, podcasts, etc.", "prerequisites": "RLG101H5 and 1.5 RLG credits."}, {"name": "RLG411H5 • Advanced Topics in Religion, Media, and Culture", "description": "A critical exploration of selected topics concerning the relationships among religion, media and culture. The focus in any given year may be on a particular religious tradition or on a broader thematic question. Assigned readings typically include a combination of visual and written cultural texts, as well as works of cultural and social theory. Content in any given year depends on instructor. See Department of Historical Studies website atwww.utm.utoronto.ca/historicalstudiesfor details.", "prerequisites": "2.0 RLG credits"}, {"name": "RLG412H5 • Theorizing Religion", "description": "This course gives advanced students the opportunity to pursue in-depth study of major classic and contemporary texts in critical theory, cultural studies, and the philosophy of religion. Topics may include: religion and politics; crises of faith; psychology of religion.", "prerequisites": "RLG101H5 and 1.5 RLG credits."}, {"name": "RLG415H5 • Advanced Topics in the Study of Religion", "description": "A critical exploration of selected topics in the study of religion. As part of this course, students may have the option of participating in an international learning experience that will have an additional cost and application process.", "prerequisites": "2.0 RLG credits"}, {"name": "RLG420H5 • Women and Gender in Early and Medieval Christianity", "description": "This course combines lecture and seminar approaches to understand how ideas about women, gender, and the body were constructed and naturalized in ancient and medieval Christianity.", "prerequisites": "RLG203H5 and 1.5 RLG credits"}, {"name": "RLG421H5 • South Asian Epics", "description": "An exploration of South Asian literary and oral epics moving across boundaries of language and genre. Students will engage with a variety of performative and aesthetic traditions including the Ramayana and the Mahabharata, Buddhist narratives, Sufi poetry, and vernacular epics. We will situate heroic, sacrificial, and romance genres in their social and performative contexts.", "prerequisites": "(RLG205H5 or RLG210H5) and 1.5 RLG credits"}, {"name": "RLG422H5 • Religion and the Senses in South Asia", "description": "This course focuses on Hindu, Muslim, Buddhist, and Sikh objects and rituals, and we will read primary sources and scholarship in religious studies, anthropology, and ritual theory. Topics may include the gaze in the formation of icons and images, votive offerings, feasts and fasts, smells (perfumery and corpse disposal), and the aesthetics of religious architecture.", "prerequisites": "(RLG204H5 or RLG205H5 or RLG207H5 or RLG210H5) and 1.5 RLG credits"}, {"name": "RLG423H5 • Ritual and Material Practice in South Asian Islam", "description": "In this course we examine the intersection of material practices and senses in South Asian Islamic rituals in how religious worlds are experienced. The course also focuses on the role of ritual and material culture in shaping South Asian Muslim identities (Sunni, Shiʿi, Sufi).", "prerequisites": "RLG205H5 or RLG303H5 and 1.5 RLG credits"}, {"name": "RLG430H5 • Advanced Topics in Judaism", "description": "A critical exploration of selected topics in the history of Judaism.", "prerequisites": "(RLG202H5 or RLG330H5) and 1.5 RLG credits."}, {"name": "RLG435H5 • The Dead Sea Scrolls", "description": "This course provides a survey of the Dead Sea Scrolls, a brief history of the period in which the Scrolls were written, and a presentation of the various ways in which scholars have interpreted them. The course also includes in-depth study of selected texts and themes illuminating the formation of the Hebrew Bible, ancient Judaism, and the historical and theological background of the New Testament and early Christianity.", "prerequisites": "(RLG202H5 or RLG203H5) and 1.5 RLG credits"}, {"name": "RLG440H5 • Advanced Topics in Christianity", "description": "A critical exploration of selected topics in the history of Christianity.", "prerequisites": "(RLG203H5 or RLG340H5) and 1.5 RLG credits"}, {"name": "RLG442H5 • Desert Solitaire: Christian Monasticism and the Ascetic Tradition", "description": "This course explores the history and significance of Christian monasticism and asceticism, with a focus on the desert tradition. From the early Desert Fathers and Mothers to contemporary spiritual writers, we consider the enduring legacy of solitude, silence, and self-discipline in the history of Christianity.", "prerequisites": "RLG203H5 and 1.5 RLG credits"}, {"name": "RLG445H5 • Making Martyrs: From Socrates to the Suicide Bomber", "description": "Comparative study of martyrdom and the idea of the martyr beginning with Greco-Roman philosophical concepts of 'noble death' and continuing through Judaism, Christianity, and Islam in ancient, medieval, and contemporary contexts.", "prerequisites": "2.0 RLG credits"}, {"name": "RLG448H5 • Approaches to the Academic Study of Islam", "description": "This seminar introduces advanced undergraduate students to the history, genealogies, theories, and methods that have shaped the academic study of Islam and Muslims in the discipline of religious studies.", "prerequisites": "RLG204H5 or RLG303H5 and 1.5 RLG credits"}, {"name": "RLG449H5 • Islamic Sexualities", "description": "This course focuses on the diverse attitudes and expressions of sexuality in Islam. Taking a broad approach, this course examines issues of sexuality, including homosexuality, fe/male sexuality, birth control, divorce, marriage, transgender identity and performance, and feminist sexual ethics.", "prerequisites": "RLG204H5 and 1.5 RLG credits"}, {"name": "RLG450H5 • Advanced Topics in Islam", "description": "A critical exploration of selected topics in the history of Islam.", "prerequisites": "(RLG204H5 or RLG350H5) and 1.5 RLG credits"}, {"name": "RLG451H5 • Islamic Literatures", "description": "This course is an in depth exploration of the literary traditions of the Islamic world. The course examines the influence of religion in the writings of Muslim authors, as well as the role of symbols, philosophy, mystical practice, ideologies, rituals and history in the creation of literary works such as poetry, novels, biographies, court chronicles, epics, and more.", "prerequisites": "2.0 RLG credits"}, {"name": "RLG452H5 • Anthropology of Islam", "description": "This course focuses on the everyday lived experience of Muslims in different parts of the world. We will read ethnographic studies and analyze films, which highlight important issues in everyday Muslim life: gender, modernity and piety, the role of ritual in everyday practice. This course has an ethnographic field project.", "prerequisites": "RLG204H5 or RLG350H5 and 1.5 RLG credits."}, {"name": "RLG453H5 • Researching Islam: Entering the World of Scholarly Investigation", "description": "How do academics research Islam? Students in this course learn about and gain hands-on experience with essential scholarly tools for discovering and disseminating new knowledge in this field. Both individually and collaboratively, students will work on original projects concerning academic literature, scholarly communication, or primary sources.", "prerequisites": "2.0 RLG credits"}, {"name": "RLG460H5 • Advanced Topics in South Asian Religions", "description": "A critical exploration of selected topics in the history of South Asian religions.", "prerequisites": "(RLG205H5 or RLG210H5 or RLG360H5) and 1.5 RLG credits"}, {"name": "RLG461H5 • Religion and Aesthetics in South Asia", "description": "South Asian religious traditions are suffused with aesthetic elements and processes -- Hindu temple worship, for example, abounds in music, song, dance, and iconography. In this course we examine the close relationship between religion and aesthetics in South Asia through study of poetics, courtly poetry, visual culture, music, and performance traditions.", "prerequisites": "(RLG205H5 or RLG210H5) and 1.5 RLG credits"}, {"name": "RLG462H5 • Sex and Gender in South Asian Religions", "description": "This course examines ideas, roles, and regulation of sexuality and gender in South Asian religious traditions, paying attention to sexual abstinence and promiscuity as forms of piety, and we will examine performances of the gendered body that transcend and/or problematize the binary construction of masculine and feminine.", "prerequisites": "(RLG101H5 or RLG205H5 or RLG210H5) and 1.5 RLG credits"}, {"name": "RLG463H5 • Genealogies of South Asian Religions", "description": "This course looks at debates surrounding central concepts in the study of South Asian religions. We will look at theories of asceticism, devotion, renunciation, caste, kingship, ritual, and state that animate the discussion of Hinduism, Buddhism, and Islam. Students will learn to place their ideas in conversation with larger intellectual genealogies.", "prerequisites": "(RLG204H5 or RLG205H5 or RLG206H5 or RLG210H5) and 1.5 RLG credits"}, {"name": "RLG464H5 • Saints, Royalty, and the State in South Asian Religions", "description": "This course focuses on the relationship between religious ideologies, saints, and state power in ancient, medieval, and precolonial Hindu, Buddhist, Sikh, and Muslim states in South Asia. We will read primary sources in translation and examine art, architecture, and material culture to examine how kings and saints/ascetics negotiated politics and power.", "prerequisites": "(RLG205H5 or RLG210H5 or RLG303H5) and 1.5 RLG credits"}, {"name": "RLG465H5 • Sex and Renunciation in Sanskrit Poetry", "description": "This course examines the paradoxical relationship of the erotic in Sanskrit poetry with its opposite—renunciation and the technologies of asceticism involving a rejection of sexuality. While the treatment of these themes reflects a deeper civilizational history emblematized by the figure of Śiva, the erotic ascetic, Sanskrit courtly poetry allows us to examine problems peculiar to courtly life and kingship. Did the aestheticization of power in Sanskrit poetry conflict with transcendental ideals? How was the legitimacy of pleasure seen as both autonomous from and concurrent with other legitimate human ends? We will read all works in translation, and no familiarity with Sanskrit is presumed.", "prerequisites": "(RLG205H5 or RLG210H5) and 1.5 RLG credits"}, {"name": "RLG466H5 • The Sasanian Empire: Religions at the Crossroads in Ancient Iran", "description": "This course studies the religious life of the Sasanian empire that ruled over Iran between 224 and 651 CE. It analyzes how different religions coexisted and interacted in the territory of the empire, including Zoroastrianism (the official religion of the empire), Manichaeism, Christianity, Judaism, and Mazdakism.", "prerequisites": "(RLG202H5 or RLG203H5 or RLG208H5) and 1.5 RLG credits"}, {"name": "RLG470H5 • Advanced Topics in Buddhism", "description": "A critical exploration of selected topics in the history of Buddhism.", "prerequisites": "(RLG206H5 or RLG370H5) and 1.5 RLG credits"}, {"name": "RLG497Y5 • Independent Reading", "description": "Student-initiated project of reading and research, supervised by a member of the Department. Primarily intended for students in Specialist or Major programs. After obtaining a supervisor, a student must apply to the Department of Historical Studies. A maximum of 1.0 credit in a reading course is permitted.", "prerequisites": "2.0 RLG credtis"}, {"name": "RLG499H5 • Independent Reading", "description": "Student-initiated project of reading and research, supervised by a member of the Department. Primarily intended for students in Religion Specialist or Major programs. After obtaining a supervisor, a student must apply to the Department of Historical Studies. A maximum of 2 reading courses, amounting to 1.0 credit, is permitted.", "prerequisites": "2.0 RLG credits"}, {"name": "RLG499Y5 • Research Opportunity Program", "description": "For senior undergraduate students who have developed some knowledge of a discipline and its research methods, this course offers an opportunity to work on the research project of a professor. Students enrolled have an opportunity to become involved in original research, develop their research skills and share in the excitement and discovery of acquiring new knowledge. Project descriptions for the following fall-winter session are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of a minimum of 8.0 to 10.0 credits. (Amended)"}]