[{"name": "ENG299H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their second year to work on the research project of a professor. Students enrolled have an opportunity to become involved in original research, learn research methods, and share in the excitement and discovery of creating new knowledge. Professors' project descriptions for the following fall-winter session are posted on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ITA100Y5 • Beginner Italian", "description": "An introduction to the language for those with no prior knowledge of Italian. Students learn and practice basic rules of grammar and theme-based vocabulary, and they engage with various aspects of Italian culture.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ITA102H5 • Italian for Musicians", "description": "(Offered in Sulmona, Italy; Faculty of Music’s Centre for Opera Studies in Italy program) An introduction to the Italian language for students whose primary area of study is Music. Beginner language proficiency (grammar practice, oral communication, pronunciation, cultural fluency, etc.) are acquired through close readings of select librettos, depending on the pieces pre-selected for performance. In this course, students have the option of participating in co- and extra-curricular learning experiences. When those are offered, additional costs and application processes may apply.", "prerequisites": "Open to students who have successfully completed at least 4.0 full credits. Students who do not meet the prerequisite but are enrolled in any 100-level ENG or DRE course (except ENG100H5) may petition the department in writing for approval to take the course. See the guidelines for written petitions on the department website."}, {"name": "ITA200Y5 • Beginner - Intermediate Italian", "description": "A beginner to intermediate-level language course. The course provides a thorough review of grammatical structures designed to improve the students’ self-expressiveness in Italian. Selections from contemporary authors and passages dealing with present-day issues are also introduced as a basis for discussion in Italian.", "prerequisites": "ITA00Y5 or Grade 12 Italian"}, {"name": "ITA201Y5 • Beginner - Intermediate Italian (Offered in Florence, Italy)", "description": "(Offered in Florence)A beginner to intermediate-level language course. The course provides a thorough review of grammatical structures designed to improve the students’ self-expressiveness in Italian. Selections from contemporary authors and passages dealing with present-day issues are also introduced as a basis for discussion in Italian. In this course students will be participating in an international learning experience that will have an additional cost and application process. Students have the option of participating in co- and extra-curricular learning experiences. When those are offered, additional costs and application processes may apply.", "prerequisites": "ITA100Y5 or permission of the department."}, {"name": "ITA218H5 • Writings on Love and Sex (Medieval to Early Italian Renaissance)", "description": "(Offered in English) An exploration of literary representations of love and sex in Medieval and Renaissance Italy. Writers studied include Dante Alighieri, Francesco Petrarca, Giovanni Boccaccio. Texts will be available in Italian and English.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program, ITA100Y5 or permission of the department."}, {"name": "ITA221H5 • Italian Authors (20th Century Italy)", "description": "(Offered in English) An introduction to 20th-century Italian literature. Writers studied include Italo Calvino, Dacia Maraini, Elsa Morante, and Alberto Moravia. Texts will be available in Italian and English.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA100Y5 or permission of department"}, {"name": "ITA222H5 • Italian Authors (Late 20th to 21st Century Italy)", "description": "(Taught bilingually: English and Italian) A study of late 20th- to 21st-century Italian literature. Writers studied include Niccolò Ammaniti, Andrea Camilleri, Elena Ferrante, and Margaret Mazzantini.", "prerequisites": "ITA100Y5 or permission of department."}, {"name": "ITA227H5 • Teaching and Learning a Second/Foreign Language", "description": "(Offered in English) This course provides an introduction to second language pedagogy with a particular focus on Italian. Students will learn key concepts in pedagogy and compare the teaching and learning processes and experiences of first and second language learners as well as the roles of classroom teachers and learners via the creation of linguistic portraits and pedagogical materials.", "prerequisites": "ITA100Y5 or permission of department."}, {"name": "ITA231H5 • Italian Authors (Medieval to Renaissance Italy)", "description": "(Offered in English) A survey of foundational authors, such as Dante, Petrarca, Boccaccio, Machiavelli, Tasso, Ariosto, Guicciardini, and their works, from the Medieval Period to the Renaissance. Texts will be available in Italian and English.", "prerequisites": "ITA100Y5 or permission of department."}, {"name": "ITA232H5 • Italian Authors (Baroque to Present Italy)", "description": "(Offered in English) A survey of foundation authors, such as Manzoni, Marino, Goldoni, Alfieri, Eco, Ginzburg, Levi, Ferrante, and their works, from the Baroque to present times. Texts will be available in Italian and English.", "prerequisites": "ITA100Y5 or permission of department"}, {"name": "ITA233H5 • Italian Culture through Fashion", "description": "(Offered in English) An exploration of Italian fashion throughout the centuries, its presence in Italian literature (e.g. Dante, Castiglione, Leopardi), politics (e.g. Medici dynasty, fascism), movies (e.g.Roman Holiday,La dolce vita), television, and the influence of the “Made in Italy” brand globally. In this course, students have the option of participating in co- and extra-curricular learning experiences. When those are offered, additional costs and application processes may apply.", "prerequisites": "Open to all students."}, {"name": "ITA235H5 • Italian Culture through Food", "description": "(Offered in English) History through an examination of influential work in Italian literature (e.g. Artusi, Guerrini), art (e.g. Bellini, Caravaggio), and cinema (movements such as Neorealism, Comedy, Italian-Style). The course explores the relationship between the representation of food and questions of identity and diaspora and ponders a redefinition of authenticity. Students explore their own culinary patterns to discover links between history, food, culture, and identity.Students have the option of participating in local and international field trips (to restaurants, factories, farms). When travel experiences are offered, additional costs and application processes apply.", "prerequisites": "Open to all students."}, {"name": "ITA237H5 • Italy, from 1815 to 1960", "description": "(Offered in English) This course addresses key aspects of contemporary Italy by exploring the foundational events that shaped it, such as Unification, World War I, World War II, and the Economic Boom of the 1950s-60s. Investigative sources include short stories, novels, sociological and historical documents, and popular articles. In this course, students have the option of participating in co- and extra-curricular learning experiences. When those are offered, additional costs and application processes may apply.Texts will be available in Italian and English.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA100Y5 or permission of department."}, {"name": "ITA238H5 • Italian Civilization (1960 to Present)", "description": "(Offered in English and Italian) An overview of key events in Italian civilization, from 1960 to present times, through a selection of various written materials and media. Topics include economy, the arts, media, and others. In this course, students have the option of participating in co- and extra-curricular learning experiences. When those are offered, additional costs and application processes may apply.", "prerequisites": "None; ITA100Y5 or ITA101Y5 required for students enrolled in an ITA Major or Specialist program only, as some written work will be submitted in Italian."}, {"name": "ITA242H5 • Italian Award-Winners, Box-Office Hits", "description": "(Offered in English) A study of the most critically acclaimed and/or financially successful Italian films. Students also consider the differences and similarities in audience reception, depending on where (in Italy or abroad) films are released. Films analyzed includeBicycle Thieves,TheGreat Beauty,Life Is Beautiful,The Postman. In this course, students have the option of participating in co- and extra-curricular learning experiences. When those are offered, additional costs and application processes may apply.", "prerequisites": "None; ITA100Y5 or ITA101Y5 required for students enrolled in an ITA Major or Specialist program only, as some written work will be submitted in Italian."}, {"name": "ITA247H5 • Contemporary Italian Cinema", "description": "(Offered in English) A study of Italian cinema and key themes that have emerged from the silver screen since the 1980s (e.g. family matters, celebrity culture, the crisis of cinema and the cinema of the crisis, identity and immigration, religion, crime, politics). Films analyzed includeIl divo,Habemus Papam,Mediterranea,Nuovo cinema paradiso,Reality,The Son’s Room,Suburra,Videocracy.", "prerequisites": "Open to all students, however, if enrolled in an Italian Minor, Major or Specialist program, ITA100Y5 is required."}, {"name": "ITA255H5 • Italian-Canadian Studies: Historical and Socio-Linguistic Perspectives", "description": "(Offered in English) A portrait of Italian immigration through Diaspora Studies, history, and sociolinguistics. Students will also explore the journeys of their own communities. Texts will be available in Italian and English.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA100Y5 or permission of department."}, {"name": "ITA256H5 • Italian-Canadian Studies: Literature, Theatre, Cinema", "description": "(Offered in English) A portrait of Italian immigration through artistic expression in the works of, for example, De Cicco, De Michele, Patriarca, Ricci, and others, to highlight the voices that helped to establish/shape Italian-Canadian Studies. Students will have the opportunity to interact with writers, directors, and artists from the Italian-Canadian community.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA100Y5."}, {"name": "ITA272H5 • Italian Linguistics", "description": "(Offered in English) An introduction to Italian Linguistics through a study of modern Italian phonetics and phonology, morphology, syntax and semantics. Comparisons are also made between current trends in Italian linguistics and other languages with which students are familiar. Texts will be available in Italian and English.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA100Y5."}, {"name": "ITA299Y5 • Research Opportunity Program", "description": "An opportunity to conduct in-depth original research with a supervising professor. Students learn research methods and share in the excitement and discovery of acquiring new knowledge. Students are invited to visitResearch Opportunity Programfor a list of participating faculty projects and for application details.", "prerequisites": "ITA100Y5"}, {"name": "ITA307H5 • Italian Novels on the Big Screen", "description": "(Offered in English) A study of various onscreen adaptations of modern Italian novels, short stories, and plays. Authors and film directors studied include Giorgio Bassani, Bernardo Bertolucci, Eduardo De Filippo, Vittorio De Sica, Alberto Moravia, Ettore Scola, Giovanni Verga, Luchino Visconti.", "prerequisites": "None; ITA200Y5 or ITA201Y5 required for students enrolled in an ITA Major or Specialist program only, as some of their written work will be submitted in Italian."}, {"name": "ITA309H5 • Mafia Movies", "description": "(Offered in English) A study of organized crime and crime bosses and their representation onscreen, in American gangster films and in Italian movies about the mafia. Films analyzed includeDonnie Brasco, The GodfatherTrilogy,Gomorrah,Goodfellas,The Mafia Only Kills in Summer,Placido Rizzotto.", "prerequisites": "None; ITA100Y5 or ITA101Y5 will be required for students enrolled in an ITA Major or Specialist program only, as some of their written work will be submitted in Italian."}, {"name": "ITA311H5 • Italian Cinema: Comedies and Comedians", "description": "(Offered in English) This course examines an integral part of Italian cinema -Commedia all'italiana(Comedy, Italian Style) of the 1950s, and the ways in which it continues to influence film comedies today. As the subgenre is deeply rooted in the external contexts that surround a film’s release, discussions will attempt to answer whether laughter can indeed be the best medicine. Films analyzed includeDivorce Italian-Style, The Easy Life, Life Is Beautiful, Marriage Italian-Style, Quo vado?.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA200Y5 or ITA201Y5 or permission of department."}, {"name": "ITA313H5 • Italian Cinema: The Effect of Spaghetti Westerns on the Films of Quentin Tarantino", "description": "(Offered in English) This course explores the influence that Spaghetti Westerns and, in particular, the works of Sergio Leone had on the Italian-American auteur, Quentin Tarantino. Works, from both Leone and Tarantino, are analyzed through a variety of lenses (cinematographic, cultural, theoretical). Films includeA Fistful of Dollars,The Good, the Bad and the Ugly,The Hateful Eight,Kill Bill,Once Upon a Time in America,Once Upon a Time in Hollywood,Pulp Fiction.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA200Y5 or permission of department. "}, {"name": "ITA315Y5 • Italian Theatre (19th to 21st Century)", "description": "(Offered in English, performances in Italian) A study of 19th- to 21st-century Italian plays and playwrights, culminating in the staging of a play from one of those eras. Students may take on acting and/or stage production roles.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA200Y5 or ITA201Y5 or permission ofdepartment."}, {"name": "ITA339Y5 • Exploring Italian Culture", "description": "(Offered in English) A study of key aspects of Italy’s past and present, contextualized within historical, political, and artistic frameworks. Topics of study include World Wars, Economic Booms and Crises, Organized Crime, and Gastronomy. In this course, students have the option of participating in co- and extra-curricular learning experiences. When those are offered, additional costs and application processes may apply. Please note that when this course is offered in Siena (Woodsworth - Study Abroad), the international learning experience will have an additional cost and application process.", "prerequisites": "Open to all students."}, {"name": "ITA342H5 • Italian Cinema: Neorealism", "description": "(Offered in English) A study of the Golden Age of Italian cinema, Neorealism, and its relation to the political and social climate of post-war Italy. Consideration is also given to how these films were received in the 1940s versus how they are screened and felt by today’s viewer. Films analyzed includeBicycle Thieves,The Children Are Watching Us,Rome Open City, Shoeshine.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA200Y5 or ITA201Y5 or permission of department."}, {"name": "ITA343H5 • Italian Cinema: The Neorealist Effect", "description": "(Offered in English) An examination of the evolution and influence of Italian neorealism on films released in the 1950s and 1960s. Films analyzed includeMiracle in Milan,La Strada,Two Women,Umberto D.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA200Y5 or ITA201Y5 or permission of department."}, {"name": "ITA350H5 • Intermediate - Advanced Italian", "description": "(Offered in Italian) An intermediate to advanced-level language course. Students enrich their proficiency in Italian through practical experiences (e.g., interviewing guest speakers, writing articles for online media outlets).", "prerequisites": {"and": [], "or": ["ITA200Y5", "ITA201Y5"]}}, {"name": "ITA351H5 • Creative Writing in Italian Studies", "description": "(Offered in Italian) A course designed to familiarize students with Italian literary traditions through practical applications which encourage them to explore creative reading, writing, and editing processes, and, ultimately, help students to discover and hone their talents. Students investigate different forms of creative writing by, engaging in studio seminars and workshops with invited guest speakers, such as locally- and internationally-based award-winning authors.", "prerequisites": "ITA200Y5 or ITA201Y5 or permission of the department."}, {"name": "ITA352H5 • Italian Media and Social Media Production", "description": "(Offered in Italian) An intermediate-advanced-level language course designed to enhance students’ Italian skills through media production (subtitles, dubbing, etc.), digital analyses of primary texts, and comparisons between human-generated and computer-generated translations. Students collaborate with industry leaders in film, publishing and editing, and reference collection.", "prerequisites": "ITA200Y5 or ITA201Y5 or permission of department."}, {"name": "ITA370H5 •  Machiavelli’s The Prince", "description": "(Offered in English) An in-depth analysis of Machiavelli’sThe Prince, from historical, social, and politicalperspectives.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA200Y5 or ITA201Y5 or permission of department.   "}, {"name": "ITA371H5 • Writings on Politics, Power, and Success (Italian Renaissance)", "description": "(Offered in Italian) An in-depth analysis of Renaissance writings on politics, power, and success. Writers studied include Pietro Aretino, Michelangelo Buonarroti, Baldassare Castiglione, Lorenzo de’ Medici.", "prerequisites": "ITA200Y5 or ITA201Y5 or permission of the department."}, {"name": "ITA373H5 • Italian Sociolinguistics", "description": "(Offered in Italian) A study of Italian dialects, regional variants, and the effect that immigration and emigration have had on the language as we read, hear, and speak it today.", "prerequisites": "ITA200Y5 or ITA201Y5 or permission of the department."}, {"name": "ITA374H5 • Language Teaching Methodology I", "description": "(Offered in Italian) A theoretical-practical approach to language teaching and learning. Based on relevant scholarship, students evaluate existing materials and create their own original exercises which they have the opportunity to implement in another Italian language course.", "prerequisites": "ITA200Y5 or ITA201Y5 or permission of the department."}, {"name": "ITA375H5 • Language Teaching Methodology II", "description": "(Offered in Italian) A theoretical-practical approach to language teaching and learning. Based on relevant scholarship, students evaluate existing materials and create their own original exercises which they have the opportunity to implement in another Italian language course.", "prerequisites": "ITA200Y5 or ITA201Y5 or permission of department."}, {"name": "ITA388H5 • Education Internship in Italian Studies", "description": "(Taught bilingually: English and Italian)An internship opportunity (minimum 100-hours) for students interested in gaining experience in a branch of Education such as teaching, curriculum, administration, etc. Placements, determined in consultation with the student, may include elementary, secondary, or college/university classes, units, and departments. To request an internship placement, write to the program coordinator of Italian prior to course enrolment.", "prerequisites": "ITA200Y5 or ITA201Y5 or permission of department."}, {"name": "ITA390H5 • Writings on Self, Gender, Society (19th Century Italy)", "description": "(Offered in Italian) An examination of the notions of self, gender and society amidst the emergence of new social consciences and technologies in the 19th century. Writers studied include Giacomo Leopardi, Alessandro Manzoni, Giovanni Verga, and the works of the first Italian woman recipient of the Nobel Prize for Literature, Grazia Deledda.", "prerequisites": {"and": [], "or": ["ITA200Y5", "ITA201Y5"]}}, {"name": "ITA391H5 • Writings on Anxiety and Identity in Italian Literature", "description": "(Offered in English)An analysis of the masterpieces of Italian fiction (in English translation), examined against the backdrop of modern-day Italy and centred on issues of national and individual identity. Writers studied include Sibilla Aleramo, Alberto Moravia, Pier Paolo Pasolini, Cesare Pavese, Umberto Saba, Italo Svevo, and Elio Vittorini. Texts will be available in Italian and English.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA200Y5 or ITA201Y5 or permission of department. "}, {"name": "ITA392H5 • Queer Italy: Literature and Cinema", "description": "(Offered in English) An exploration of expressions of gender diversity in Italian culture through time. Particular attention will be paid to issues of persecution, social struggle and activism, censorship, and marginalization of LGBTQ+ individuals and works. Texts will be available in Italian and English.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA200Y5 or ITA201Y5 or permission of department. "}, {"name": "ITA395H5 •  Topics in Italian Studies", "description": "(Offered in English) Students will develop a deeper and more nuanced understanding of key theories and practices as they relate to the central topics investigated in the course. The course may have a historic, literary, cinematic, cultural, or other focus. Students should contact the Department for the topic when course is offered. Texts will be available in Italian and English.", "prerequisites": "ITA200Y5 or ITA201Y5 or permission from the department."}, {"name": "ITA399Y5 • Research Opportunity Program", "description": "An opportunity to conduct in-depth original research, with a supervising professor. Students learn research methods and share in the excitement and discovery of acquiring new knowledge. Students are invited to visitResearch Opportunity Programfor a list of participating faculty projects and for application details.", "prerequisites": {"and": [], "or": ["ITA200Y5", "ITA201Y5"]}}, {"name": "ITA400Y5 • Internship in Italian Studies (Private or Public Sector)", "description": "An internship opportunity for students interested in gaining work-place experience, in private or public sectors. Placements, determined in consultation with the student, may include corporations, local media, non-profit community organizations. To request an internship placement, write to the undergraduate coordinator of Italian prior to course enrolment.", "prerequisites": "(1.0 credit from ITA350H5 or ITA351H5 or ITA352H5) or permission from the undergraduate coordinator of Italian."}, {"name": "ITA415Y5 • Italian Theatre (15th to 18th Century Italy)", "description": "(Offered in English,performancesin Italian)A study of 15th- to 18th-century Italian plays and playwrights, culminating in the staging of a play from one of those eras.Students may take on acting and/or stage-production roles.", "prerequisites": "Open to all students. If enrolled in an Italian Minor, Major or Specialist program: ITA350H5 or ITA351H5 or ITA352H5 or permission of department."}, {"name": "ITA420H5 • Dante's Inferno", "description": "(Offered in English). An in-depth study of theInferno, in Dante’sDivine Comedy.Texts will be available in Italian and English.", "prerequisites": {"and": [], "or": ["ITA350H5", "ITA351H5", "ITA352H5"]}}, {"name": "ITA421H5 • Dante’s Purgatory and Paradise", "description": "(Offered in English) An in-depth study ofPurgatoryandParadise, in Dante’sDivine Comedy. Texts will be available in Italian and English.", "prerequisites": {"and": [], "or": ["ITA350H5", "ITA351H5", "ITA352H5"]}}, {"name": "ITA436Y5 • The 18th Century in Italy", "description": "An investigation of the intellectual trends and literary forms in Italy from the pre-enlightenment to Romanticism. Readings from the works of Vico, Muratori, Gravina, Metastasio, Rolli, Parini, Verri, Beccaria, Goldoni, Alfieri and others.", "prerequisites": "ITA200Y5"}, {"name": "ITA437H5 • History of the Italian Language (Medieval Period to the 1700s)", "description": "(Offered in Italian)A study of the foundations of the Italian language. Topics/key figures in focus include the transition from Latin to Italian, Dante Alighieri, the“Questionedellalingua,”during the Renaissance. Students will explore those and other topics through pertinent readings and linguistic analyses of representative texts.", "prerequisites": {"and": [], "or": ["ITA350H5", "ITA351H5", "ITA352H5"]}}, {"name": "ITA438H5 • History of the Italian Language (19th Century to Present)", "description": "(Offered in Italian)A study of the Italian language, from the 19thcentury to the present, with a focus on contemporary varieties as spoken and written within and outside of national borders.Changes in the language will be analyzed through syntactic, lexical, and morphological perspectives as well as by looking at factors which affect those adjustments (contact with other languages, media, etc.).", "prerequisites": {"and": [], "or": ["ITA350H5", "ITA351H5", "ITA352H5"]}}, {"name": "ITA450H5 • Advanced Italian", "description": "(Offered in Italian) An advanced-level language course. Emphasis is given to enhancing oral proficiency, including pronunciation, and acquiring and practicing nuances and subtleties of the language.", "prerequisites": "1.0 credit from ITA350H5 or ITA351H5 or ITA352H5"}, {"name": "ITA491H5 • Senior Project", "description": "A directed-research project, facilitated by a supervising faculty member in the Italian Studies program. Research may be in cinema, culture, linguistics, literature, or theatre.", "prerequisites": "(1.0 credit from ITA350H5 or ITA351H5 or ITA352H5) or permission from the program coordinator of Italian."}, {"name": "ITA491Y5 • Independent Studies in Italian", "description": "A project supervised by an Italian Studies faculty member on a topic in Italian language, literature or linguistics.", "prerequisites": "ITA350H5 (or equivalent) and written permission of the program coordinator of Italian."}, {"name": "ITA492H5 • Senior Project", "description": "A directed-research project, facilitated by a supervising faculty member in the Italian Studies program. Research may be in cinema, culture, linguistics, literature, or theatre.", "prerequisites": "(1.0 credit from ITA350H5 or ITA351H5 or ITA352H5) or permission from the program coordinator of Italian."}, {"name": "ITA493H5 • Senior Project: Teaching and Learning Language", "description": "A close, practical study in which students observe, actively participate in, and reflect on the teaching and learning processes in an Italian language course, under the supervision of a member of the Italian Studies program. Students develop and implement strategies for the successful delivery of lesson plans and grammatical and communicative activities.", "prerequisites": "(1.0 credit from ITA350H5 or ITA351H5 or ITA352H5) or permission from the program coordinator of Italian."}, {"name": "ITA494H5 • Senior Project: Teaching and Learning Cinema, Literature, or Theatre", "description": "A close, practical study in which students observe, actively participate in, and reflect on the teaching and learning processes in an Italian cinema, literature, or theatre course, under the supervision of a member of the Italian Studies program. Students develop and implement strategies for the successful delivery of lesson plans and discussion-based activities.", "prerequisites": "(1.0 credit from ITA350H5 or ITA351H5 or ITA352H5) or permission from the program coordinator of Italian."}, {"name": "ITA498H5 • Senior Project (Florence Program)", "description": "(Offered in Italian) A directed-research project for students registered in the UTM Florence Program. Projects are facilitated by a supervising faculty member in the Italian Studies program.", "prerequisites": "(1.0 credit from ITA350H5 or ITA351H5 or ITA352H5) or permission from the program coordinator of Italian."}, {"name": "ITA499H5 • Research Opportunity Program", "description": "An opportunity to conduct in-depth original research, with a supervising professor. Students learn research methods and share in the excitement and discovery of acquiring new knowledge. Students are invited to visitResearch Opportunity Programfor a list of participating faculty projects and for application details.", "prerequisites": "1.0 credit from ITA350H5 or ITA351H5 or ITA352H5 or ITA450H5"}]