[{"name": "JEP351H5 • Comparative Environmental Policy", "description": "This course is an introduction to comparative environmental policy. The focus of the course will be comparing different country’s policies on climate change, biodiversity, water, and pollution. Larger themes related to sustainable development and environmental justice will be covered in detail.", "prerequisites": "9.0 credits including (JP251H5 and JPE252H5) or JPE250Y5"}, {"name": "JEP356H5 • Environmental Justice", "description": "Environmental Justice is about the fair treatment of all people in the creation and implementation of environmental policies. It also provides a critical framework to analyze and understand inequalities of an environmental kind. These inequalities are often based around identities of race, class and gender, such that marginalized groups are made to bear the burden of environmental externalities like pollution. Why are First Nations in Canada less likely to have access to safe drinking water? Why are industrial plants often in low-income neighborhoods? After critical examinations of the theories and foundations of environmental justice, this course uses a case study approach to understanding the concepts and the ways in which it has shaped modern society.", "prerequisites": "9.0 credits"}, {"name": "JEP452H5 • Politics and Policy of Wildlife Conservation", "description": "This course is an in-depth analysis of conservation policy in Canada. The course begins with an overview biodiversity crisis facing the planet and then moves to an overview of Canada's approach to managing biodiversity across the country. We will carefully examine the federal Species at Risk Act as well as the provincial and territorial wildlife legislation. The remaining of the course will be aimed at making improvements to the Canadian strategy. During the course of the semester, the students will focus on the recovery of endangered species in Canada through the development of a recovery strategy for a specific species.", "prerequisites": "14.0 credits including ENV100Y5 and JPE251H5"}, {"name": "JPE251H5 • Introduction to Canadian Environmental Law and Policy I", "description": "This course serves as an introduction to environmental policy and law in Canada. The primary intent is to provide an overview of the political context in which environmental policy and law is made and implemented. The emphasis in this course will be on environmental policy. The course begins with an outline of the Canadian parliamentary system and policymaking process. A series of case studies, from biodiversity to climate change, are then explored as a way to see the policy process in action. [24L]", "prerequisites": "3.5 credits"}, {"name": "JPE252H5 • Introduction to Canadian Environmental Law and Policy II", "description": "This course builds on the themes and concepts introduced inJPE251H5. The primary intent is to provide an overview of the political context in which environmental policy and law is made and implemented. The emphasis in this course will be on environmental law. [24L]", "prerequisites": "JPE251H5"}, {"name": "POL111H5 • Canada in Comparative Perspective", "description": "Examines major facets of Canadian government and politics within a broad comparative context asking what is different or unique about Canada and what resembles political systems elsewhere in the world, primarily western industrialized countries. Comparative analysis is used to foster a deeper understanding of Canada and its politics.", "prerequisites": "JPE251H5"}, {"name": "POL112H5 • Democracy in Theory and Practice", "description": "Examines current ideas about what constitutes 'democracy' and how real-world political systems measure up to democratic ideals. Through examination of formal government institutions and informal political practices, assessments will be made of the strengths and weaknesses in modern democracies. Case studies may be drawn from Canada or from other countries which claim to be democratic.", "prerequisites": "JPE251H5"}, {"name": "POL113H5 • Ideas and Ideologies", "description": "In this course students are introduced to basic concepts in politics such as authority, sovereignty, legitimacy, citizenship, jurisdiction, civil rights and civil liberties. These concepts are then used to examine the fundamental differences between major political ideologies, such as democracy, liberalism, socialism, fascism, conservatism, anarchism and communism.", "prerequisites": "JPE251H5"}, {"name": "POL114H5 • Politics in a Global World", "description": "Examines the politics of globalization in its various forms (economics, cultures, environmental and military) as well as the consequences of, management of and resistance to, globalization. Address topics such as whether globalization challenges the capacity of national societies and their governments to deal with global issues such as the environment, redistribution of wealth, security and human rights, both within countries and across borders.", "prerequisites": "JPE251H5"}, {"name": "POL115H5 • Evidence and Argument in the Study of Politics", "description": "To understand politics in our information-abundant world, we need ways to make sense of the political information that surrounds us. In this course, we ask what makes for good evidence and what makes for convincing argument. We do so by raising a series of weekly topics on which there is a mass of available information - topics like climate change, political correctness, populism, and democracy promotion, among others - and discussing fundamentally different perspectives on each topic. In the end, students will develop a fuller sense of what constitutes a well-argued and evidence-supported analysis of the political.", "prerequisites": "n/a"}, {"name": "POL116H5 • Politics & Social Justice", "description": "​In this course students are introduced to the concept of social justice as a political issue. The course is designed to develop modes of analysis that focus on human rights, economic and social (in)equity, fairness and inclusion. Key concepts may include power, identity, conflict, community, consent, advocacy, inequality, solitary, structural racism, and intersectionality. Specific issues to be considered may include gender equality, racism, justice between generations, spatial inclusion, wealth distribution, and equity in the international realm. The substantive themes and perspective may vary from year to year.", "prerequisites": "n/a"}, {"name": "POL200Y5 • Justice and Power in Political Life", "description": "Studies the themes of power and justice in the history of political thought, from the ancient world until the 1700s. Readings may include work from Plato, Aristotle, Machiavelli, and Locke.", "prerequisites": "1.0 POL credit or 4.0 credits"}, {"name": "POL203H5 • Politics and Government of the United States", "description": "A comparative study of the development of American government and the main elements of the American political tradition; the structure and functioning of executives, legislatures, courts, bureaucracies, parties and pressure groups in federal and state government; characteristic processes of American politics such as voting, bargaining and regulation; and resultant patterns of public policy.", "prerequisites": "1.0 POL credit or 4.0 credits"}, {"name": "POL209H5 • Introduction to International Relations", "description": "This course provides a general overview of the study of international relations. It builds a theoretical, conceptual, and empirical foundation for understanding the actors, processes, and structures that shape and constrain global politics.", "prerequisites": "1.0 POL credit or 4.0 credits"}, {"name": "POL210H5 • Contemporary Challenges in International Relations", "description": "This course explores contemporary challenges in the study of international relations. Building off of theoretical foundations, it provides an analytic exploration of key puzzles and topical issues that currently confront international relations scholarship.", "prerequisites": "POL209H5"}, {"name": "POL215H5 • Canadian Government", "description": "This course will focus on Canadian Institutions, the Constitution, Federalism, the Courts, the Charter of Rights and Freedoms, etc. This course will contribute to the students' understanding of their immediate political surroundings. This course will enhance the students' ability to engage and participate in the democratic system by teaching them about the foundations of the Canadian system of government.", "prerequisites": "1.0 POL credit or 4.0 credits"}, {"name": "POL216H5 • Canadian Politics", "description": "This course will focus on political parties, elections, gender, cleavages, etc. This course will enhance the knowledge of the Canadian system of politics to give students better skills and objectives.", "prerequisites": "POL215H5"}, {"name": "POL218H5 • Introduction to Comparative Politics: Institutions", "description": "Comparative politics compares the ways people and institutions interact, in different countries and regions of the world (including both developing and developed), to produce what we call \"politics.\" This course focuses on political institutions. Topics include: the formation, development and eventual decay of political institutions such as the nation-state, political regimes, parties, party systems and local governments; the power of the state; the emergence and dynamics of democratic and authoritarian institutions; the emergence and dynamics of capitalist institutions.", "prerequisites": "1.0 POL credit or 4.0 credits"}, {"name": "POL219H5 • Introduction to Comparative Politics: Processes and Identities", "description": "Comparative politics compares the ways people and institutions interact, in different countries and regions of the world (including both developing and developed), to produce what we call \"politics.\" This course focuses on political processes and identities. Topics include: the ideas and interests shaping political behaviour; the causes of and dynamics of political mobilization, social mobilization, and revolution; the relationship between identity categories such as ethnicity, gender, sexuality, and class and political processes.", "prerequisites": "1.0 POL credit or 4.0 credits"}, {"name": "POL243H5 • Research Methods for Political Science I", "description": "This course offers an introduction into scientific inquiry and research in the field of politics. It explores a wide range of quantitative and qualitative methods with the aim of providing basic literacy and comprehension of methods important in encountering -and eventually, conducting – research in political science.", "prerequisites": "1.0 POL credit or 4.0 credits"}, {"name": "POL244H5 • Research Methods for Political Science II", "description": "In this course, students learn to conduct political analysis using methods common in the social sciences. This includes data such as surveys, international or social media datasets, and methods such as crosstabs and regression. Rather than stressing mathematical concepts, the emphasis of the course is on application, interpretation, and data visualization.", "prerequisites": "POL243H5"}, {"name": "POL300H5 • Topics in Comparative Politics", "description": "Topics will vary from term to term. Consult the UTM Timetable.", "prerequisites": "2.0 credits in POL"}, {"name": "POL301H5 • Topics in Political Theory", "description": "Content of course will vary from year to year. Consult the UTM Timetable.", "prerequisites": {"and": [], "or": ["POL200Y5", "POL200Y1"]}}, {"name": "POL302H5 • Topics in Comparative Politics", "description": "Topics will vary from term to term. Consult the UTM Timetable.", "prerequisites": "2.0 credits in POL"}, {"name": "POL303H5 • The Politics of Islam", "description": "The course examines the theory and practice of Islamic politics in the modern era. It also looks at Western foreign policy and Western cultural reactions to politics in the Muslim world. The aim is to acquaint students with the diversity within the Muslim world and help them better understand some of the most pressing political issues raised by contemporary Islam.", "prerequisites": "2.0 POL credits"}, {"name": "POL304H5 • Politics of South Asia", "description": "This course surveys systems of government and political processes across South Asia, with attention to state formation, nationalism, ethnicity, democracy vs. authoritarian forms of governance, social movements, political violence, insurgencies, political economy, corruption, and other important issues affection South Asian states currently. The focus will be mostly on India and Pakistan and possibly some of the other countries in South Asia.", "prerequisites": "2.0 credits in POL or permission of the instructor."}, {"name": "POL305H5 • Topics in International Relations", "description": "Content of course will vary year to year. Consult with the UTM Timetable.", "prerequisites": {"and": [], "or": ["POL208Y5", "POL208Y1", {"and": ["POL209H5", "POL210H5"], "or": []}, {"and": ["POL218H1", "POL219H1"], "or": []}]}}, {"name": "POL307H5 • Topics in International Relations", "description": "Topics will vary from term to term. Consult the UTM Timetable.", "prerequisites": "2.0 credits in POL"}, {"name": "POL309Y5 • The State, Planning and Markets", "description": "A study of the political economy of planning and markets, the history of both forms of organization, the political philosophies of liberalism and Marxism upon which they have been based, and the issues of economic efficiency, justice and democratic control in capitalism and socialism.", "prerequisites": {"and": [], "or": ["POL200Y5", "POL200Y1"]}}, {"name": "POL311H5 • Military Power", "description": "This course explores the foundations, application, and limits of military power in the international system. It examines theories about the use of force, military effectiveness, and the relationships between military power, politics, and technology.", "prerequisites": "2.0 credits in POL"}, {"name": "POL312H5 • Managing Military Conflict", "description": "Analysis of different aspects of conflict management, including security regimes, U.N. peacekeeping, mediation, bilateral as well as multilateral techniques.", "prerequisites": "2.0 credits in POL"}, {"name": "POL313H5 • European Politics I", "description": "This course introduces students to the political foundations of democratic government and capitalism in Western Europe.The course covers the historical origins of the modern nation state in Europe and the region’s bumpy road to democracy and prosperity. It also focuses on key similarities and differences in the political institutions, political development, and economic and social models of major European countries.", "prerequisites": "2.0 credits in POL"}, {"name": "POL314H5 • European Politics II", "description": "This course explores the functions (and dysfunctions) of the European Union, a regional organization shaping the political life of its 27 European member states. The course also covers contemporary challenges to democracy and prosperity in Europe, such as populism, economic crises, Brexit, and geopolitical conflicts.", "prerequisites": "2.0 credits in POL"}, {"name": "POL317H5 • Comparative Public Policy and Administration", "description": "Major theories and concepts in the fields of public administration and public policy, drawing on the experience of advanced industrialized nations.", "prerequisites": "3.0 POL credits, including 1.0 credit in comparative politics or public policy"}, {"name": "POL318H5 • Power and Conflict in Federalism", "description": "This course looks at how Canadian federalism has evolved and adapted to policy-making challenges, including urbanization, regionalism, and demographic changes among the Canadian population. In additional to the Constitution and the role of federal and provincial governments, we also examine the involvement of municipalities, First nations, and non-governmental actors including private and third sector groups.", "prerequisites": "   POL111H5 or POL214Y5 or POL214H1 or POL215H5 or POL216H5 "}, {"name": "POL320Y5 • Modernity and Resistance", "description": "This course covers the history of political thought in the 18th and 19th centuries.", "prerequisites": {"and": [], "or": ["POL200Y5", "POL200Y1"]}}, {"name": "POL322H5 • The Idea of Human Rights", "description": "We sometimes make claims about “human rights,” but why?This course will cultivate anunderstanding of the originsanddevelopment of the human rights ideaover time. Why do states engage in political violence, and how did the language of human rights emerge in response to that violence? Where did theconcept ofhuman rightsoriginate, and how did it get written into law? Are human rightstrulyuniversal?After confronting these questions, the course will shift to theories of how the global human rights regime is meant to operate. For example, how might it work to shame, sanction, or used armed intervention to advance the cause of human rights?", "prerequisites": "2.0 credits in POL"}, {"name": "POL323H5 • The Practice of Human Rights", "description": "This course operates like a human rights clinic, considering concrete examples of human rights in practice. Through case studies of countries like Guatemala, Libya, Bosnia, Uganda, and Indonesia, we will consider the following questions: What is the current state of the human rights movement today? What role does human rights law and social activism play in changing practices? And what are the most effective and ineffective human rights interventions? Students will analyze current trends, like the pursuit of criminal accountability for atrocity criminals, and they will propose how to prevent backlash against human rights defenders around the world.", "prerequisites": "POL322H5"}, {"name": "POL327H5 • Comparative Foreign Policy", "description": "Comparative study of the foreign policies of Russia/USSR, the United States, Great Britain, France and Germany.", "prerequisites": {"and": [], "or": ["POL208Y5", "POL209H5", "POL210H5", "POL218Y5", "POL208Y1", "POL218H5", "POL219H5"]}}, {"name": "POL340Y5 • International Law", "description": "International law as an instrument of conflict resolution. Recognition, sovereign immunity, subjects of international law, and jurisdiction are some of the subjects examined.", "prerequisites": {"and": [], "or": ["POL208Y5", {"and": ["POL209H5", "POL210H5"], "or": []}, "POL218Y5", {"and": ["POL218H5", "POL219H5"], "or": []}]}}, {"name": "POL342H5 • Data Visualization and Analysis for the Social Sciences", "description": "A practical introduction to visualizing and analyzing data about people, societies, and governments. Students will learn to interpret data to describe and explain the world.", "prerequisites": {"and": [], "or": ["POL242Y5", {"and": ["POL243H5", "POL244H5"], "or": []}]}}, {"name": "POL343H5 • Qualitative Methods", "description": "This course focuses on the research process with attention to writing research proposals and qualitative research methods.", "prerequisites": {"and": [], "or": ["POL242Y5", "POL243H5"]}}, {"name": "POL344H5 • Concepts, Actors, & Challenges in Global Governance", "description": "An introduction to the study of Global Governance. It presents Global Governance both as an area of study within International Relations theory, and as a set of norms and procedures that guide ongoing practices within international politics. The course will take students through the early development of the concept in the 1990s to present times. It will also cover key challenges to Global Governance.", "prerequisites": {"and": [], "or": ["POL208Y5", "POL209H5", "POL210H5", "POL208Y1", "POL218H1", "POL219H1"]}}, {"name": "POL345H5 • Global Governance in Practice", "description": "This course builds on earlier conceptual discussions inPOL344H5, to illustrate how Global Governance is practiced within specific empirical contexts. Students will take a deep dive into pressing examples of Global Governance practices and challenges (e.g., the United Nations, the World Health Organization, the global political economy).", "prerequisites": "POL344H5"}, {"name": "POL346H5 • Urban Politics I", "description": "This course examines urban politics and policy, with a focus on structures of governance. Students will be introduced to key concepts in urban politics scholarship, including electoral politics, finance, participation, and the built environment. Examples are taken from the Greater Toronto Area, as well as cities across Canada and North America.", "prerequisites": "2.0 credits in POL"}, {"name": "POL347H5 • Urban Politics II", "description": "This course examines urban politics and policy problems such as inequality, sustainability, immigration, and regionalism. Readings and other course content will focus on contemporary cases of urban policy challenges and conflict in cities and urban regions.", "prerequisites": "POL346H5"}, {"name": "POL354H5 • Russian Politics", "description": "After covering crucial background on tsarist Russia and the Soviet system, the course considers the legacies of Soviet rule. We then address questions of identity politics in Russia, the country’s changing political economy, the shape of authoritarian institutions, the dynamics of protest and repression, how the authoritarian regime in Russia manages flows of information, and the nature of colonialism in the Russian context.", "prerequisites": "3.0 POL credits or relevant coursework in Russian history, society, or culture"}, {"name": "POL355H5 • Multiculturalism and Citizenship", "description": "How are laws, policies, and social norms affected by the overwhelmingly multicultural character of contemporary societies? This course examines how the realities of contemporary multiculturalism have reshaped civic life, both in Canada and in other societies. The course will attempt to cover both empirical and theoretical-normative approaches to these issues.", "prerequisites": "2.0 POL credits"}, {"name": "POL360H5 • State, Nation and Regime Change in Latin America", "description": "This course offers a comparative and transnational analytical approach to the historical foundations of nation and state building as well as patterns of regime change in Latin America. Specific topics may include revolutions, populism, (neo)colonialism, “racial democracy,”Indigenismo, dependency, among others.", "prerequisites": "2.0 POL credits or 8.0 credits"}, {"name": "POL361H5 • Democracy and its interruptions in Latin America", "description": "This course surveys a range of important issues in contemporary Latin America with a focus on the promises and failures of democracy under neoliberalism and post-neoliberalism. Specific topics may include Indigenous politics, Black politics, feminist politics, class conflict, “iron fist” regimes, the War on Drugs, among others.", "prerequisites": "2.0 POL credits or 8.0 credits"}, {"name": "POL362H5 • Borders, Migrants and Refugees", "description": "This course exposes students to the tensions between the mobility of people across international borders, and the hardening regimes of governance facing migrants. The course pays special attention to the intersections of class, race and gender at stake in the politics of migration.", "prerequisites": {"and": [], "or": ["POL114H5", "POL218Y5", {"and": ["POL218H5", "POL219H5"], "or": []}, "POL209H5"]}}, {"name": "POL367H5 • Feminist Political Theory", "description": "This course examines the various interventions that have marked the development of feminist political thought from the mid-20th century onward. These include efforts to complicate the category 'woman', to understand gender in its intersections with race and class, to develop queer feminist accounts of ‘sex’ and ‘sexuality’, and to investigate the meaning of 'feminism' as a political project in and of itself.", "prerequisites": "3.0 POL credits"}, {"name": "POL368H5 • Gender and Politics", "description": "An introduction to gender and politics that examines women as political actors and their activities in formal and grassroots politics.", "prerequisites": "2.0 credits in POL"}, {"name": "POL370H5 • Resource Politics in Postcolonial Africa", "description": "This course identifies natural resource exploitation as a prominent focus in discourses and policies concerned with African countries in the post-independence era (~1960s onwards), particularly when dealing with issues of conflict, democratization, economic development, poverty and regime crisis.", "prerequisites": "A minimum 1.0 POL credit at the 200-level "}, {"name": "POL371H5 • Contemporary Mediated Politics", "description": "This course examines the contemporary relationship between politics and media.", "prerequisites": "2.0 POL credits or (2.0 CCT or VCC credits)"}, {"name": "POL372H5 • Communicating Politics", "description": "This course explores how political actors such as political parties, pressure groups and governments use media to secure their political objectives.", "prerequisites": "2.0 POL credits or (2.0 CCT or VCC credits)"}, {"name": "POL373H5 • Introduction to Politics of the Middle East and North Africa", "description": "Students will examine the political dynamics of selected states in the Middle East and North Africa. Issues to be covered include: state-building; Arab nationalism; Zionism; Islamism; tribalism; gender; the politics of oil. Specific themes relevant to contemporary politics will vary from year to year.", "prerequisites": {"and": [], "or": ["POL218Y5", {"and": ["POL218H5", "POL219H5"], "or": []}]}}, {"name": "POL390H5 • Topics in Comparative Politics", "description": "Content of course will vary from year to year. Consult the UTM Timetable.", "prerequisites": "3.0 POL credits"}, {"name": "POL391H5 • Topics in Comparative Politics", "description": "Content of course will vary from year to year. Consult with the Political Science Handbook.", "prerequisites": "POL218Y5"}, {"name": "POL392H5 • Topics in Political Theory", "description": "Content of course will vary from year to year. Consult the UTM Timetable.", "prerequisites": "3.0 POL credits"}, {"name": "POL393H5 • Topics in Canadian Politics", "description": "Content of course will vary from year to year. Consult the UTM Timetable.", "prerequisites": "3.0 POL credits or 8.0 credits"}, {"name": "POL394H5 • Topics in Political Science", "description": "Content of course will vary from year to year. Consult the UTM Timetable.", "prerequisites": "3.0 POL credits or 8.0 credits"}, {"name": "POL399H5 • Research  Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third year to work in the research project of a professor in return for POL399H course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunities for more details.", "prerequisites": "1.0 POL credit"}, {"name": "POL399Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third year to work in the research project of a professor in return for POL399Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. See Experiential and International Opportunities for more details.", "prerequisites": "1.0 POL credit"}, {"name": "POL401Y5 • Senior Major Research Paper", "description": "This course provides students with the basic skills and knowledge necessary to complete a major independent research paper. The course will have a broad theme (power, equality, justice, federalism, etc.) and students will pursue a research project of their own interest that relates to the course theme. This Y course will meet weekly in the first semester and every other week in the winter semester. Under the course instructors’ supervision, students will identify potential research questions, acquire methodological and research skills appropriate for addressing the research questions, and conduct primary research. Students will present their paper in an open forum late in the second term. This course is intended for students with a strong academic background who intend to pursue graduate studies.", "prerequisites": "a minimum of 6.0 POL credits and 3.3 minimum CGPA and permission of instructor"}, {"name": "POL402H5 • Topics in Political Science", "description": "Content of course will vary from year to year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. Consult the UTM Timetable.", "prerequisites": " 3.0 POL credits including 1.0 POL credit at the 300-level "}, {"name": "POL403H5 • Topics in Political Science", "description": "Content of course will vary from year to year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total.Consult the UTM Timetable.", "prerequisites": " 3.0 POL credits including 1.0 POL credit at the 300-level "}, {"name": "POL404H5 • Political Theory for the Present", "description": "Covers 20th- and 21st-century political theory. Topics will vary by faculty offering the course and may include but are not limited to topics in feminist political theory, post-colonial and de-colonial political theory, and political economy.", "prerequisites": "POL200Y5"}, {"name": "POL405Y5 • Political Science Internship", "description": "Through a part-time, unpaid internship (150 hours), students apply the knowledge and skills gained through previous coursework in political science. Participants will develop skill sets through a professional setting combined with class meetings that include workshops, writing, oral presentations, reading and reflection. Placements are made in both the public and private sectors, such as local or regional government offices, law firms, civil society organizations or non-profit agencies.Normally, the 150 hours will be completed by attending the work placement one full day each week from September to April. Students must confirm internship arrangements well in advance and secure departmental approval for their internship position prior to the start of term. Students will be admitted to through an online application.", "prerequisites": "6.0 credits in POL"}, {"name": "POL406H5 • Insurgents, Criminals, and Warlords", "description": "This course provides a theoretical and empirical overview of the role played by violent non-state actors in international politics. Examining insurgents,criminals, andwarlords, the courseexploreswhy these actors resort to violence,thestrategies and tactics they employ, and theconnections that linkthem together.", "prerequisites": "POL209H5"}, {"name": "POL407H5 • The Politics of Oil & Mining Extraction: Contracts, Conflict, Consent", "description": "What can we learn about global politics from an oil or a mining contract? Who are the main actors in such contracts? What are key differences between oil and mining contracts? What is the future of oil and mining contracts? This course addresses these questions, by examining the complex politics of oil and mining contracts. Key theoretical concepts and themes explored in this course are sovereignty, ownership, resistance, and the future of resource extraction.", "prerequisites": "A minimum 1.0 POL credit at the 300-level"}, {"name": "POL414H5 • The Future of Work", "description": "This course is a critical study of the meaning and value of work in social and political life. Sources include both historical and contemporary political theories of work and labour.", "prerequisites": "POL200Y5"}, {"name": "POL438H5 • Topics in Comparative Politics", "description": "Content of course will vary from year to year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. Consult the UTM Timetable.", "prerequisites": "3.0 POL credits including 1.0 POL credit at the 300-level"}, {"name": "POL440H5 • The Politics of Transition in Eastern Europe I: Attempts to Impose a Marxist-Leninist Revolution", "description": "The political order, largely imposed or supported by the Soviet Union in the wake of World War II, throughout Eastern Europe, promised positive revolutionary change in all political, economic and social interactions, and indeed in restructuring peoples' psychology. By 1989 it was evident that the revolution and its promises had not materialized and the dissatisfaction and disillusionment of the populations in the region led to regime implosions in a domino-like fashion in state after state, setting the stage for a new fundamental transformation.", "prerequisites": "POL208Y5 or (POL209H5 and POL210H5) or POL218Y5 or (POL218H5 and POL219H5) or permission of instructor"}, {"name": "POL441H5 • The Politics of Transition in Eastern Europe II: The Struggle for Democracy", "description": "The struggle for democracy in an expanded new Eastern Europe, especially after the collapse of the Soviet Union itself, created great opportunities for the fundamental transformation of the political, economic and social order, but it also has been painful and unpredictable. There have been impressive successes but also problems of break-ups and integration and occasionally, retrenchment. At the same time the region has also been a laboratory for fundamental transition.", "prerequisites": "POL440H5 or permission of instructor"}, {"name": "POL444H5 • Protest and Revolution in the Middle East and North Africa", "description": "Looking at uprisings and protests in the Middle East and North Africa, students will examine different theories of contentious politics to better understand why and how uprisings happen in the region. The course will focus on the 2011 Arab Spring uprisings/revolutions in addition to recent uprisings in countries that did not experience the Arab Spring.", "prerequisites": {"and": ["POL391H5", "POL373H5"], "or": ["POL218Y5", {"and": ["POL218H5", "POL219H5"], "or": []}, "POL390H5"]}}, {"name": "POL445H5 • The Politics of Queer and Trans Migrations", "description": "This course offers a critical perspective about migration studies by centering the experiences of queer and trans migrants, and by adopting a feminist, queer and trans theory lens. Sources foreground intersections of gender, sexuality, race, class and nation.", "prerequisites": "POL362H5 or POL390H5 (Summer 2020) or POL377H1 (Summer 2021)"}, {"name": "POL446H5 • Politics of the South Asian Diaspora in Comparative Perspective", "description": "This course examines the politics of South Asian diasporas in Canada, scaled at local, provincial, and national levels. Major themes include democratic representation, multiculturalism, social mobilization, and dilemmas of cultural autonomy. Other diasporic groups globally - both South Asian and otherwise - are examined for the purpose of comparison.", "prerequisites": "4.0 credits in POL including 1.0 POL credit at the 300-level"}, {"name": "POL447H5 • Collective Action and Political Change", "description": "This course introduces students to the study of collective action, the conditions under which it is possible, and its role in bringing about political change. It addresses foundational concepts and theories, as well as cases of collective action with a focus on the experiences of subaltern groups in the Americas and beyond.", "prerequisites": "4.0 POL credits, including 1.0 POL credit at the 300-level"}, {"name": "POL448H5 • Protest and Social Movements in Comparative and Transnational Perspective", "description": "This course focuses on key threads of subaltern collective action in comparative and transnational perspective, with a focus onLatin America. Itdelves into revolutionary, feminist, solidarity, decolonial, anti-racist, body-centered, anti-extractivist struggles, among others,from the late 20th Century to the present day.", "prerequisites": "4.0 POL credits, including 1.0 POL credit at the 300-level"}, {"name": "POL475H5 • Global Environmental and Sustainability Politics", "description": "This course examines the challenges faced by humanity in dealing with global environmental and sustainability problems and the politics of addressing them. Focuses on both the underlying factors that shape the politics of these problems - such as scientific uncertainty, North-South conflict, equity concerns, globalization and production and consumption patterns - and explores attempts at the governance of specific global or transnational environmental and sustainability issues by state and non-state actors.", "prerequisites": "3.0 POL credits, including 1.0 POL credit at the 300-level"}, {"name": "POL476H5 • Moral Reason and Economic History I", "description": "A study of the interaction between political philosophy and economic history. The course involves alternative conceptions of the relation between individuals and the community, between the economy and the political order, between what 'is' and what 'ought to be.'", "prerequisites": "POL309Y5 or POL320Y5 or permission of the instructor"}, {"name": "POL477H5 • Moral Reason and Economic History II", "description": "A study of the interaction between political philosophy and economic history. The course involves alternative conceptions of the relation between individuals and the community, between the economy and the political order, between what 'is' and what 'ought to be.'", "prerequisites": "POL476H5"}, {"name": "POL483H5 • Comparative Political Theory", "description": "This course introduces students to comparative political thought, a field of study in political theory that de-centres \"Western\" perspectives in favour of a more global, comparative approach to studying political questions, problems and concepts. Course materials might include political texts from East Asia, South Asia, Latin America, and the Middle East, read alongside texts from \"the West.\"", "prerequisites": {"and": ["POL200Y5", "POL320Y5"], "or": []}}, {"name": "POL484H5 • Topics in Political Thought", "description": "Topics will vary from term to term. Consult the UTM Timetable.", "prerequisites": "3.0 credits in POL, including 1.0 POL credit at the 300-level."}, {"name": "POL485H5 • Topics in Political Thought", "description": "Content of course will vary from year to year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. Consult the UTM Timetable.", "prerequisites": "POL320Y5 or permission of the instructor"}, {"name": "POL486H5 • Topics in International Relations", "description": "Content of course will vary from year to year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. Consult the UTM Timetable.", "prerequisites": "3.0 POL credits, including 1.0 POL credit at the 300-level"}, {"name": "POL487H5 • Topics in International Relations", "description": "Content of course will vary from year to year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. Consult the UTM Timetable.", "prerequisites": {"and": [], "or": ["POL208Y5", "POL208Y1", {"and": ["POL209H5", "POL210H5"], "or": []}, {"and": ["POL218H1", "POL219H1"], "or": []}]}}, {"name": "POL490H5 • Topics in Canadian Politics", "description": "Content of course will vary from year to year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. Consult the UTM Timetable.", "prerequisites": "3.0 POL credits, including 1.0 POL credit at the 300-level"}, {"name": "POL493H5 • Social Risk and Social Protection", "description": "This class is a study of the welfare state. We will study old and new social risks, such as poverty, homelessness, and unemployment, and consider the types of social protections that are offered against those risks. The class will cover broad theories of the welfare state and social policy, and will also consider specific areas of policy and what governments and non-governmental groups are doing to protect against old and new risks.", "prerequisites": {"and": ["POL215H5", "POL216H5"], "or": []}}, {"name": "POL494H5 • Topics in Canadian Politics", "description": "Content of course will vary from year to year. The contact hours for this course may vary in terms of contact type (L,S,T,P) from year to year, but will be between 24-36 contact hours in total. Consult the UTM Timetable.", "prerequisites": "3.0 POL credits, including 1.0 POL credit at the 300-level"}, {"name": "POL495Y5 • Undergraduate Reading Course", "description": "This is a student-initiated course of reading and research on a specialized topic of interest to the student. It is normally only open to students enrolled in Political Science Specialist and Major programs. Students wishing to enrol must find a faculty member willing to supervise the course, develop a program of study in consultation with the supervisor and obtain written approval for the course from the chair.", "prerequisites": "Permission of Instructor and of the Chair"}, {"name": "POL496H5 • Undergraduate Reading Course", "description": "This is a student-initiated course of reading and research on a specialized topic of interest to the student. It is normally only open to students enrolled in Political Science Specialist and Major programs. Students wishing to enrol must find a faculty member willing to supervise the course, develop a program of study in consultation with the supervisor and obtain written approval for the course from the chair.", "prerequisites": "Permission of Instructor and of the Chair"}, {"name": "POL499H5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third year to work in the research project of a professor in return forPOL499H5course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. See Experiential and International Opportunities for more details.", "prerequisites": "Permission of Instructor and of the Chair"}, {"name": "POL499Y5 • Research Opportunity Program", "description": "This course provides a richly rewarding opportunity for students in their third year to work in the research project of a professor in return forPOL499Y5course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter sessions in early February and students are invited to apply in early March. See Experiential and International Opportunities for more details.", "prerequisites": "Permission of Instructor and of the Chair"}]