[{"name": "VCC304H5 • Visual Culture and the Politics of Identity", "description": "Examines the ways in which social-cultural identities are constructed by, and at times disrupt, various visual technologies, logics, and representational strategies. Issues and problems to be addressed include nationality, stereotyping, invisibility, and surveillance. Course materials will be drawn from modern and contemporary art and visual culture, and will also include readings from the fields of feminism, race studies, queer theory, and performance studies.", "prerequisites": {"and": [], "or": ["CCT200H5", "VCC101H5", "VCC201H5"]}}, {"name": "VCC306H5 • Visual Culture and Colonialism", "description": "Many of our most popular and influential image technologies, visual forms, and ways of thinking about images first developed in the second half of the 19th century: the heyday of European colonialism. This course re-examines the visual culture of modernity in the light of this deeply colonial genealogy, through forms such as photography, colour printing, film, exhibitions, postcards, maps, scientific illustrations, and the body as image.", "prerequisites": {"and": [], "or": ["VCC101H5", "VCC201H5"]}}, {"name": "VCC308H5 • Activism in Visual and Media Culture", "description": "This course will examine political and social activism in visual and media culture focusing on the role that visual representation has played in social movements and how artists/activists have employed visual media to achieve specific ends that challenge and resist dominant visual representations and political formations.", "prerequisites": {"and": [], "or": ["VCC101H5", "VCC201H5"]}}, {"name": "VCC309H5 • Society and Spectacle", "description": "Spectacles have been vehicles of social and political power at varying historical moments and locations. Since Guy Debord's Society of the Spectacle was published in 1967 the term has been deployed as a critical concept for thinking about visual culture. This course takes up a number of historical case studies in order to locate and situate phenomena associated with spectacle and spectacular visual entertainments. Topics may include the role of images in mediating contemporary social relations and the connection between spectacle and violence.", "prerequisites": {"and": [], "or": ["VCC101H5", "VCC201H5"]}}, {"name": "VCC334H5 • Media Realities", "description": "This course examines the relationship between mass media technologies and the idea of \"reality\" with an emphasis on the electronic and digital forms that dominate the discourse of \"reality\" in contemporary media culture, television, and the Internet. It will explore such questions as: How do shifting aesthetic conventions of realism, \"reality\" programming, and documentary inflect both theoretical and historical understandings of what constitutes reality? And how do our ideas of media technology inform these conventions and the understandings they produce?", "prerequisites": {"and": [], "or": ["VCC101H5", "VCC201H5"]}}, {"name": "VCC338H5 • Picturing the Suburbs", "description": "This course considers how images of suburbia circulate between two interrelated but often counter-posed realms of visual culture: the popular genres of film, television, and new media entertainment and the iconography of \"high\" art practices such as painting, photography, and avant-garde film. In the process it addresses such fundamental issues as the relation between art and mass production, the aesthetics of private and public space, and the role that visual media play in constructing the socio-political space of the built environment.", "prerequisites": {"and": [], "or": ["VCC101H5", "VCC201H5"]}}, {"name": "VCC360H5 • South Asian Visual Culture", "description": "Popular imagery from the Indian subcontinent is now increasingly visible in the global arena, particularly via the West's discovery of 'Bollywood.' But what have these images meant to South Asians themselves, what are their histories, what traditions and practices do they draw on? This course introduces key concepts for understanding South Asian visual culture and its multifaceted postcolonial modernity. Images examined include popular prints, film, photography, comic books, urban environments, advertisements, crafts, art, propaganda, rituals, television, and the internet.", "prerequisites": {"and": [], "or": ["VCC101H5", "VCC201H5"]}}, {"name": "VCC390H5 • Topics in Visual Culture and Communication", "description": "An in-depth examination of topics in visual and media culture, from both historical and contemporary perspectives. Topics vary from year to year, and the content in any given year depends upon the instructor.", "prerequisites": {"and": [], "or": ["VCC101H5", "VCC201H5"]}}, {"name": "VCC392H5 • Topics in Visual Culture and Communication", "description": "An in-depth examination of topics in visual and media culture, from both historical and contemporary perspectives. Topics vary from year to year, and the content in any given year depends upon the instructor.", "prerequisites": {"and": [], "or": ["VCC101H5", "VCC201H5"]}}, {"name": "VCC394H5 • Comics and Visual Culture", "description": "Examines comics and graphic novels and their histories in print and digital media, including production, dissemination, and reception. Develops a foundational understanding of the visual grammar of comics and addresses theories of narrative.", "prerequisites": "VCC101H5"}, {"name": "VCC397H5 • History of Communication Design", "description": "This course examines the historical development of communication design from the industrial revolution to the present. Focuses on the emergence of design theory in changing economic, technological, and social contexts.", "prerequisites": "VCC101H5"}, {"name": "VCC399Y5 • Research Opportunity Program (ROP)", "description": "This course provides a richly rewarding opportunity for third or higher year students who have developed some knowledge of visual culture and communication to work on the research project of a professor in return for 399Y course credit. Students enrolled have an opportunity to become involved in original research, enhance their research skills, and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall/winter session on the ROP website in mid-February and students are invited to apply at that time. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "(VCC101H5 or VCC201H5) and a minimum of 10.0 credits."}, {"name": "VCC400H5 • Advanced Project", "description": "This course is designed to serve as a capstone course for VCC specialists. Students engage with advanced readings in the field and refine skills in critical analysis of selected topics in VCC. A major focus is the design and implementation of an advanced research project selected in consultation with an instructor.", "prerequisites": "(VCC101H5 or VCC201H5) and completion of 13.0 credits. Open only to VCC specialists."}, {"name": "VCC405H5 • Individual Project", "description": "A research project carried out under the supervision of a faculty member. Students will carry out a research project on a selected topic related to VCC. Students must obtain signed permission from the faculty member they would like to have as their supervisor.", "prerequisites": "Completion of 13.0 credits including VCC400H5"}, {"name": "VCC406H5 • Post-Colonialism and the Image", "description": "How has the legacy of modern colonialism across the globe impacted how we see images, how we think about them, and how we make them? And how do images perpetuate or overturn the legacy of colonial power relations? This course introduces students to the key concepts and debates in post-colonial theory as they relate to visual studies.", "prerequisites": {"and": [{"and": [], "or": ["VCC101H5", "VCC201H5"]}, "VCC306H5"], "or": []}}, {"name": "VCC407H5 • Architectures of Vision", "description": "Based upon Michel Foucault's work on modern architectures of surveillance, control, and discipline, this course examines such modern and contemporary architectural-visual formations as the museum, domestic interior, cinema, and the residential and commercial skyscraper. Ways in which these sites have come to define notions of citizenship, privacy and publicity, and community will be of particular focus and concern.", "prerequisites": "13.0 credits including a minimum of 1.0 VCCcredit and (VCC101H5 or VCC201H5)"}, {"name": "VCC409H5 • Capital, Spectacle, War", "description": "This course investigates the conjunction of contemporary global capitalism, spectacle, and militarized neo-liberal governmentality in order to develop a critical understanding of the inter-related forces that constitute the most current and politically and ethically pressing events in the world today. These may include the war on terror, the disaster film genre, technologies of surveillance, politics of humiliation and scandal, and theological and financial speculation and visions of the future. Readings will draw upon both historical and in many cases the latest work in political theory, cinema and new media studies, critical philosophy, and religious studies.", "prerequisites": "VCC101H5 and VCC309H5 and an additional 1.0 credit in VCC"}, {"name": "VCC410H5 • The Collective Afterlife of Things", "description": "This fourth-year interdisciplinary seminar provides students with an opportunity to examine theories of art and artistic practice in the context of contemporary visual culture, environmental devastation, global warming, climate injustice, and species extinction. Readings are drawn from eco-criticism and philosophy, visual studies and political theory, accompanied by contemporary art, film, literature in order to critically examine the concepts of “collective,” “afterlife,” and “things.”", "prerequisites": "VCC101H5 and a minimum of 1.0 credit in VCC at the 300//400 level."}, {"name": "VCC411H5 • Real Space to Cyberspace", "description": "This course examines the re-conception of traditional understandings of architecture and space -- public and private -- brought about by digital technologies. Notions of space affect our conceptions of political, social and inner life; this course investigates the impact of hyperspace and virtual reality on real and imagined space in a global context.", "prerequisites": "FAH101H5 and VCC101H5 and an additional 1.0 credit in VCC"}, {"name": "VCC415H5 • Theory and Criticism of New Media", "description": "Introduces a variety of approaches for interpreting, criticizing, evaluating, and theorizing digital media with a particular emphasis on visual cultural phenomena including augmented reality and virtual reality. Examines how the thinking of new media is conditioned and altered via major theoretical models.", "prerequisites": "VCC101H5 and a minimum of 1.0 credit in VCC at 300/400 level"}, {"name": "VCC419H5 • Animals in Visual Culture", "description": "In 1977 the influential critic John Berger wrote an essay called “Why Look at Animals?” which framed humans’ relationship with animals as a matter of vision or, as we now say, of visual culture. More recently the humanities have been described as taking an “animal turn,” influenced by posthumanist thought and the idea that we are living in a period of unprecedented human impact on the planet, commonly (yet controversially) known as the Anthropocene. How has visual culture studies developed on or challenged Berger’s insights since he wrote that essay? Building on critiques of the category of “nature” as something that somehow pre-exists “culture” and is outside of it, which in turn challenges the terms of our distinctions between humans and animals, how does recent scholarship approach the place of images and vision in human-animal relations, and indeed the very idea of the animal itself?This seminar investigates these questions through texts that discuss key theoretical questions and examine representations of animals across a variety of media, species, historical or geographical contexts, and disciplinary approaches.", "prerequisites": "(VCC101H5 or FAH101H5) and  a minimum of 1.0 VCC credit."}, {"name": "VCC420H5 • The Visual Culture of Automobility", "description": "Cars are the quintessential mass-produced commodities, and as such are central to the spread of capitalism and to the forms, spaces, affects, and imaginaries of modernity, postmodernity and beyond. Drawing on anthropology, geography, architectural theory and cinema studies as well as visual studies, art history and critical theory, this seminar examines the visual cultures of automobility over a range of historical periods and cultural contexts.", "prerequisites": "13.0 credits including (VCC101H5 or VCC201H5) and a minimum of 1.0 VCC credit at the 300/400 level"}, {"name": "VCC425H5 • Art and Media Culture", "description": "Explores intersections of art, pop culture and mass media in Europe and North America between World War II and 1970. Reviews how the definition of art moved into an expanded field of media culture.", "prerequisites": "13.0 credits including (VCC101H5 or VCC201H5) and a minimum of 1.0 VCC credit"}, {"name": "VCC427H5 • Participatory Media", "description": "In order to explore the complex social and political issues surrounding the discourse of democratic participation in today's \"new media\" culture, this course provides a historical and theoretical survey of \"old\" media technologies that embrace the aesthetics of participation, running from popular theatre forms (including vaudeville and Chautauqua) to call-in radio shows, avant-garde and novelty films, activist video art, and the audience-based talk and game shows of fifties television that most directly prefigure the participatory genres of contemporary media programming.", "prerequisites": "(VCC101H5 or VCC201H5) and at least 1.0 credit in VCC"}, {"name": "VCC490H5 • Topics in Visual Culture and Communication", "description": "An in-depth examination of topics in visual and media culture, from both historical and contemporary perspectives. Topics vary from year to year, and the content in any given year depends upon the instructor.", "prerequisites": "13.0 credits including (VCC101H5 or VCC201H5) and a minimum of 1.0 VCC credit."}, {"name": "VCC492H5 • Topics in Visual Culture and Communication", "description": "An in-depth examination of topics in visual and media culture, from both historical and contemporary perspectives. Topics vary from year to year, and the content in any given year depends upon the instructor.", "prerequisites": {"and": [], "or": ["VCC101H5", "VCC201H5"]}}, {"name": "VST410H5 • Internship in Visual Studies", "description": "This internship course provides an opportunity for students to gain practical experience at an institution or business closely related to the arts and to visual studies. This is especially tailored for mature and self-disciplined students in their final year of study, who are ready to apply knowledge acquired in previous courses and are planning a career in the arts and cultural sector. Students registered in any DVS program are eligible to apply. Students work closely with the DVS internship coordinator to establish suitability. Regular updates and a final report and presentation will be required. The final grade for the course will be based on these, along with the assessment of the employer.", "prerequisites": "Minimum completion of 5.5 credits in DVS Programs and 8.0 additional credits and minimum CGPA 2.5 and and permission of internship coordinator."}, {"name": "VST410Y5 • Internship in Visual Studies", "description": "This internship course provides an opportunity for students to gain practical experience at an institution or business closely related to the arts and to visual studies. This is especially tailored for mature and self-disciplined students in their final year of study, who are ready to apply knowledge acquired in previous courses and are planning a career in the arts and cultural sector. Students registered in any DVS program are eligible to apply. Students work closely with the DVS internship coordinator to establish suitability. Regular updates and a final report and presentation will be required. The final grade for the course will be based on these, along with the assessment of the employer.", "prerequisites": "Minimum of 5.5 credits in DVS program courses and 8.0 additional credits and minimum CGPA 2.5 and permission of internship coordinator"}]