[{"name": "WGS200Y5 • Theories in Women, Gender, and Sexuality Studies", "description": "This course provides an opportunity to engage in an in-depth examination of specialized and scholarly work within women, gender, and sexuality studies with a focus on the diverse and multidisciplinary expressions of feminist thought from the perspective of postcolonial, transnational, intersectional, diasporic, Black feminist, indigenous, and queer theories. This course situates the importance of praxis, the relationship between theory and social practice, to women, gender, and sexuality studies. Students will engage throughout with the relationship between theories of gender and sexuality as they relate to, and are inseparable from, an understanding of race and racial formations. It incorporates study of the themes and debates concerning the socially constructed categories of gender and sexuality in historical and contemporary contexts.", "prerequisites": "WGS101H5"}, {"name": "WGS202H5 • Fundamentals of Research in Women and Gender Studies", "description": "This interdisciplinary course focuses on the visions and methods that feminist scholars use to study women's and gender issues within and across a range of traditional disciplines. The course explores feminist epistemologies and research methods to understand how to carry out feminist research. We will focus on how feminist scholars challenge dominant theories of knowledge and the major methodologies employed in the social sciences and humanities.", "prerequisites": "WGS101H5"}, {"name": "WGS205H5 • Introduction to Feminism and Popular Culture", "description": "This course explores the forms and functions of popular culture and its representation and understanding of the social category of women. It examines specific media forms including, but not limited to, film, song, visual arts, music, video, television, advertising and new media forms. It critically analyzes the impact of these portrayals on women in society while examining the cultural constructions of race, sexuality, class and ability.", "prerequisites": "WGS101H5"}, {"name": "WGS210H5 • Women, Gender and Labour", "description": "This course covers a wide range of issues relating to female participation in public and private sectors of the today's Canadian workforce. It examines the relevance of education, perceptions, sexuality and family issues. Services and infrastructure, as well as collective bargaining are also addressed.", "prerequisites": "WGS101H5"}, {"name": "WGS211H5 • Gender, Technology and the Body", "description": "This course engages with feminist theories of embodiment to explore the body’s intersections with gender and technology. Drawing on the interdisciplinary fields of feminist studies, science and technology studies and disability studies, it explores a range of technological and scientific policies and processes that shape and affect bodies in transnational contexts.", "prerequisites": "WGS101H5"}, {"name": "WGS215H5 • Introduction to Women, Public Policy and the Law", "description": "This course introduces students to women's position in Canada as political actors and provides gender-based analysis in relation to public policy and law in Canada. Students will study women's historical participation in and exclusion from policy decision-making processes, and evaluate the impact of feminism and women's activism on Canadian public policies. Using intersectional framework, the course will also examine different ways in which public policies can be made more responsive to gender and diversity concerns as well as the role public policy can play in overcoming gender inequalities. We will investigate key historical changes in public policies affecting Canadian women in such areas as family, workplace, education, poverty-welfare, sexuality and reproductive laws, immigration and refugee laws, and global issues. The course concludes with women's achievements in this area.", "prerequisites": "WGS101H5"}, {"name": "WGS250H5 • Women in Families", "description": "This course studies how the notion of family is conceptualized and organized transnationally and historically and examines the multiple familiar roles of women in diverse contexts.", "prerequisites": "WGS101H5"}, {"name": "WGS299Y5 • Research Opportunity Program", "description": "This courses provides a richly rewarding opportunity for students in their second year to work in the research project of a professor in return for 299Y course credit. Students enrolled have an opportunity to become involved in original research, learn research methods and share in the excitement and discovery of acquiring new knowledge. Participating faculty members post their project descriptions for the following summer and fall-winter sessions in early February and students are invited to apply in early March. SeeExperiential and International Opportunitiesfor more details.", "prerequisites": "Completion of at least 4.0 and not more than 9.0 credits"}, {"name": "WGS301H5 • Representing Islam", "description": "The course explores historical and contemporary debates regarding the construction of gender in Islam. It examines historic and literary representations, ethnographic narratives, legal and human rights discourses, the politics of veiling, and Islamic feminism. This course situates Muslim women as complex, multidimensional actors engaged in knowledge production and political and feminist struggles, as opposed to the static, victim-centered, Orientalist images that have regained currency in the representation of Muslim women in the post 9/11 era.", "prerequisites": "WGS200Y5"}, {"name": "WGS325H5 • Sustainability: Society and Feminist Praxis", "description": "Sustainability considers humanity’s relationship to the environment. It reflects on a feminist politic of care and the specific ways people are affected along lines of race, gender, class, sexuality and citizenship. It explores how feminist scholarship seeks to direct policy change and respond to ecological and climatic crises.", "prerequisites": "WGS200Y5"}, {"name": "WGS335H5 • Women, Migration and Diaspora", "description": "This course examines the process of migration to Canada from a gender perspective, noting the interplay between structural impediments and women's own agency. Historical perspectives on migration and government policy, and on ways women have rebuilt lives and shaped communities.", "prerequisites": "WGS200Y5"}, {"name": "WGS336H5 • Political Aesthetics and Feminist Representation", "description": "This course engages with feminist theoretical models and approaches to examine the ways in which the “body” has been constructed, enacted, and embodied through aesthetic forms like photography, cinema, music, performance, film and to understand how women, queer, and racialized artists use aesthetics as a response to social and political crises. This course considers what constitutes the relationship between thepoliticaland theaestheticand approaches aesthetics as important sites of ideological and political tension.", "prerequisites": "WGS200Y5"}, {"name": "WGS337H5 • Special Topics in Women and Gender Studies", "description": "A special topic by guest instructor. Topics vary from year to year. Check the web site for current offerings.", "prerequisites": "WGS200Y5"}, {"name": "WGS340H5 • Black Feminisms: Diasporic Conversations on Theory and Practice", "description": "This course examines how Black Feminisms are theorized, produced and practiced, by predominantly Black women scholars, activists and cultural producers located in the diaspora - Canada, the United States and the Caribbean.", "prerequisites": {"and": [], "or": ["WGS101H5", "WGS200Y5"]}}, {"name": "WGS341H5 • Black Queer Cinema and Visual Culture", "description": "This course introduces students to LGBTIQ themed films and visual culture from Africa and the diaspora. It analyzes gender and sexuality from the perspective of black/African filmmakers, visual artists, and theorists.", "prerequisites": {"and": [], "or": ["WGS200Y5", "WGS205H5"]}}, {"name": "WGS343H5 • The Montreal Experience: Sex and Gender in la Cité", "description": "This course examines how gender and sexuality intersect with factors such as nationhood, race, language, politics, religion, geography, and the arts in Quebec. After six classroom sessions, the class will travel to Montreal for 4-5 days, where they will visit museums, cultural institutions and attend guest lectures at various institutions. This experiential learning opportunity allows students to engage in deeper learning to see the issues and histories they have been studying come to life. Ancillary fees apply for this course.", "prerequisites": "WGS200Y5 or WGS205H5"}, {"name": "WGS345H5 • Genealogies of South Asian Feminisms", "description": "This course examines the histories of activism for and by women in South Asia (India, Pakistan, Bangladesh, Sri Lanka) from the colonial period to the present. Topics include colonialism, the Partition of 1947, war, religion, development, labour, nationalism, and the family/reproductive rights.", "prerequisites": {"and": [], "or": ["WGS101H5", "WGS200Y5"]}}, {"name": "WGS347H5 • Indigenous Feminisms and Decolonization", "description": "This course explores themes related to Indigenous feminist scholarship and activism in North America. The course centres on how Indigenous women engage in decolonial practices as a response to histories of colonialism and genocide. Themes include status and tribal nations; oral history and narrative; violence and resistance, knowledge construction and pedagogy, community, self-governance and freedom.", "prerequisites": {"and": [], "or": ["WGS101H5", "WGS200Y5"]}}, {"name": "WGS348H5 • Sex, Gender, and the Environment", "description": "This course discusses, historicizes, and theorizes the undeniable connection between the health of our bodies and the health of our planet. This course engages with Indigenous feminisms, Black feminisms, and queer/decolonial/anticolonial thought to build a response to historic and ongoing colonial, gender-based, and environmental violence through grounded justice practices.", "prerequisites": {"and": [], "or": ["WGS101H5", "WGS200Y5"]}}, {"name": "WGS350H5 • Critical Race Theory in Women and Gender Studies", "description": "This course's central focus is an examination of the way race and gender operate together in structuring social inequality. It offers the analytical tools for exploring the interconnections between race and gender, along with other systems of domination, and incorporates perspectives from women of colour and from women in the global \"South.\"", "prerequisites": "WGS200Y5"}, {"name": "WGS351H5 • Gender, Race, and Surveillance", "description": "From forced sterilization and sex-selective abortion, to selfies, prisons, and biosecurity, this course conceptualizes suspicion and technologies of surveillance in transnational perspectives. Informed by a range of interdisciplinary scholarship, namely critical transnational feminist and Black feminist texts, it interrogates how surveillance has long enacted racialized, gendered, and biopolitical injustices.", "prerequisites": "WGS200Y5"}, {"name": "WGS353H5 • Theories of Masculinity", "description": "Working with gender studies' theories, this course draws on social and cultural constructions and practices to offer a complex reading of masculinities. It explores contemporary debates of the ways in which masculinities have been theorized and experienced in practices and identity formation.", "prerequisites": "WGS200Y5"}, {"name": "WGS354H5 • Gender, Sexuality and Sport", "description": "This course explores how gender, sexuality and other intersectional identity markers work within and against structures of privilege and oppression in the world of sport. It takes up topics and themes that inform popular culture and influence the construction of social norms.", "prerequisites": "WGS200Y5"}, {"name": "WGS355H5 • Wired Women: Gender, Cyberspace and New Information Technology", "description": "The course examines how computer technologies facilitate women's participation in cyberspace and how women define and construct their involvement. It studies the simultaneous generation of new modalities of empowerment and disempowerment including language, role-playing, communication, gaming, and networking and conduits for sex trafficking, harassment and other forums of exploitation.", "prerequisites": "WGS200Y5"}, {"name": "WGS365H5 • Gender, Justice and the Law", "description": "This course discusses the construction and representation of women in Canadian and International law. It analyzes specific contexts and historical issues including employment, sexuality, reproduction, deviance and a variety of justice theories relating to gender.", "prerequisites": "WGS200Y5"}, {"name": "WGS366H5 • Women and Psychology", "description": "An interdisciplinary analysis of the relationship of women to a variety of psychological and psychoanalytical theories and practices. Topics include gender development, stereotyping and gender roles, the impact of gender on intimate relationships, women and the psychological establishment, women's mental health issues and feminist approaches to psychoanalysis.", "prerequisites": "WGS200Y5"}, {"name": "WGS367H5 • Women and Health", "description": "Feminist theories and frameworks examining the interconnections between women, health and biomedicine in North America and transnationally.", "prerequisites": "WGS200Y5"}, {"name": "WGS368H5 • Women in World Cultures", "description": "Examines the diversity and shared experiences of women in western and non-western societies. This is primarily a history course, supplemented with some contemporary perspectives. It compares women in diverse economic, cultural and religious settings. As part of this course, students may have the option of participating in an international learning experience that will have an additional cost and application process.", "prerequisites": "WGS200Y5"}, {"name": "WGS369H5 • Women in Science, Technology, Engineering and Mathematics", "description": "Women in Science, Technology, Engineering, Mathematics (S.T.E.M.) analyzes how society, culture, education, and intersectional power relationships shape women’s lives and their career choices and studies the underlying gendered issues in these professions.", "prerequisites": "WGS200Y5"}, {"name": "WGS369Y5 • Gender, Colonialism and Postcolonialism", "description": "An examination of the complexities and the processes of colonialism/postcolonialism. Emphasis is placed on writings by feminists in the Global South, and the diaspora, to explore how subordination was forged and resisted in specific colonial and postcolonial settings.", "prerequisites": "WGS200Y5"}, {"name": "WGS370H5 • On Love: Gender, Sexuality, Identity", "description": "This course considers the construction and mobilization of the gendered, sexed and sexualized subject within its historical, cultural and geographical contexts and seeks to understand the role of love in the construction of gendered identity and sexuality. Through its examination of texts on love, passion and desire, it investigates the lives and treatment of selected women in feminist scholarship in order to think through how ideas about race, class, sexuality, desire and danger are mediated in and through the body.", "prerequisites": "WGS200Y5"}, {"name": "WGS372H5 • Theories of Sexuality", "description": "This course offers a critical overview of contemporary theories of sexuality, focusing on transnational discussions by feminists and queer theorists.", "prerequisites": "WGS200Y5"}, {"name": "WGS373H5 • Gender, Violence and Resistance", "description": "This course will focus on how gender and violence shapes and impacts the lives of women and LGBT persons. The course will explore the concept of gender and the myriad of ways in which it has been shaped by historical, and contextual relations of power and privilege. The course will explore how scholars in the feminist/women's movement have defined the concept of violence as it impacts women and girls.", "prerequisites": "WGS200Y5"}, {"name": "WGS375H5 • The Aesthetics of Sexuality", "description": "What is the relationship between aesthetic form and sexuality? Drawing on theories and methods from feminist and sexuality studies, this course engages this question to understand the emergence of queer aesthetics as a response to social and political crisis, whilst comprehending how LGBTIQ+ artists create livable worlds by imagining otherwise.", "prerequisites": {"and": [], "or": ["WGS200Y5", "WGS205H5"]}}, {"name": "WGS410H5 • Independent Project in Study of Women & Gender", "description": "An opportunity to carry out an extended research project under the supervision of a faculty member. A proposal must be presented to the faculty member and consent obtained before the end of the July registration period.", "prerequisites": "WGS200Y5 and 2.0 WGS 300+ level credits."}, {"name": "WGS411Y5 • Independent Project in Study of Women & Gender", "description": "An opportunity to carry out an extended research project under the supervision of a faculty member. A proposal must be presented to the faculty member and consent obtained before the end of the July registration.", "prerequisites": "WGS200Y5 and 2.0 WGS 300+ level credits."}, {"name": "WGS415H5 • Black Feminist Performance in Popular Culture and Everyday Life", "description": "This course provides students with an understanding of how Black Feminist Performance is read, interpreted and experienced in popular culture and everyday life. The course focuses on texts and cultural work produced by feminist scholars, critics and artists who engage with race, gender and sexuality across multiple sites.", "prerequisites": "WGS200Y5 and 1.0 WGS credit at the 300/400 level"}, {"name": "WGS418H5 • Feminist Cultural Studies of Biomedicine", "description": "From vaccines and contraception, to erectile dysfunction drugs and clinical trials, biomedicine and biotechnologies are increasingly powerful and transformative modalities transnationally. Incorporating methods from feminist postcolonial, cultural, media and technoscience studies, this course examines biomedicine by critically attending to its intersections with gender, race, sexuality, colonialism, capitalism and culture.", "prerequisites": "WGS200Y5 and 1.0 WGS 300+ level credits"}, {"name": "WGS419H5 • Gender and Disability", "description": "A critical interdisciplinary investigation of how gender impacts on central topics in disability studies: the normalized body and cultural representations; sexuality; violence; the cognitive and social roles of medicine; transnational perspectives on disability; and disability rights and issues of social justice including the experience of people with disabilities and responses of resistance.", "prerequisites": "WGS200Y5 and 1.0 WGS 300+ level credits."}, {"name": "WGS420H5 • Engendering Human Rights", "description": "This seminar analyzes human rights responses to particular gendered sites of historical repression including examples of genocide, torture and war. It includes reactions generated from government and international organizations as well as remedies developed by victims/survivors. As part of this course, students may have the option of participating in an international learning experience that will have an additional cost and application process.", "prerequisites": "WGS200Y5 and 1.0 WGS 300+ level credits or (HIS338H5 or HIS438H5)"}, {"name": "WGS421H5 • Engendering Ethics", "description": "This course situates feminist ethics within the context of Western moral theories, and will consider the challenges that have been posed to this tradition from careful consideration of the category of women's experience. It will examine foundational texts in the history of ethics as well as more recent feminist interventions in such paradigms. The course complements the study of the theoretical texts with analysis and discussion of contemporary social and political issues pertaining to gendered selves.", "prerequisites": "WGS200Y5 and 1.0 WGS 300+ level credits"}, {"name": "WGS425H5 • Decolonial Feminist Archival Practices", "description": "This course challenges the notion of the archives as institutions and repositories of historical truths. It develops students’ archival analytical skills using critical feminist intersectional, decolonial, diasporic, and queer approaches. Students learn to reimagine and rethink archival spaces.", "prerequisites": "WGS200Y5 and 1.0 WGS credit at the 300/400 level"}, {"name": "WGS430H5 • Diasporic Sexualities", "description": "What can diaspora studies teach us about sexuality studies? And, what can sexuality studies teach us about diaspora studies? This class examines the relationship between diaspora studies, sexuality studies, and feminist studies by focusing on how diasporic movements of bodies have altered and transformed modern conceptualizations of gender and sexuality. It will investigate how diasporic subjects negotiate their relationship to constructs of home and (un)belonging.", "prerequisites": "WGS200Y5 and 1.0 WGS300+ level credits"}, {"name": "WGS434H5 • Special Topics in Women & Gender Studies", "description": "A special topic by a guest instructor. Topics vary from year to year. Check the web site for information about this offering each term.", "prerequisites": "WGS200Y5 and 1.0 WGS 300+ level credits."}, {"name": "WGS435Y5 • Women and Gender Studies Practicum", "description": "The practicum allows advanced WGS students to combine theory and practice through part-time unpaid placement with a community agency, government body, educational or social change organization.", "prerequisites": "WGS200Y5"}, {"name": "WGS455H5 • Queer Theory", "description": "This course examines the theories, histories and experiences of 'queer' in Canada and transnationally. It incorporates the diversity of emergent cultural expressions of LGBTQ sexuality understood beyond definitions of social identities.", "prerequisites": "WGS200Y5 and 1.0 WGS 300+ level credits"}, {"name": "WGS470H5 • Politicizing Culture: Pop Feminism and Representation", "description": "This course examines the intricate relationships among feminism, culture, power and representation. Major themes include: the construction of gendered, sexualized, and racialized subjectivities; ideologies and the media; bio-and communication technologies; neoliberalism and neocolonialism; and counter interpretations, reclamations, and remixes of hegemonic cultural forms.", "prerequisites": "WGS200Y5 and 1.5 WGS 300+ level credits"}, {"name": "WGS497Y5 • Independent Reading", "description": "Student-initiated project of reading and research, supervised by a member of the Department. Primarily intended for students in a Major program. After obtaining a supervisor, a student must apply to the Department of Historical Studies. A maximum of 1.0 credit in a reading course is permitted.", "prerequisites": "WGS200Y5 and 1.5 WGS 300+ level credits"}]